# Comparing `tmp/composabl_dev-0.4.0.dev5-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/composabl_dev-0.4.0.dev6-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,11 +1,13 @@
-Zip file size: 32202 bytes, number of entries: 9
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 17:00 composabl_dev.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 17:00 composabl/
--rw-r--r--  2.0 unx       57 b- defN 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/entry_points.txt
--rw-r--r--  2.0 unx       10 b- defN 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/top_level.txt
--rw-rw-r--  2.0 unx      562 b- defN 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/RECORD
--rw-r--r--  2.0 unx     1854 b- defN 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/METADATA
--rw-r--r--  2.0 unx      217 b- defN 23-Aug-03 17:00 composabl_dev-0.4.0.dev5.dist-info/WHEEL
--rwxr-xr-x  2.0 unx    81472 b- defN 23-Aug-03 17:00 composabl/__init__.cpython-38-x86_64-linux-gnu.so
-9 files, 84172 bytes uncompressed, 30824 bytes compressed:  63.4%
+Zip file size: 93038 bytes, number of entries: 11
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 18:47 composabl_dev-0.4.0.dev6.dist-info/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 18:47 composabl_dev.libs/

+    <c>   DW_AT_producer    : (strp) (offset: 0x94d): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
     <10>   DW_AT_language    : (data1) 12	(ANSI C99)
-    <11>   DW_AT_name        : (strp) (offset: 0x8b8): dist/build_cython/composabl/__init__.c
-    <15>   DW_AT_comp_dir    : (strp) (offset: 0x13d0): /project/composabl
-    <19>   DW_AT_ranges      : (sec_offset) 0x600
+    <11>   DW_AT_name        : (strp) (offset: 0x7c1): dist/build_cython/composabl/__init__.c
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0x11fd): /project/composabl
+    <19>   DW_AT_ranges      : (sec_offset) 0x4b0
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2a>   DW_AT_name        : (strp) (offset: 0xe11): size_t
+    <2a>   DW_AT_name        : (strp) (offset: 0xcd8): size_t
     <2e>   DW_AT_decl_file   : (data1) 3
     <2f>   DW_AT_decl_line   : (data1) 209
     <30>   DW_AT_decl_column : (data1) 23
     <31>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><35>: Abbrev Number: 3 (DW_TAG_base_type)
     <36>   DW_AT_byte_size   : (data1) 8
     <37>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <38>   DW_AT_name        : (strp) (offset: 0x19cc): long unsigned int
+    <38>   DW_AT_name        : (strp) (offset: 0x175a): long unsigned int
  <1><3c>: Abbrev Number: 3 (DW_TAG_base_type)
     <3d>   DW_AT_byte_size   : (data1) 1
     <3e>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <3f>   DW_AT_name        : (strp) (offset: 0x7f0): unsigned char
+    <3f>   DW_AT_name        : (strp) (offset: 0x6f9): unsigned char
  <1><43>: Abbrev Number: 3 (DW_TAG_base_type)
     <44>   DW_AT_byte_size   : (data1) 2
     <45>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <46>   DW_AT_name        : (strp) (offset: 0x1107): short unsigned int
+    <46>   DW_AT_name        : (strp) (offset: 0xf63): short unsigned int
  <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
     <4b>   DW_AT_byte_size   : (data1) 4
     <4c>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4d>   DW_AT_name        : (strp) (offset: 0x19d1): unsigned int
+    <4d>   DW_AT_name        : (strp) (offset: 0x175f): unsigned int
  <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
     <52>   DW_AT_byte_size   : (data1) 1
     <53>   DW_AT_encoding    : (data1) 6	(signed char)
-    <54>   DW_AT_name        : (strp) (offset: 0x7f2): signed char
+    <54>   DW_AT_name        : (strp) (offset: 0x6fb): signed char
  <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
     <59>   DW_AT_byte_size   : (data1) 2
     <5a>   DW_AT_encoding    : (data1) 5	(signed)
-    <5b>   DW_AT_name        : (strp) (offset: 0x1dff): short int
+    <5b>   DW_AT_name        : (strp) (offset: 0x1b36): short int
  <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
     <60>   DW_AT_byte_size   : (data1) 4
     <61>   DW_AT_encoding    : (data1) 5	(signed)
     <62>   DW_AT_name        : (string) int
  <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
     <67>   DW_AT_byte_size   : (data1) 8
     <68>   DW_AT_encoding    : (data1) 5	(signed)
-    <69>   DW_AT_name        : (strp) (offset: 0x1c04): long int
+    <69>   DW_AT_name        : (strp) (offset: 0x1987): long int
  <1><6d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6e>   DW_AT_name        : (strp) (offset: 0x298): __off_t
+    <6e>   DW_AT_name        : (strp) (offset: 0x23e): __off_t
     <72>   DW_AT_decl_file   : (data1) 4
     <73>   DW_AT_decl_line   : (data1) 140
     <74>   DW_AT_decl_column : (data1) 25
     <75>   DW_AT_type        : (ref4) <0x66>, long int
  <1><79>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7a>   DW_AT_name        : (strp) (offset: 0x1180): __off64_t
+    <7a>   DW_AT_name        : (strp) (offset: 0xfd7): __off64_t
     <7e>   DW_AT_decl_file   : (data1) 4
     <7f>   DW_AT_decl_line   : (data1) 141
     <80>   DW_AT_decl_column : (data1) 27
     <81>   DW_AT_type        : (ref4) <0x66>, long int
  <1><85>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <86>   DW_AT_byte_size   : (data1) 8
  <1><87>: Abbrev Number: 2 (DW_TAG_typedef)
-    <88>   DW_AT_name        : (strp) (offset: 0xe0e): __ssize_t
+    <88>   DW_AT_name        : (strp) (offset: 0xcd5): __ssize_t
     <8c>   DW_AT_decl_file   : (data1) 4
     <8d>   DW_AT_decl_line   : (data1) 181
     <8e>   DW_AT_decl_column : (data1) 27
     <8f>   DW_AT_type        : (ref4) <0x66>, long int
  <1><93>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <94>   DW_AT_byte_size   : (data1) 8
     <95>   DW_AT_type        : (ref4) <0x99>, char
  <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
     <9a>   DW_AT_byte_size   : (data1) 1
     <9b>   DW_AT_encoding    : (data1) 6	(signed char)
-    <9c>   DW_AT_name        : (strp) (offset: 0x7f9): char
+    <9c>   DW_AT_name        : (strp) (offset: 0x702): char
  <1><a0>: Abbrev Number: 7 (DW_TAG_const_type)
     <a1>   DW_AT_type        : (ref4) <0x99>, char
  <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a6>   DW_AT_name        : (strp) (offset: 0x160c): FILE
+    <a6>   DW_AT_name        : (strp) (offset: 0x13c1): FILE
     <aa>   DW_AT_decl_file   : (data1) 5
     <ab>   DW_AT_decl_line   : (data1) 48
     <ac>   DW_AT_decl_column : (data1) 25
     <ad>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
  <1><b1>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <b2>   DW_AT_name        : (strp) (offset: 0x1608): _IO_FILE
+    <b2>   DW_AT_name        : (strp) (offset: 0x13bd): _IO_FILE
     <b6>   DW_AT_byte_size   : (data1) 216
     <b7>   DW_AT_decl_file   : (data1) 6
     <b8>   DW_AT_decl_line   : (data1) 246
     <b9>   DW_AT_decl_column : (data1) 8
     <ba>   DW_AT_sibling     : (ref4) <0x250>
  <2><be>: Abbrev Number: 9 (DW_TAG_member)
-    <bf>   DW_AT_name        : (strp) (offset: 0xf36): _flags
+    <bf>   DW_AT_name        : (strp) (offset: 0xddb): _flags
     <c3>   DW_AT_decl_file   : (data1) 6
     <c4>   DW_AT_decl_line   : (data1) 247
     <c5>   DW_AT_decl_column : (data1) 7
     <c6>   DW_AT_type        : (ref4) <0x5f>, int
     <ca>   DW_AT_data_member_location: (data1) 0
  <2><cb>: Abbrev Number: 9 (DW_TAG_member)
-    <cc>   DW_AT_name        : (strp) (offset: 0x1a90): _IO_read_ptr
+    <cc>   DW_AT_name        : (strp) (offset: 0x1813): _IO_read_ptr
     <d0>   DW_AT_decl_file   : (data1) 6
     <d1>   DW_AT_decl_line   : (data1) 252
     <d2>   DW_AT_decl_column : (data1) 9
     <d3>   DW_AT_type        : (ref4) <0x93>, char
     <d7>   DW_AT_data_member_location: (data1) 8
  <2><d8>: Abbrev Number: 9 (DW_TAG_member)
-    <d9>   DW_AT_name        : (strp) (offset: 0x15d3): _IO_read_end
+    <d9>   DW_AT_name        : (strp) (offset: 0x139e): _IO_read_end
     <dd>   DW_AT_decl_file   : (data1) 6
     <de>   DW_AT_decl_line   : (data1) 253
     <df>   DW_AT_decl_column : (data1) 9
     <e0>   DW_AT_type        : (ref4) <0x93>, char
     <e4>   DW_AT_data_member_location: (data1) 16
  <2><e5>: Abbrev Number: 9 (DW_TAG_member)
-    <e6>   DW_AT_name        : (strp) (offset: 0x1192): _IO_read_base
+    <e6>   DW_AT_name        : (strp) (offset: 0xfe9): _IO_read_base
     <ea>   DW_AT_decl_file   : (data1) 6
     <eb>   DW_AT_decl_line   : (data1) 254
     <ec>   DW_AT_decl_column : (data1) 9
     <ed>   DW_AT_type        : (ref4) <0x93>, char
     <f1>   DW_AT_data_member_location: (data1) 24
  <2><f2>: Abbrev Number: 9 (DW_TAG_member)
-    <f3>   DW_AT_name        : (strp) (offset: 0x1231): _IO_write_base
+    <f3>   DW_AT_name        : (strp) (offset: 0x1088): _IO_write_base
     <f7>   DW_AT_decl_file   : (data1) 6
     <f8>   DW_AT_decl_line   : (data1) 255
     <f9>   DW_AT_decl_column : (data1) 9
     <fa>   DW_AT_type        : (ref4) <0x93>, char
     <fe>   DW_AT_data_member_location: (data1) 32
  <2><ff>: Abbrev Number: 10 (DW_TAG_member)
-    <100>   DW_AT_name        : (strp) (offset: 0xa30): _IO_write_ptr
+    <100>   DW_AT_name        : (strp) (offset: 0x925): _IO_write_ptr
     <104>   DW_AT_decl_file   : (data1) 6
     <105>   DW_AT_decl_line   : (data2) 256
     <107>   DW_AT_decl_column : (data1) 9
     <108>   DW_AT_type        : (ref4) <0x93>, char
     <10c>   DW_AT_data_member_location: (data1) 40
  <2><10d>: Abbrev Number: 10 (DW_TAG_member)
-    <10e>   DW_AT_name        : (strp) (offset: 0x41f): _IO_write_end
+    <10e>   DW_AT_name        : (strp) (offset: 0x399): _IO_write_end
     <112>   DW_AT_decl_file   : (data1) 6
     <113>   DW_AT_decl_line   : (data2) 257
     <115>   DW_AT_decl_column : (data1) 9
     <116>   DW_AT_type        : (ref4) <0x93>, char
     <11a>   DW_AT_data_member_location: (data1) 48
  <2><11b>: Abbrev Number: 10 (DW_TAG_member)
-    <11c>   DW_AT_name        : (strp) (offset: 0x155c): _IO_buf_base
+    <11c>   DW_AT_name        : (strp) (offset: 0x134a): _IO_buf_base
     <120>   DW_AT_decl_file   : (data1) 6
     <121>   DW_AT_decl_line   : (data2) 258
     <123>   DW_AT_decl_column : (data1) 9
     <124>   DW_AT_type        : (ref4) <0x93>, char
     <128>   DW_AT_data_member_location: (data1) 56
  <2><129>: Abbrev Number: 10 (DW_TAG_member)
-    <12a>   DW_AT_name        : (strp) (offset: 0x11e2): _IO_buf_end
+    <12a>   DW_AT_name        : (strp) (offset: 0x1039): _IO_buf_end
     <12e>   DW_AT_decl_file   : (data1) 6
     <12f>   DW_AT_decl_line   : (data2) 259
     <131>   DW_AT_decl_column : (data1) 9
     <132>   DW_AT_type        : (ref4) <0x93>, char
     <136>   DW_AT_data_member_location: (data1) 64
  <2><137>: Abbrev Number: 10 (DW_TAG_member)
-    <138>   DW_AT_name        : (strp) (offset: 0xc66): _IO_save_base
+    <138>   DW_AT_name        : (strp) (offset: 0xb2d): _IO_save_base
     <13c>   DW_AT_decl_file   : (data1) 6
     <13d>   DW_AT_decl_line   : (data2) 261
     <13f>   DW_AT_decl_column : (data1) 9
     <140>   DW_AT_type        : (ref4) <0x93>, char
     <144>   DW_AT_data_member_location: (data1) 72
  <2><145>: Abbrev Number: 10 (DW_TAG_member)
-    <146>   DW_AT_name        : (strp) (offset: 0x1a80): _IO_backup_base
+    <146>   DW_AT_name        : (strp) (offset: 0x1803): _IO_backup_base
     <14a>   DW_AT_decl_file   : (data1) 6
     <14b>   DW_AT_decl_line   : (data2) 262
     <14d>   DW_AT_decl_column : (data1) 9
     <14e>   DW_AT_type        : (ref4) <0x93>, char
     <152>   DW_AT_data_member_location: (data1) 80
  <2><153>: Abbrev Number: 10 (DW_TAG_member)
-    <154>   DW_AT_name        : (strp) (offset: 0x1003): _IO_save_end
+    <154>   DW_AT_name        : (strp) (offset: 0xe91): _IO_save_end
     <158>   DW_AT_decl_file   : (data1) 6
     <159>   DW_AT_decl_line   : (data2) 263
     <15b>   DW_AT_decl_column : (data1) 9
     <15c>   DW_AT_type        : (ref4) <0x93>, char
     <160>   DW_AT_data_member_location: (data1) 88
  <2><161>: Abbrev Number: 10 (DW_TAG_member)
-    <162>   DW_AT_name        : (strp) (offset: 0x171d): _markers
+    <162>   DW_AT_name        : (strp) (offset: 0x14ab): _markers
     <166>   DW_AT_decl_file   : (data1) 6
     <167>   DW_AT_decl_line   : (data2) 265
     <169>   DW_AT_decl_column : (data1) 22
     <16a>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <16e>   DW_AT_data_member_location: (data1) 96
  <2><16f>: Abbrev Number: 10 (DW_TAG_member)
-    <170>   DW_AT_name        : (strp) (offset: 0x77a): _chain
+    <170>   DW_AT_name        : (strp) (offset: 0x683): _chain
     <174>   DW_AT_decl_file   : (data1) 6
     <175>   DW_AT_decl_line   : (data2) 267
     <177>   DW_AT_decl_column : (data1) 20
     <178>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
     <17c>   DW_AT_data_member_location: (data1) 104
  <2><17d>: Abbrev Number: 10 (DW_TAG_member)
     <17e>   DW_AT_name        : (strp) (offset: 0x27): _fileno
     <182>   DW_AT_decl_file   : (data1) 6
     <183>   DW_AT_decl_line   : (data2) 269
     <185>   DW_AT_decl_column : (data1) 7
     <186>   DW_AT_type        : (ref4) <0x5f>, int
     <18a>   DW_AT_data_member_location: (data1) 112
  <2><18b>: Abbrev Number: 10 (DW_TAG_member)
-    <18c>   DW_AT_name        : (strp) (offset: 0x1c2f): _flags2
+    <18c>   DW_AT_name        : (strp) (offset: 0x19b2): _flags2
     <190>   DW_AT_decl_file   : (data1) 6
     <191>   DW_AT_decl_line   : (data2) 273
     <193>   DW_AT_decl_column : (data1) 7
     <194>   DW_AT_type        : (ref4) <0x5f>, int
     <198>   DW_AT_data_member_location: (data1) 116
  <2><199>: Abbrev Number: 10 (DW_TAG_member)
-    <19a>   DW_AT_name        : (strp) (offset: 0x1bb3): _old_offset
+    <19a>   DW_AT_name        : (strp) (offset: 0x1936): _old_offset
     <19e>   DW_AT_decl_file   : (data1) 6
     <19f>   DW_AT_decl_line   : (data2) 275
     <1a1>   DW_AT_decl_column : (data1) 13
     <1a2>   DW_AT_type        : (ref4) <0x6d>, __off_t, long int
     <1a6>   DW_AT_data_member_location: (data1) 120
  <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
-    <1a8>   DW_AT_name        : (strp) (offset: 0x19ee): _cur_column
+    <1a8>   DW_AT_name        : (strp) (offset: 0x177c): _cur_column
     <1ac>   DW_AT_decl_file   : (data1) 6
     <1ad>   DW_AT_decl_line   : (data2) 279
     <1af>   DW_AT_decl_column : (data1) 18
     <1b0>   DW_AT_type        : (ref4) <0x43>, short unsigned int
     <1b4>   DW_AT_data_member_location: (data1) 128
  <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
-    <1b6>   DW_AT_name        : (strp) (offset: 0x1e0e): _vtable_offset
+    <1b6>   DW_AT_name        : (strp) (offset: 0x1b45): _vtable_offset
     <1ba>   DW_AT_decl_file   : (data1) 6
     <1bb>   DW_AT_decl_line   : (data2) 280
     <1bd>   DW_AT_decl_column : (data1) 15
     <1be>   DW_AT_type        : (ref4) <0x51>, signed char
     <1c2>   DW_AT_data_member_location: (data1) 130
  <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
-    <1c4>   DW_AT_name        : (strp) (offset: 0x1b7): _shortbuf
+    <1c4>   DW_AT_name        : (strp) (offset: 0x16c): _shortbuf
     <1c8>   DW_AT_decl_file   : (data1) 6
     <1c9>   DW_AT_decl_line   : (data2) 281
     <1cb>   DW_AT_decl_column : (data1) 8
     <1cc>   DW_AT_type        : (ref4) <0x299>, char
     <1d0>   DW_AT_data_member_location: (data1) 131
  <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
-    <1d2>   DW_AT_name        : (strp) (offset: 0x2d0): _lock
+    <1d2>   DW_AT_name        : (strp) (offset: 0x26a): _lock
     <1d6>   DW_AT_decl_file   : (data1) 6
     <1d7>   DW_AT_decl_line   : (data2) 285
     <1d9>   DW_AT_decl_column : (data1) 15
     <1da>   DW_AT_type        : (ref4) <0x2a9>, _IO_lock_t
     <1de>   DW_AT_data_member_location: (data1) 136
  <2><1df>: Abbrev Number: 10 (DW_TAG_member)
-    <1e0>   DW_AT_name        : (strp) (offset: 0x1bb7): _offset
+    <1e0>   DW_AT_name        : (strp) (offset: 0x193a): _offset
     <1e4>   DW_AT_decl_file   : (data1) 6
     <1e5>   DW_AT_decl_line   : (data2) 294
     <1e7>   DW_AT_decl_column : (data1) 15
     <1e8>   DW_AT_type        : (ref4) <0x79>, __off64_t, long int
     <1ec>   DW_AT_data_member_location: (data1) 144
  <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
-    <1ee>   DW_AT_name        : (strp) (offset: 0x16d6): __pad1
+    <1ee>   DW_AT_name        : (strp) (offset: 0x1464): __pad1
     <1f2>   DW_AT_decl_file   : (data1) 6
     <1f3>   DW_AT_decl_line   : (data2) 303
     <1f5>   DW_AT_decl_column : (data1) 9
     <1f6>   DW_AT_type        : (ref4) <0x85>
     <1fa>   DW_AT_data_member_location: (data1) 152
  <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
-    <1fc>   DW_AT_name        : (strp) (offset: 0xd18): __pad2
+    <1fc>   DW_AT_name        : (strp) (offset: 0xbdf): __pad2
     <200>   DW_AT_decl_file   : (data1) 6
     <201>   DW_AT_decl_line   : (data2) 304
     <203>   DW_AT_decl_column : (data1) 9
     <204>   DW_AT_type        : (ref4) <0x85>
     <208>   DW_AT_data_member_location: (data1) 160
  <2><209>: Abbrev Number: 10 (DW_TAG_member)
-    <20a>   DW_AT_name        : (strp) (offset: 0x16dd): __pad3
+    <20a>   DW_AT_name        : (strp) (offset: 0x146b): __pad3
     <20e>   DW_AT_decl_file   : (data1) 6
     <20f>   DW_AT_decl_line   : (data2) 305
     <211>   DW_AT_decl_column : (data1) 9
     <212>   DW_AT_type        : (ref4) <0x85>
     <216>   DW_AT_data_member_location: (data1) 168
  <2><217>: Abbrev Number: 10 (DW_TAG_member)
-    <218>   DW_AT_name        : (strp) (offset: 0x16e4): __pad4
+    <218>   DW_AT_name        : (strp) (offset: 0x1472): __pad4
     <21c>   DW_AT_decl_file   : (data1) 6
     <21d>   DW_AT_decl_line   : (data2) 306
     <21f>   DW_AT_decl_column : (data1) 9
     <220>   DW_AT_type        : (ref4) <0x85>
     <224>   DW_AT_data_member_location: (data1) 176
  <2><225>: Abbrev Number: 10 (DW_TAG_member)
-    <226>   DW_AT_name        : (strp) (offset: 0x16eb): __pad5
+    <226>   DW_AT_name        : (strp) (offset: 0x1479): __pad5
     <22a>   DW_AT_decl_file   : (data1) 6
     <22b>   DW_AT_decl_line   : (data2) 307
     <22d>   DW_AT_decl_column : (data1) 10
     <22e>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
     <232>   DW_AT_data_member_location: (data1) 184
  <2><233>: Abbrev Number: 10 (DW_TAG_member)
-    <234>   DW_AT_name        : (strp) (offset: 0x1220): _mode
+    <234>   DW_AT_name        : (strp) (offset: 0x1077): _mode
     <238>   DW_AT_decl_file   : (data1) 6
     <239>   DW_AT_decl_line   : (data2) 309
     <23b>   DW_AT_decl_column : (data1) 7
     <23c>   DW_AT_type        : (ref4) <0x5f>, int
     <240>   DW_AT_data_member_location: (data1) 192
  <2><241>: Abbrev Number: 10 (DW_TAG_member)
     <242>   DW_AT_name        : (strp) (offset: 0x1e): _unused2
     <246>   DW_AT_decl_file   : (data1) 6
     <247>   DW_AT_decl_line   : (data2) 311
     <249>   DW_AT_decl_column : (data1) 8
     <24a>   DW_AT_type        : (ref4) <0x2af>, char
     <24e>   DW_AT_data_member_location: (data1) 196
  <2><24f>: Abbrev Number: 0
  <1><250>: Abbrev Number: 11 (DW_TAG_typedef)
-    <251>   DW_AT_name        : (strp) (offset: 0x81a): _IO_lock_t
+    <251>   DW_AT_name        : (strp) (offset: 0x723): _IO_lock_t
     <255>   DW_AT_decl_file   : (data1) 6
     <256>   DW_AT_decl_line   : (data1) 155
     <257>   DW_AT_decl_column : (data1) 14
  <1><258>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <259>   DW_AT_name        : (strp) (offset: 0x12b5): _IO_marker
+    <259>   DW_AT_name        : (strp) (offset: 0x10ff): _IO_marker
     <25d>   DW_AT_byte_size   : (data1) 24
     <25e>   DW_AT_decl_file   : (data1) 6
     <25f>   DW_AT_decl_line   : (data1) 161
     <260>   DW_AT_decl_column : (data1) 8
     <261>   DW_AT_sibling     : (ref4) <0x28d>
  <2><265>: Abbrev Number: 9 (DW_TAG_member)
-    <266>   DW_AT_name        : (strp) (offset: 0xd7b): _next
+    <266>   DW_AT_name        : (strp) (offset: 0xc42): _next
     <26a>   DW_AT_decl_file   : (data1) 6
     <26b>   DW_AT_decl_line   : (data1) 162
     <26c>   DW_AT_decl_column : (data1) 22
     <26d>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <271>   DW_AT_data_member_location: (data1) 0
  <2><272>: Abbrev Number: 9 (DW_TAG_member)
-    <273>   DW_AT_name        : (strp) (offset: 0xffd): _sbuf
+    <273>   DW_AT_name        : (strp) (offset: 0xe8b): _sbuf
     <277>   DW_AT_decl_file   : (data1) 6
     <278>   DW_AT_decl_line   : (data1) 163
     <279>   DW_AT_decl_column : (data1) 20
     <27a>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
     <27e>   DW_AT_data_member_location: (data1) 8
  <2><27f>: Abbrev Number: 9 (DW_TAG_member)
-    <280>   DW_AT_name        : (strp) (offset: 0x1726): _pos
+    <280>   DW_AT_name        : (strp) (offset: 0x14b4): _pos
     <284>   DW_AT_decl_file   : (data1) 6
     <285>   DW_AT_decl_line   : (data1) 167
     <286>   DW_AT_decl_column : (data1) 7
     <287>   DW_AT_type        : (ref4) <0x5f>, int
     <28b>   DW_AT_data_member_location: (data1) 16
  <2><28c>: Abbrev Number: 0
  <1><28d>: Abbrev Number: 6 (DW_TAG_pointer_type)
@@ -354,518 +354,518 @@
     <2b9>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <2bd>   DW_AT_upper_bound : (data1) 19
  <2><2be>: Abbrev Number: 0
  <1><2bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <2c0>   DW_AT_byte_size   : (data1) 8
     <2c1>   DW_AT_type        : (ref4) <0xa0>, char
  <1><2c5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2c6>   DW_AT_name        : (strp) (offset: 0xe10): ssize_t
+    <2c6>   DW_AT_name        : (strp) (offset: 0xcd7): ssize_t
     <2ca>   DW_AT_decl_file   : (data1) 5
     <2cb>   DW_AT_decl_line   : (data1) 102
     <2cc>   DW_AT_decl_column : (data1) 19
     <2cd>   DW_AT_type        : (ref4) <0x87>, __ssize_t, long int
  <1><2d1>: Abbrev Number: 14 (DW_TAG_typedef)
-    <2d2>   DW_AT_name        : (strp) (offset: 0x118a): wchar_t
+    <2d2>   DW_AT_name        : (strp) (offset: 0xfe1): wchar_t
     <2d6>   DW_AT_decl_file   : (data1) 3
     <2d7>   DW_AT_decl_line   : (data2) 321
     <2d9>   DW_AT_decl_column : (data1) 24
     <2da>   DW_AT_type        : (ref4) <0x5f>, int
  <1><2de>: Abbrev Number: 3 (DW_TAG_base_type)
     <2df>   DW_AT_byte_size   : (data1) 8
     <2e0>   DW_AT_encoding    : (data1) 5	(signed)
-    <2e1>   DW_AT_name        : (strp) (offset: 0x1bff): long long int
+    <2e1>   DW_AT_name        : (strp) (offset: 0x1982): long long int
  <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2e6>   DW_AT_name        : (strp) (offset: 0x908): int64_t
+    <2e6>   DW_AT_name        : (strp) (offset: 0x811): int64_t
     <2ea>   DW_AT_decl_file   : (data1) 7
     <2eb>   DW_AT_decl_line   : (data1) 197
     <2ec>   DW_AT_decl_column : (data1) 1
     <2ed>   DW_AT_type        : (ref4) <0x66>, long int
  <1><2f1>: Abbrev Number: 3 (DW_TAG_base_type)
     <2f2>   DW_AT_byte_size   : (data1) 8
     <2f3>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <2f4>   DW_AT_name        : (strp) (offset: 0x19c7): long long unsigned int
+    <2f4>   DW_AT_name        : (strp) (offset: 0x1755): long long unsigned int
  <1><2f8>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2f9>   DW_AT_name        : (strp) (offset: 0x1382): uint32_t
+    <2f9>   DW_AT_name        : (strp) (offset: 0x11be): uint32_t
     <2fd>   DW_AT_decl_file   : (data1) 8
     <2fe>   DW_AT_decl_line   : (data1) 51
     <2ff>   DW_AT_decl_column : (data1) 23
     <300>   DW_AT_type        : (ref4) <0x4a>, unsigned int
  <1><304>: Abbrev Number: 2 (DW_TAG_typedef)
-    <305>   DW_AT_name        : (strp) (offset: 0x907): uint64_t
+    <305>   DW_AT_name        : (strp) (offset: 0x810): uint64_t
     <309>   DW_AT_decl_file   : (data1) 8
     <30a>   DW_AT_decl_line   : (data1) 55
     <30b>   DW_AT_decl_column : (data1) 27
     <30c>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><310>: Abbrev Number: 2 (DW_TAG_typedef)
-    <311>   DW_AT_name        : (strp) (offset: 0x1ba8): Py_ssize_t
+    <311>   DW_AT_name        : (strp) (offset: 0x192b): Py_ssize_t
     <315>   DW_AT_decl_file   : (data1) 9
     <316>   DW_AT_decl_line   : (data1) 105
     <317>   DW_AT_decl_column : (data1) 25
     <318>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
  <1><31c>: Abbrev Number: 7 (DW_TAG_const_type)
     <31d>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><321>: Abbrev Number: 2 (DW_TAG_typedef)
-    <322>   DW_AT_name        : (strp) (offset: 0xd64): Py_hash_t
+    <322>   DW_AT_name        : (strp) (offset: 0xc2b): Py_hash_t
     <326>   DW_AT_decl_file   : (data1) 9
     <327>   DW_AT_decl_line   : (data1) 114
     <328>   DW_AT_decl_column : (data1) 20
     <329>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><32d>: Abbrev Number: 3 (DW_TAG_base_type)
     <32e>   DW_AT_byte_size   : (data1) 4
     <32f>   DW_AT_encoding    : (data1) 4	(float)
-    <330>   DW_AT_name        : (strp) (offset: 0x1319): float
+    <330>   DW_AT_name        : (strp) (offset: 0x1163): float
  <1><334>: Abbrev Number: 3 (DW_TAG_base_type)
     <335>   DW_AT_byte_size   : (data1) 8
     <336>   DW_AT_encoding    : (data1) 4	(float)
-    <337>   DW_AT_name        : (strp) (offset: 0x3a0): double
+    <337>   DW_AT_name        : (strp) (offset: 0x31a): double
  <1><33b>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <33c>   DW_AT_name        : (strp) (offset: 0x1b68): timezone
+    <33c>   DW_AT_name        : (strp) (offset: 0x18eb): timezone
     <340>   DW_AT_byte_size   : (data1) 8
     <341>   DW_AT_decl_file   : (data1) 10
     <342>   DW_AT_decl_line   : (data1) 56
     <343>   DW_AT_decl_column : (data1) 8
     <344>   DW_AT_sibling     : (ref4) <0x363>
  <2><348>: Abbrev Number: 9 (DW_TAG_member)
-    <349>   DW_AT_name        : (strp) (offset: 0x1e9f): tz_minuteswest
+    <349>   DW_AT_name        : (strp) (offset: 0x1bd6): tz_minuteswest
     <34d>   DW_AT_decl_file   : (data1) 10
     <34e>   DW_AT_decl_line   : (data1) 58
     <34f>   DW_AT_decl_column : (data1) 9
     <350>   DW_AT_type        : (ref4) <0x5f>, int
     <354>   DW_AT_data_member_location: (data1) 0
  <2><355>: Abbrev Number: 9 (DW_TAG_member)
-    <356>   DW_AT_name        : (strp) (offset: 0x1247): tz_dsttime
+    <356>   DW_AT_name        : (strp) (offset: 0x109e): tz_dsttime
     <35a>   DW_AT_decl_file   : (data1) 10
     <35b>   DW_AT_decl_line   : (data1) 59
     <35c>   DW_AT_decl_column : (data1) 9
     <35d>   DW_AT_type        : (ref4) <0x5f>, int
     <361>   DW_AT_data_member_location: (data1) 4
  <2><362>: Abbrev Number: 0
  <1><363>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <364>   DW_AT_byte_size   : (data1) 8
     <365>   DW_AT_type        : (ref4) <0x33b>, timezone
  <1><369>: Abbrev Number: 15 (DW_TAG_restrict_type)
     <36a>   DW_AT_type        : (ref4) <0x363>, timezone
  <1><36e>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <36f>   DW_AT_name        : (strp) (offset: 0x49f): _object
+    <36f>   DW_AT_name        : (strp) (offset: 0x419): _object
     <373>   DW_AT_byte_size   : (data1) 16
     <374>   DW_AT_decl_file   : (data1) 2
     <375>   DW_AT_decl_line   : (data1) 104
     <376>   DW_AT_decl_column : (data1) 16
     <377>   DW_AT_sibling     : (ref4) <0x396>
  <2><37b>: Abbrev Number: 9 (DW_TAG_member)
-    <37c>   DW_AT_name        : (strp) (offset: 0xf5): ob_refcnt
+    <37c>   DW_AT_name        : (strp) (offset: 0xcb): ob_refcnt
     <380>   DW_AT_decl_file   : (data1) 2
     <381>   DW_AT_decl_line   : (data1) 106
     <382>   DW_AT_decl_column : (data1) 16
     <383>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <387>   DW_AT_data_member_location: (data1) 0
  <2><388>: Abbrev Number: 9 (DW_TAG_member)
-    <389>   DW_AT_name        : (strp) (offset: 0x4dd): ob_type
+    <389>   DW_AT_name        : (strp) (offset: 0x457): ob_type
     <38d>   DW_AT_decl_file   : (data1) 2
     <38e>   DW_AT_decl_line   : (data1) 107
     <38f>   DW_AT_decl_column : (data1) 25
     <390>   DW_AT_type        : (ref4) <0x646>, _typeobject
     <394>   DW_AT_data_member_location: (data1) 8
  <2><395>: Abbrev Number: 0
  <1><396>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <397>   DW_AT_name        : (strp) (offset: 0x326): _typeobject
+    <397>   DW_AT_name        : (strp) (offset: 0x2c0): _typeobject
     <39b>   DW_AT_byte_size   : (data2) 416
     <39d>   DW_AT_decl_file   : (data1) 11
     <39e>   DW_AT_decl_line   : (data1) 177
     <39f>   DW_AT_decl_column : (data1) 16
     <3a0>   DW_AT_sibling     : (ref4) <0x646>
  <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
-    <3a5>   DW_AT_name        : (strp) (offset: 0x699): ob_base
+    <3a5>   DW_AT_name        : (strp) (offset: 0x5b9): ob_base
     <3a9>   DW_AT_decl_file   : (data1) 11
     <3aa>   DW_AT_decl_line   : (data1) 178
     <3ab>   DW_AT_decl_column : (data1) 5
     <3ac>   DW_AT_type        : (ref4) <0x67c>, PyVarObject
     <3b0>   DW_AT_data_member_location: (data1) 0
  <2><3b1>: Abbrev Number: 9 (DW_TAG_member)
-    <3b2>   DW_AT_name        : (strp) (offset: 0x103a): tp_name
+    <3b2>   DW_AT_name        : (strp) (offset: 0xec8): tp_name
     <3b6>   DW_AT_decl_file   : (data1) 11
     <3b7>   DW_AT_decl_line   : (data1) 179
     <3b8>   DW_AT_decl_column : (data1) 17
     <3b9>   DW_AT_type        : (ref4) <0x2bf>, char
     <3bd>   DW_AT_data_member_location: (data1) 24
  <2><3be>: Abbrev Number: 9 (DW_TAG_member)
-    <3bf>   DW_AT_name        : (strp) (offset: 0x1e47): tp_basicsize
+    <3bf>   DW_AT_name        : (strp) (offset: 0x1b7e): tp_basicsize
     <3c3>   DW_AT_decl_file   : (data1) 11
     <3c4>   DW_AT_decl_line   : (data1) 180
     <3c5>   DW_AT_decl_column : (data1) 16
     <3c6>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3ca>   DW_AT_data_member_location: (data1) 32
  <2><3cb>: Abbrev Number: 9 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0x249): tp_itemsize
+    <3cc>   DW_AT_name        : (strp) (offset: 0x1ef): tp_itemsize
     <3d0>   DW_AT_decl_file   : (data1) 11
     <3d1>   DW_AT_decl_line   : (data1) 180
     <3d2>   DW_AT_decl_column : (data1) 30
     <3d3>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3d7>   DW_AT_data_member_location: (data1) 40
  <2><3d8>: Abbrev Number: 9 (DW_TAG_member)
-    <3d9>   DW_AT_name        : (strp) (offset: 0x31b): tp_dealloc
+    <3d9>   DW_AT_name        : (strp) (offset: 0x2b5): tp_dealloc
     <3dd>   DW_AT_decl_file   : (data1) 11
     <3de>   DW_AT_decl_line   : (data1) 184
     <3df>   DW_AT_decl_column : (data1) 16
     <3e0>   DW_AT_type        : (ref4) <0x857>, destructor
     <3e4>   DW_AT_data_member_location: (data1) 48
  <2><3e5>: Abbrev Number: 9 (DW_TAG_member)
-    <3e6>   DW_AT_name        : (strp) (offset: 0x1357): tp_vectorcall_offset
+    <3e6>   DW_AT_name        : (strp) (offset: 0x11a1): tp_vectorcall_offset
     <3ea>   DW_AT_decl_file   : (data1) 11
     <3eb>   DW_AT_decl_line   : (data1) 185
     <3ec>   DW_AT_decl_column : (data1) 16
     <3ed>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3f1>   DW_AT_data_member_location: (data1) 56
  <2><3f2>: Abbrev Number: 9 (DW_TAG_member)
-    <3f3>   DW_AT_name        : (strp) (offset: 0xbe): tp_getattr
+    <3f3>   DW_AT_name        : (strp) (offset: 0x94): tp_getattr
     <3f7>   DW_AT_decl_file   : (data1) 11
     <3f8>   DW_AT_decl_line   : (data1) 186
     <3f9>   DW_AT_decl_column : (data1) 17
     <3fa>   DW_AT_type        : (ref4) <0x874>, getattrfunc, PyObject, _object
     <3fe>   DW_AT_data_member_location: (data1) 64
  <2><3ff>: Abbrev Number: 9 (DW_TAG_member)
-    <400>   DW_AT_name        : (strp) (offset: 0x799): tp_setattr
+    <400>   DW_AT_name        : (strp) (offset: 0x6a2): tp_setattr
     <404>   DW_AT_decl_file   : (data1) 11
     <405>   DW_AT_decl_line   : (data1) 187
     <406>   DW_AT_decl_column : (data1) 17
     <407>   DW_AT_type        : (ref4) <0x8a6>, setattrfunc, int
     <40b>   DW_AT_data_member_location: (data1) 72
  <2><40c>: Abbrev Number: 9 (DW_TAG_member)
-    <40d>   DW_AT_name        : (strp) (offset: 0x13b): tp_as_async
+    <40d>   DW_AT_name        : (strp) (offset: 0x111): tp_as_async
     <411>   DW_AT_decl_file   : (data1) 11
     <412>   DW_AT_decl_line   : (data1) 188
     <413>   DW_AT_decl_column : (data1) 21
     <414>   DW_AT_type        : (ref4) <0xe44>, PyAsyncMethods
     <418>   DW_AT_data_member_location: (data1) 80
  <2><419>: Abbrev Number: 9 (DW_TAG_member)
-    <41a>   DW_AT_name        : (strp) (offset: 0x1b71): tp_repr
+    <41a>   DW_AT_name        : (strp) (offset: 0x18f4): tp_repr
     <41e>   DW_AT_decl_file   : (data1) 11
     <41f>   DW_AT_decl_line   : (data1) 190
     <420>   DW_AT_decl_column : (data1) 14
     <421>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
     <425>   DW_AT_data_member_location: (data1) 88
  <2><426>: Abbrev Number: 9 (DW_TAG_member)
-    <427>   DW_AT_name        : (strp) (offset: 0x13e3): tp_as_number
+    <427>   DW_AT_name        : (strp) (offset: 0x1210): tp_as_number
     <42b>   DW_AT_decl_file   : (data1) 11
     <42c>   DW_AT_decl_line   : (data1) 194
     <42d>   DW_AT_decl_column : (data1) 22
     <42e>   DW_AT_type        : (ref4) <0xe4a>, PyNumberMethods
     <432>   DW_AT_data_member_location: (data1) 96
  <2><433>: Abbrev Number: 9 (DW_TAG_member)
-    <434>   DW_AT_name        : (strp) (offset: 0x1094): tp_as_sequence
+    <434>   DW_AT_name        : (strp) (offset: 0xf09): tp_as_sequence
     <438>   DW_AT_decl_file   : (data1) 11
     <439>   DW_AT_decl_line   : (data1) 195
     <43a>   DW_AT_decl_column : (data1) 24
     <43b>   DW_AT_type        : (ref4) <0xe50>, PySequenceMethods
     <43f>   DW_AT_data_member_location: (data1) 104
  <2><440>: Abbrev Number: 9 (DW_TAG_member)
-    <441>   DW_AT_name        : (strp) (offset: 0xa3e): tp_as_mapping
+    <441>   DW_AT_name        : (strp) (offset: 0x933): tp_as_mapping
     <445>   DW_AT_decl_file   : (data1) 11
     <446>   DW_AT_decl_line   : (data1) 196
     <447>   DW_AT_decl_column : (data1) 23
     <448>   DW_AT_type        : (ref4) <0xe56>, PyMappingMethods
     <44c>   DW_AT_data_member_location: (data1) 112
  <2><44d>: Abbrev Number: 9 (DW_TAG_member)
-    <44e>   DW_AT_name        : (strp) (offset: 0x165a): tp_hash
+    <44e>   DW_AT_name        : (strp) (offset: 0x13fa): tp_hash
     <452>   DW_AT_decl_file   : (data1) 11
     <453>   DW_AT_decl_line   : (data1) 200
     <454>   DW_AT_decl_column : (data1) 14
     <455>   DW_AT_type        : (ref4) <0x8e9>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <459>   DW_AT_data_member_location: (data1) 120
  <2><45a>: Abbrev Number: 9 (DW_TAG_member)
-    <45b>   DW_AT_name        : (strp) (offset: 0x5e0): tp_call
+    <45b>   DW_AT_name        : (strp) (offset: 0x52d): tp_call
     <45f>   DW_AT_decl_file   : (data1) 11
     <460>   DW_AT_decl_line   : (data1) 201
     <461>   DW_AT_decl_column : (data1) 17
     <462>   DW_AT_type        : (ref4) <0x6da>, ternaryfunc, PyObject, _object
     <466>   DW_AT_data_member_location: (data1) 128
  <2><467>: Abbrev Number: 9 (DW_TAG_member)
-    <468>   DW_AT_name        : (strp) (offset: 0x625): tp_str
+    <468>   DW_AT_name        : (strp) (offset: 0x565): tp_str
     <46c>   DW_AT_decl_file   : (data1) 11
     <46d>   DW_AT_decl_line   : (data1) 202
     <46e>   DW_AT_decl_column : (data1) 14
     <46f>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
     <473>   DW_AT_data_member_location: (data1) 136
  <2><474>: Abbrev Number: 9 (DW_TAG_member)
-    <475>   DW_AT_name        : (strp) (offset: 0x11ee): tp_getattro
+    <475>   DW_AT_name        : (strp) (offset: 0x1045): tp_getattro
     <479>   DW_AT_decl_file   : (data1) 11
     <47a>   DW_AT_decl_line   : (data1) 203
     <47b>   DW_AT_decl_column : (data1) 18
     <47c>   DW_AT_type        : (ref4) <0x89a>, getattrofunc, PyObject, _object
     <480>   DW_AT_data_member_location: (data1) 144
  <2><481>: Abbrev Number: 9 (DW_TAG_member)
-    <482>   DW_AT_name        : (strp) (offset: 0x1843): tp_setattro
+    <482>   DW_AT_name        : (strp) (offset: 0x15d1): tp_setattro
     <486>   DW_AT_decl_file   : (data1) 11
     <487>   DW_AT_decl_line   : (data1) 204
     <488>   DW_AT_decl_column : (data1) 18
     <489>   DW_AT_type        : (ref4) <0x8d1>, setattrofunc, int
     <48d>   DW_AT_data_member_location: (data1) 152
  <2><48e>: Abbrev Number: 9 (DW_TAG_member)
-    <48f>   DW_AT_name        : (strp) (offset: 0x10bb): tp_as_buffer
+    <48f>   DW_AT_name        : (strp) (offset: 0xf30): tp_as_buffer
     <493>   DW_AT_decl_file   : (data1) 11
     <494>   DW_AT_decl_line   : (data1) 207
     <495>   DW_AT_decl_column : (data1) 20
     <496>   DW_AT_type        : (ref4) <0xe5c>, PyBufferProcs
     <49a>   DW_AT_data_member_location: (data1) 160
  <2><49b>: Abbrev Number: 9 (DW_TAG_member)
-    <49c>   DW_AT_name        : (strp) (offset: 0x1cb0): tp_flags
+    <49c>   DW_AT_name        : (strp) (offset: 0x1a33): tp_flags
     <4a0>   DW_AT_decl_file   : (data1) 11
     <4a1>   DW_AT_decl_line   : (data1) 210
     <4a2>   DW_AT_decl_column : (data1) 19
     <4a3>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <4a7>   DW_AT_data_member_location: (data1) 168
  <2><4a8>: Abbrev Number: 9 (DW_TAG_member)
-    <4a9>   DW_AT_name        : (strp) (offset: 0x149d): tp_doc
+    <4a9>   DW_AT_name        : (strp) (offset: 0x12bb): tp_doc
     <4ad>   DW_AT_decl_file   : (data1) 11
     <4ae>   DW_AT_decl_line   : (data1) 212
     <4af>   DW_AT_decl_column : (data1) 17
     <4b0>   DW_AT_type        : (ref4) <0x2bf>, char
     <4b4>   DW_AT_data_member_location: (data1) 176
  <2><4b5>: Abbrev Number: 9 (DW_TAG_member)
-    <4b6>   DW_AT_name        : (strp) (offset: 0x17a5): tp_traverse
+    <4b6>   DW_AT_name        : (strp) (offset: 0x1533): tp_traverse
     <4ba>   DW_AT_decl_file   : (data1) 11
     <4bb>   DW_AT_decl_line   : (data1) 216
     <4bc>   DW_AT_decl_column : (data1) 18
     <4bd>   DW_AT_type        : (ref4) <0x80f>, traverseproc, int
     <4c1>   DW_AT_data_member_location: (data1) 184
  <2><4c2>: Abbrev Number: 9 (DW_TAG_member)
-    <4c3>   DW_AT_name        : (strp) (offset: 0x8f2): tp_clear
+    <4c3>   DW_AT_name        : (strp) (offset: 0x7fb): tp_clear
     <4c7>   DW_AT_decl_file   : (data1) 11
     <4c8>   DW_AT_decl_line   : (data1) 219
     <4c9>   DW_AT_decl_column : (data1) 13
     <4ca>   DW_AT_type        : (ref4) <0x705>, inquiry, int
     <4ce>   DW_AT_data_member_location: (data1) 192
  <2><4cf>: Abbrev Number: 9 (DW_TAG_member)
-    <4d0>   DW_AT_name        : (strp) (offset: 0x3fd): tp_richcompare
+    <4d0>   DW_AT_name        : (strp) (offset: 0x377): tp_richcompare
     <4d4>   DW_AT_decl_file   : (data1) 11
     <4d5>   DW_AT_decl_line   : (data1) 223
     <4d6>   DW_AT_decl_column : (data1) 17
     <4d7>   DW_AT_type        : (ref4) <0x90a>, richcmpfunc, PyObject, _object
     <4db>   DW_AT_data_member_location: (data1) 200
  <2><4dc>: Abbrev Number: 9 (DW_TAG_member)
-    <4dd>   DW_AT_name        : (strp) (offset: 0x141b): tp_weaklistoffset
+    <4dd>   DW_AT_name        : (strp) (offset: 0x1248): tp_weaklistoffset
     <4e1>   DW_AT_decl_file   : (data1) 11
     <4e2>   DW_AT_decl_line   : (data1) 226
     <4e3>   DW_AT_decl_column : (data1) 16
     <4e4>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <4e8>   DW_AT_data_member_location: (data1) 208
  <2><4e9>: Abbrev Number: 9 (DW_TAG_member)
-    <4ea>   DW_AT_name        : (strp) (offset: 0x18d0): tp_iter
+    <4ea>   DW_AT_name        : (strp) (offset: 0x165e): tp_iter
     <4ee>   DW_AT_decl_file   : (data1) 11
     <4ef>   DW_AT_decl_line   : (data1) 229
     <4f0>   DW_AT_decl_column : (data1) 17
     <4f1>   DW_AT_type        : (ref4) <0x935>, getiterfunc, PyObject, _object
     <4f5>   DW_AT_data_member_location: (data1) 216
  <2><4f6>: Abbrev Number: 9 (DW_TAG_member)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x189d): tp_iternext
+    <4f7>   DW_AT_name        : (strp) (offset: 0x162b): tp_iternext
     <4fb>   DW_AT_decl_file   : (data1) 11
     <4fc>   DW_AT_decl_line   : (data1) 230
     <4fd>   DW_AT_decl_column : (data1) 18
     <4fe>   DW_AT_type        : (ref4) <0x941>, iternextfunc, PyObject, _object
     <502>   DW_AT_data_member_location: (data1) 224
  <2><503>: Abbrev Number: 9 (DW_TAG_member)
-    <504>   DW_AT_name        : (strp) (offset: 0x1226): tp_methods
+    <504>   DW_AT_name        : (strp) (offset: 0x107d): tp_methods
     <508>   DW_AT_decl_file   : (data1) 11
     <509>   DW_AT_decl_line   : (data1) 233
     <50a>   DW_AT_decl_column : (data1) 25
     <50b>   DW_AT_type        : (ref4) <0xea4>, PyMethodDef
     <50f>   DW_AT_data_member_location: (data1) 232
  <2><510>: Abbrev Number: 9 (DW_TAG_member)
-    <511>   DW_AT_name        : (strp) (offset: 0x1784): tp_members
+    <511>   DW_AT_name        : (strp) (offset: 0x1512): tp_members
     <515>   DW_AT_decl_file   : (data1) 11
     <516>   DW_AT_decl_line   : (data1) 234
     <517>   DW_AT_decl_column : (data1) 25
     <518>   DW_AT_type        : (ref4) <0xeaf>, PyMemberDef
     <51c>   DW_AT_data_member_location: (data1) 240
  <2><51d>: Abbrev Number: 9 (DW_TAG_member)
-    <51e>   DW_AT_name        : (strp) (offset: 0x188a): tp_getset
+    <51e>   DW_AT_name        : (strp) (offset: 0x1618): tp_getset
     <522>   DW_AT_decl_file   : (data1) 11
     <523>   DW_AT_decl_line   : (data1) 235
     <524>   DW_AT_decl_column : (data1) 25
     <525>   DW_AT_type        : (ref4) <0xf04>, PyGetSetDef
     <529>   DW_AT_data_member_location: (data1) 248
  <2><52a>: Abbrev Number: 17 (DW_TAG_member)
-    <52b>   DW_AT_name        : (strp) (offset: 0x193c): tp_base
+    <52b>   DW_AT_name        : (strp) (offset: 0x16ca): tp_base
     <52f>   DW_AT_decl_file   : (data1) 11
     <530>   DW_AT_decl_line   : (data1) 236
     <531>   DW_AT_decl_column : (data1) 25
     <532>   DW_AT_type        : (ref4) <0x646>, _typeobject
     <536>   DW_AT_data_member_location: (data2) 256
  <2><538>: Abbrev Number: 17 (DW_TAG_member)
-    <539>   DW_AT_name        : (strp) (offset: 0xa0c): tp_dict
+    <539>   DW_AT_name        : (strp) (offset: 0x901): tp_dict
     <53d>   DW_AT_decl_file   : (data1) 11
     <53e>   DW_AT_decl_line   : (data1) 237
     <53f>   DW_AT_decl_column : (data1) 15
     <540>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <544>   DW_AT_data_member_location: (data2) 264
  <2><546>: Abbrev Number: 17 (DW_TAG_member)
-    <547>   DW_AT_name        : (strp) (offset: 0x18c3): tp_descr_get
+    <547>   DW_AT_name        : (strp) (offset: 0x1651): tp_descr_get
     <54b>   DW_AT_decl_file   : (data1) 11
     <54c>   DW_AT_decl_line   : (data1) 238
     <54d>   DW_AT_decl_column : (data1) 18
     <54e>   DW_AT_type        : (ref4) <0x94d>, descrgetfunc, PyObject, _object
     <552>   DW_AT_data_member_location: (data2) 272
  <2><554>: Abbrev Number: 17 (DW_TAG_member)
-    <555>   DW_AT_name        : (strp) (offset: 0x1dc5): tp_descr_set
+    <555>   DW_AT_name        : (strp) (offset: 0x1afc): tp_descr_set
     <559>   DW_AT_decl_file   : (data1) 11
     <55a>   DW_AT_decl_line   : (data1) 239
     <55b>   DW_AT_decl_column : (data1) 18
     <55c>   DW_AT_type        : (ref4) <0x959>, descrsetfunc, int
     <560>   DW_AT_data_member_location: (data2) 280
  <2><562>: Abbrev Number: 17 (DW_TAG_member)
-    <563>   DW_AT_name        : (strp) (offset: 0x843): tp_dictoffset
+    <563>   DW_AT_name        : (strp) (offset: 0x74c): tp_dictoffset
     <567>   DW_AT_decl_file   : (data1) 11
     <568>   DW_AT_decl_line   : (data1) 240
     <569>   DW_AT_decl_column : (data1) 16
     <56a>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <56e>   DW_AT_data_member_location: (data2) 288
  <2><570>: Abbrev Number: 17 (DW_TAG_member)
-    <571>   DW_AT_name        : (strp) (offset: 0x9c5): tp_init
+    <571>   DW_AT_name        : (strp) (offset: 0x8ba): tp_init
     <575>   DW_AT_decl_file   : (data1) 11
     <576>   DW_AT_decl_line   : (data1) 241
     <577>   DW_AT_decl_column : (data1) 14
     <578>   DW_AT_type        : (ref4) <0x965>, initproc, int
     <57c>   DW_AT_data_member_location: (data2) 296
  <2><57e>: Abbrev Number: 17 (DW_TAG_member)
-    <57f>   DW_AT_name        : (strp) (offset: 0x114a): tp_alloc
+    <57f>   DW_AT_name        : (strp) (offset: 0xfa6): tp_alloc
     <583>   DW_AT_decl_file   : (data1) 11
     <584>   DW_AT_decl_line   : (data1) 242
     <585>   DW_AT_decl_column : (data1) 15
     <586>   DW_AT_type        : (ref4) <0x99c>, allocfunc, PyObject, _object
     <58a>   DW_AT_data_member_location: (data2) 304
  <2><58c>: Abbrev Number: 17 (DW_TAG_member)
-    <58d>   DW_AT_name        : (strp) (offset: 0xf3d): tp_new
+    <58d>   DW_AT_name        : (strp) (offset: 0xde2): tp_new
     <591>   DW_AT_decl_file   : (data1) 11
     <592>   DW_AT_decl_line   : (data1) 243
     <593>   DW_AT_decl_column : (data1) 13
     <594>   DW_AT_type        : (ref4) <0x971>, newfunc, PyObject, _object
     <598>   DW_AT_data_member_location: (data2) 312
  <2><59a>: Abbrev Number: 17 (DW_TAG_member)
-    <59b>   DW_AT_name        : (strp) (offset: 0x504): tp_free
+    <59b>   DW_AT_name        : (strp) (offset: 0x47e): tp_free
     <59f>   DW_AT_decl_file   : (data1) 11
     <5a0>   DW_AT_decl_line   : (data1) 244
     <5a1>   DW_AT_decl_column : (data1) 14
     <5a2>   DW_AT_type        : (ref4) <0x83a>, freefunc
     <5a6>   DW_AT_data_member_location: (data2) 320
  <2><5a8>: Abbrev Number: 17 (DW_TAG_member)
-    <5a9>   DW_AT_name        : (strp) (offset: 0x19f): tp_is_gc
+    <5a9>   DW_AT_name        : (strp) (offset: 0x154): tp_is_gc
     <5ad>   DW_AT_decl_file   : (data1) 11
     <5ae>   DW_AT_decl_line   : (data1) 245
     <5af>   DW_AT_decl_column : (data1) 13
     <5b0>   DW_AT_type        : (ref4) <0x705>, inquiry, int
     <5b4>   DW_AT_data_member_location: (data2) 328
  <2><5b6>: Abbrev Number: 17 (DW_TAG_member)
-    <5b7>   DW_AT_name        : (strp) (offset: 0x28f): tp_bases
+    <5b7>   DW_AT_name        : (strp) (offset: 0x235): tp_bases
     <5bb>   DW_AT_decl_file   : (data1) 11
     <5bc>   DW_AT_decl_line   : (data1) 246
     <5bd>   DW_AT_decl_column : (data1) 15
     <5be>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <5c2>   DW_AT_data_member_location: (data2) 336
  <2><5c4>: Abbrev Number: 17 (DW_TAG_member)
-    <5c5>   DW_AT_name        : (strp) (offset: 0x1240): tp_mro
+    <5c5>   DW_AT_name        : (strp) (offset: 0x1097): tp_mro
     <5c9>   DW_AT_decl_file   : (data1) 11
     <5ca>   DW_AT_decl_line   : (data1) 247
     <5cb>   DW_AT_decl_column : (data1) 15
     <5cc>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <5d0>   DW_AT_data_member_location: (data2) 344
  <2><5d2>: Abbrev Number: 17 (DW_TAG_member)
-    <5d3>   DW_AT_name        : (strp) (offset: 0x1b8e): tp_cache
+    <5d3>   DW_AT_name        : (strp) (offset: 0x1911): tp_cache
     <5d7>   DW_AT_decl_file   : (data1) 11
     <5d8>   DW_AT_decl_line   : (data1) 248
     <5d9>   DW_AT_decl_column : (data1) 15
     <5da>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <5de>   DW_AT_data_member_location: (data2) 352
  <2><5e0>: Abbrev Number: 17 (DW_TAG_member)
-    <5e1>   DW_AT_name        : (strp) (offset: 0x1801): tp_subclasses
+    <5e1>   DW_AT_name        : (strp) (offset: 0x158f): tp_subclasses
     <5e5>   DW_AT_decl_file   : (data1) 11
     <5e6>   DW_AT_decl_line   : (data1) 249
     <5e7>   DW_AT_decl_column : (data1) 15
     <5e8>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <5ec>   DW_AT_data_member_location: (data2) 360
  <2><5ee>: Abbrev Number: 17 (DW_TAG_member)
-    <5ef>   DW_AT_name        : (strp) (offset: 0x1550): tp_weaklist
+    <5ef>   DW_AT_name        : (strp) (offset: 0x133e): tp_weaklist
     <5f3>   DW_AT_decl_file   : (data1) 11
     <5f4>   DW_AT_decl_line   : (data1) 250
     <5f5>   DW_AT_decl_column : (data1) 15
     <5f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
     <5fa>   DW_AT_data_member_location: (data2) 368
  <2><5fc>: Abbrev Number: 17 (DW_TAG_member)
-    <5fd>   DW_AT_name        : (strp) (offset: 0x1010): tp_del
+    <5fd>   DW_AT_name        : (strp) (offset: 0xe9e): tp_del
     <601>   DW_AT_decl_file   : (data1) 11
     <602>   DW_AT_decl_line   : (data1) 251
     <603>   DW_AT_decl_column : (data1) 16
     <604>   DW_AT_type        : (ref4) <0x857>, destructor
     <608>   DW_AT_data_member_location: (data2) 376
  <2><60a>: Abbrev Number: 17 (DW_TAG_member)
-    <60b>   DW_AT_name        : (strp) (offset: 0x16a4): tp_version_tag
+    <60b>   DW_AT_name        : (strp) (offset: 0x1432): tp_version_tag
     <60f>   DW_AT_decl_file   : (data1) 11
     <610>   DW_AT_decl_line   : (data1) 254
     <611>   DW_AT_decl_column : (data1) 18
     <612>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <616>   DW_AT_data_member_location: (data2) 384
  <2><618>: Abbrev Number: 18 (DW_TAG_member)
-    <619>   DW_AT_name        : (strp) (offset: 0x877): tp_finalize
+    <619>   DW_AT_name        : (strp) (offset: 0x780): tp_finalize
     <61d>   DW_AT_decl_file   : (data1) 11
     <61e>   DW_AT_decl_line   : (data2) 256
     <620>   DW_AT_decl_column : (data1) 16
     <621>   DW_AT_type        : (ref4) <0x857>, destructor
     <625>   DW_AT_data_member_location: (data2) 392
  <2><627>: Abbrev Number: 18 (DW_TAG_member)
-    <628>   DW_AT_name        : (strp) (offset: 0x168b): tp_vectorcall
+    <628>   DW_AT_name        : (strp) (offset: 0x1424): tp_vectorcall
     <62c>   DW_AT_decl_file   : (data1) 11
     <62d>   DW_AT_decl_line   : (data2) 257
     <62f>   DW_AT_decl_column : (data1) 20
     <630>   DW_AT_type        : (ref4) <0xadd>, vectorcallfunc, PyObject, _object
     <634>   DW_AT_data_member_location: (data2) 400
  <2><636>: Abbrev Number: 18 (DW_TAG_member)
-    <637>   DW_AT_name        : (strp) (offset: 0x19be): tp_print
+    <637>   DW_AT_name        : (strp) (offset: 0x174c): tp_print
     <63b>   DW_AT_decl_file   : (data1) 11
     <63c>   DW_AT_decl_line   : (data2) 260
     <63e>   DW_AT_decl_column : (data1) 30
     <63f>   DW_AT_type        : (ref4) <0xf29>, int
     <643>   DW_AT_data_member_location: (data2) 408
  <2><645>: Abbrev Number: 0
  <1><646>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <647>   DW_AT_byte_size   : (data1) 8
     <648>   DW_AT_type        : (ref4) <0x396>, _typeobject
  <1><64c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <64d>   DW_AT_name        : (strp) (offset: 0xd81): PyObject
+    <64d>   DW_AT_name        : (strp) (offset: 0xc48): PyObject
     <651>   DW_AT_decl_file   : (data1) 2
     <652>   DW_AT_decl_line   : (data1) 108
     <653>   DW_AT_decl_column : (data1) 3
     <654>   DW_AT_type        : (ref4) <0x36e>, _object
  <1><658>: Abbrev Number: 19 (DW_TAG_structure_type)
     <659>   DW_AT_byte_size   : (data1) 24
     <65a>   DW_AT_decl_file   : (data1) 2
     <65b>   DW_AT_decl_line   : (data1) 113
     <65c>   DW_AT_decl_column : (data1) 9
     <65d>   DW_AT_sibling     : (ref4) <0x67c>
  <2><661>: Abbrev Number: 9 (DW_TAG_member)
-    <662>   DW_AT_name        : (strp) (offset: 0x699): ob_base
+    <662>   DW_AT_name        : (strp) (offset: 0x5b9): ob_base
     <666>   DW_AT_decl_file   : (data1) 2
     <667>   DW_AT_decl_line   : (data1) 114
     <668>   DW_AT_decl_column : (data1) 14
     <669>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
     <66d>   DW_AT_data_member_location: (data1) 0
  <2><66e>: Abbrev Number: 9 (DW_TAG_member)
-    <66f>   DW_AT_name        : (strp) (offset: 0x9eb): ob_size
+    <66f>   DW_AT_name        : (strp) (offset: 0x8e0): ob_size
     <673>   DW_AT_decl_file   : (data1) 2
     <674>   DW_AT_decl_line   : (data1) 115
     <675>   DW_AT_decl_column : (data1) 16
     <676>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <67a>   DW_AT_data_member_location: (data1) 16
  <2><67b>: Abbrev Number: 0
  <1><67c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <67d>   DW_AT_name        : (strp) (offset: 0x55b): PyVarObject
+    <67d>   DW_AT_name        : (strp) (offset: 0x4d5): PyVarObject
     <681>   DW_AT_decl_file   : (data1) 2
     <682>   DW_AT_decl_line   : (data1) 116
     <683>   DW_AT_decl_column : (data1) 3
     <684>   DW_AT_type        : (ref4) <0x658>
  <1><688>: Abbrev Number: 2 (DW_TAG_typedef)
-    <689>   DW_AT_name        : (strp) (offset: 0x12ab): unaryfunc
+    <689>   DW_AT_name        : (strp) (offset: 0x10f5): unaryfunc
     <68d>   DW_AT_decl_file   : (data1) 2
     <68e>   DW_AT_decl_line   : (data1) 140
     <68f>   DW_AT_decl_column : (data1) 22
     <690>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
  <1><694>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <695>   DW_AT_byte_size   : (data1) 8
     <696>   DW_AT_type        : (ref4) <0x69a>, PyObject, _object
@@ -878,15 +878,15 @@
  <2><6a8>: Abbrev Number: 0
  <1><6a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6aa>   DW_AT_byte_size   : (data1) 8
     <6ab>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
  <1><6af>: Abbrev Number: 7 (DW_TAG_const_type)
     <6b0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <1><6b4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6b5>   DW_AT_name        : (strp) (offset: 0xab6): binaryfunc
+    <6b5>   DW_AT_name        : (strp) (offset: 0x9ab): binaryfunc
     <6b9>   DW_AT_decl_file   : (data1) 2
     <6ba>   DW_AT_decl_line   : (data1) 141
     <6bb>   DW_AT_decl_column : (data1) 22
     <6bc>   DW_AT_type        : (ref4) <0x6c0>, PyObject, _object
  <1><6c0>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6c1>   DW_AT_byte_size   : (data1) 8
     <6c2>   DW_AT_type        : (ref4) <0x6c6>, PyObject, _object
@@ -896,15 +896,15 @@
     <6cb>   DW_AT_sibling     : (ref4) <0x6da>
  <2><6cf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <6d0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><6d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <6d5>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><6d9>: Abbrev Number: 0
  <1><6da>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6db>   DW_AT_name        : (strp) (offset: 0x683): ternaryfunc
+    <6db>   DW_AT_name        : (strp) (offset: 0x5ad): ternaryfunc
     <6df>   DW_AT_decl_file   : (data1) 2
     <6e0>   DW_AT_decl_line   : (data1) 142
     <6e1>   DW_AT_decl_column : (data1) 22
     <6e2>   DW_AT_type        : (ref4) <0x6e6>, PyObject, _object
  <1><6e6>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6e7>   DW_AT_byte_size   : (data1) 8
     <6e8>   DW_AT_type        : (ref4) <0x6ec>, PyObject, _object
@@ -916,15 +916,15 @@
     <6f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><6fa>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <6fb>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><6ff>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <700>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><704>: Abbrev Number: 0
  <1><705>: Abbrev Number: 2 (DW_TAG_typedef)
-    <706>   DW_AT_name        : (strp) (offset: 0x137a): inquiry
+    <706>   DW_AT_name        : (strp) (offset: 0x11b6): inquiry
     <70a>   DW_AT_decl_file   : (data1) 2
     <70b>   DW_AT_decl_line   : (data1) 143
     <70c>   DW_AT_decl_column : (data1) 15
     <70d>   DW_AT_type        : (ref4) <0x711>, int
  <1><711>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <712>   DW_AT_byte_size   : (data1) 8
     <713>   DW_AT_type        : (ref4) <0x717>, int
@@ -948,15 +948,15 @@
     <739>   DW_AT_prototyped  : (flag_present) 1
     <739>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <73d>   DW_AT_sibling     : (ref4) <0x747>
  <2><741>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <742>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><746>: Abbrev Number: 0
  <1><747>: Abbrev Number: 2 (DW_TAG_typedef)
-    <748>   DW_AT_name        : (strp) (offset: 0xb7d): ssizeargfunc
+    <748>   DW_AT_name        : (strp) (offset: 0xa65): ssizeargfunc
     <74c>   DW_AT_decl_file   : (data1) 2
     <74d>   DW_AT_decl_line   : (data1) 145
     <74e>   DW_AT_decl_column : (data1) 21
     <74f>   DW_AT_type        : (ref4) <0x753>, PyObject, _object
  <1><753>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <754>   DW_AT_byte_size   : (data1) 8
     <755>   DW_AT_type        : (ref4) <0x759>, PyObject, _object
@@ -966,15 +966,15 @@
     <75e>   DW_AT_sibling     : (ref4) <0x76d>
  <2><762>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <763>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><767>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <768>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><76c>: Abbrev Number: 0
  <1><76d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <76e>   DW_AT_name        : (strp) (offset: 0x167b): ssizeobjargproc
+    <76e>   DW_AT_name        : (strp) (offset: 0x1414): ssizeobjargproc
     <772>   DW_AT_decl_file   : (data1) 2
     <773>   DW_AT_decl_line   : (data1) 147
     <774>   DW_AT_decl_column : (data1) 14
     <775>   DW_AT_type        : (ref4) <0x779>, int
  <1><779>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <77a>   DW_AT_byte_size   : (data1) 8
     <77b>   DW_AT_type        : (ref4) <0x77f>, int
@@ -986,15 +986,15 @@
     <789>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><78d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <78e>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><792>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <793>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><797>: Abbrev Number: 0
  <1><798>: Abbrev Number: 2 (DW_TAG_typedef)
-    <799>   DW_AT_name        : (strp) (offset: 0x9dd): objobjargproc
+    <799>   DW_AT_name        : (strp) (offset: 0x8d2): objobjargproc
     <79d>   DW_AT_decl_file   : (data1) 2
     <79e>   DW_AT_decl_line   : (data1) 149
     <79f>   DW_AT_decl_column : (data1) 14
     <7a0>   DW_AT_type        : (ref4) <0x7a4>, int
  <1><7a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7a5>   DW_AT_byte_size   : (data1) 8
     <7a6>   DW_AT_type        : (ref4) <0x7aa>, int
@@ -1006,15 +1006,15 @@
     <7b4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><7b8>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <7b9>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><7bd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <7be>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><7c2>: Abbrev Number: 0
  <1><7c3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7c4>   DW_AT_name        : (strp) (offset: 0x1eae): objobjproc
+    <7c4>   DW_AT_name        : (strp) (offset: 0x1be5): objobjproc
     <7c8>   DW_AT_decl_file   : (data1) 2
     <7c9>   DW_AT_decl_line   : (data1) 151
     <7ca>   DW_AT_decl_column : (data1) 15
     <7cb>   DW_AT_type        : (ref4) <0x7cf>, int
  <1><7cf>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7d0>   DW_AT_byte_size   : (data1) 8
     <7d1>   DW_AT_type        : (ref4) <0x7d5>, int
@@ -1024,15 +1024,15 @@
     <7da>   DW_AT_sibling     : (ref4) <0x7e9>
  <2><7de>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <7df>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><7e3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <7e4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><7e8>: Abbrev Number: 0
  <1><7e9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7ea>   DW_AT_name        : (strp) (offset: 0x448): visitproc
+    <7ea>   DW_AT_name        : (strp) (offset: 0x3c2): visitproc
     <7ee>   DW_AT_decl_file   : (data1) 2
     <7ef>   DW_AT_decl_line   : (data1) 152
     <7f0>   DW_AT_decl_column : (data1) 15
     <7f1>   DW_AT_type        : (ref4) <0x7f5>, int
  <1><7f5>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7f6>   DW_AT_byte_size   : (data1) 8
     <7f7>   DW_AT_type        : (ref4) <0x7fb>, int
@@ -1042,15 +1042,15 @@
     <800>   DW_AT_sibling     : (ref4) <0x80f>
  <2><804>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <805>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><809>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <80a>   DW_AT_type        : (ref4) <0x85>
  <2><80e>: Abbrev Number: 0
  <1><80f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <810>   DW_AT_name        : (strp) (offset: 0x131f): traverseproc
+    <810>   DW_AT_name        : (strp) (offset: 0x1169): traverseproc
     <814>   DW_AT_decl_file   : (data1) 2
     <815>   DW_AT_decl_line   : (data1) 153
     <816>   DW_AT_decl_column : (data1) 15
     <817>   DW_AT_type        : (ref4) <0x81b>, int
  <1><81b>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <81c>   DW_AT_byte_size   : (data1) 8
     <81d>   DW_AT_type        : (ref4) <0x821>, int
@@ -1062,45 +1062,45 @@
     <82b>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><82f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <830>   DW_AT_type        : (ref4) <0x7e9>, visitproc, int
  <2><834>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <835>   DW_AT_type        : (ref4) <0x85>
  <2><839>: Abbrev Number: 0
  <1><83a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <83b>   DW_AT_name        : (strp) (offset: 0x184f): freefunc
+    <83b>   DW_AT_name        : (strp) (offset: 0x15dd): freefunc
     <83f>   DW_AT_decl_file   : (data1) 2
     <840>   DW_AT_decl_line   : (data1) 156
     <841>   DW_AT_decl_column : (data1) 16
     <842>   DW_AT_type        : (ref4) <0x846>
  <1><846>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <847>   DW_AT_byte_size   : (data1) 8
     <848>   DW_AT_type        : (ref4) <0x84c>
  <1><84c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
     <84d>   DW_AT_prototyped  : (flag_present) 1
     <84d>   DW_AT_sibling     : (ref4) <0x857>
  <2><851>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <852>   DW_AT_type        : (ref4) <0x85>
  <2><856>: Abbrev Number: 0
  <1><857>: Abbrev Number: 2 (DW_TAG_typedef)
-    <858>   DW_AT_name        : (strp) (offset: 0xfbc): destructor
+    <858>   DW_AT_name        : (strp) (offset: 0xe4a): destructor
     <85c>   DW_AT_decl_file   : (data1) 2
     <85d>   DW_AT_decl_line   : (data1) 157
     <85e>   DW_AT_decl_column : (data1) 16
     <85f>   DW_AT_type        : (ref4) <0x863>
  <1><863>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <864>   DW_AT_byte_size   : (data1) 8
     <865>   DW_AT_type        : (ref4) <0x869>
  <1><869>: Abbrev Number: 22 (DW_TAG_subroutine_type)
     <86a>   DW_AT_prototyped  : (flag_present) 1
     <86a>   DW_AT_sibling     : (ref4) <0x874>
  <2><86e>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <86f>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><873>: Abbrev Number: 0
  <1><874>: Abbrev Number: 2 (DW_TAG_typedef)
-    <875>   DW_AT_name        : (strp) (offset: 0x15c7): getattrfunc
+    <875>   DW_AT_name        : (strp) (offset: 0x1392): getattrfunc
     <879>   DW_AT_decl_file   : (data1) 2
     <87a>   DW_AT_decl_line   : (data1) 158
     <87b>   DW_AT_decl_column : (data1) 21
     <87c>   DW_AT_type        : (ref4) <0x880>, PyObject, _object
  <1><880>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <881>   DW_AT_byte_size   : (data1) 8
     <882>   DW_AT_type        : (ref4) <0x886>, PyObject, _object
@@ -1110,21 +1110,21 @@
     <88b>   DW_AT_sibling     : (ref4) <0x89a>
  <2><88f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <890>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><894>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <895>   DW_AT_type        : (ref4) <0x93>, char
  <2><899>: Abbrev Number: 0
  <1><89a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <89b>   DW_AT_name        : (strp) (offset: 0x14a4): getattrofunc
+    <89b>   DW_AT_name        : (strp) (offset: 0x12c2): getattrofunc
     <89f>   DW_AT_decl_file   : (data1) 2
     <8a0>   DW_AT_decl_line   : (data1) 159
     <8a1>   DW_AT_decl_column : (data1) 21
     <8a2>   DW_AT_type        : (ref4) <0x6c0>, PyObject, _object
  <1><8a6>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8a7>   DW_AT_name        : (strp) (offset: 0xa4c): setattrfunc
+    <8a7>   DW_AT_name        : (strp) (offset: 0x941): setattrfunc
     <8ab>   DW_AT_decl_file   : (data1) 2
     <8ac>   DW_AT_decl_line   : (data1) 160
     <8ad>   DW_AT_decl_column : (data1) 15
     <8ae>   DW_AT_type        : (ref4) <0x8b2>, int
  <1><8b2>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <8b3>   DW_AT_byte_size   : (data1) 8
     <8b4>   DW_AT_type        : (ref4) <0x8b8>, int
@@ -1136,27 +1136,27 @@
     <8c2>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><8c6>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <8c7>   DW_AT_type        : (ref4) <0x93>, char
  <2><8cb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <8cc>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><8d0>: Abbrev Number: 0
  <1><8d1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8d2>   DW_AT_name        : (strp) (offset: 0x2e2): setattrofunc
+    <8d2>   DW_AT_name        : (strp) (offset: 0x27c): setattrofunc
     <8d6>   DW_AT_decl_file   : (data1) 2
     <8d7>   DW_AT_decl_line   : (data1) 161
     <8d8>   DW_AT_decl_column : (data1) 15
     <8d9>   DW_AT_type        : (ref4) <0x7a4>, int
  <1><8dd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8de>   DW_AT_name        : (strp) (offset: 0xc9b): reprfunc
+    <8de>   DW_AT_name        : (strp) (offset: 0xb62): reprfunc
     <8e2>   DW_AT_decl_file   : (data1) 2
     <8e3>   DW_AT_decl_line   : (data1) 162
     <8e4>   DW_AT_decl_column : (data1) 21
     <8e5>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
  <1><8e9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8ea>   DW_AT_name        : (strp) (offset: 0x15be): hashfunc
+    <8ea>   DW_AT_name        : (strp) (offset: 0x1389): hashfunc
     <8ee>   DW_AT_decl_file   : (data1) 2
     <8ef>   DW_AT_decl_line   : (data1) 163
     <8f0>   DW_AT_decl_column : (data1) 21
     <8f1>   DW_AT_type        : (ref4) <0x8f5>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><8f5>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <8f6>   DW_AT_byte_size   : (data1) 8
     <8f7>   DW_AT_type        : (ref4) <0x8fb>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -1164,15 +1164,15 @@
     <8fc>   DW_AT_prototyped  : (flag_present) 1
     <8fc>   DW_AT_type        : (ref4) <0x321>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <900>   DW_AT_sibling     : (ref4) <0x90a>
  <2><904>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <905>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><909>: Abbrev Number: 0
  <1><90a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <90b>   DW_AT_name        : (strp) (offset: 0x7e4): richcmpfunc
+    <90b>   DW_AT_name        : (strp) (offset: 0x6ed): richcmpfunc
     <90f>   DW_AT_decl_file   : (data1) 2
     <910>   DW_AT_decl_line   : (data1) 164
     <911>   DW_AT_decl_column : (data1) 21
     <912>   DW_AT_type        : (ref4) <0x916>, PyObject, _object
  <1><916>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <917>   DW_AT_byte_size   : (data1) 8
     <918>   DW_AT_type        : (ref4) <0x91c>, PyObject, _object
@@ -1184,45 +1184,45 @@
     <926>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><92a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <92b>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><92f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <930>   DW_AT_type        : (ref4) <0x5f>, int
  <2><934>: Abbrev Number: 0
  <1><935>: Abbrev Number: 2 (DW_TAG_typedef)
-    <936>   DW_AT_name        : (strp) (offset: 0xb71): getiterfunc
+    <936>   DW_AT_name        : (strp) (offset: 0xa59): getiterfunc
     <93a>   DW_AT_decl_file   : (data1) 2
     <93b>   DW_AT_decl_line   : (data1) 165
     <93c>   DW_AT_decl_column : (data1) 21
     <93d>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
  <1><941>: Abbrev Number: 2 (DW_TAG_typedef)
-    <942>   DW_AT_name        : (strp) (offset: 0x1da7): iternextfunc
+    <942>   DW_AT_name        : (strp) (offset: 0x1ade): iternextfunc
     <946>   DW_AT_decl_file   : (data1) 2
     <947>   DW_AT_decl_line   : (data1) 166
     <948>   DW_AT_decl_column : (data1) 21
     <949>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
  <1><94d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <94e>   DW_AT_name        : (strp) (offset: 0xc0b): descrgetfunc
+    <94e>   DW_AT_name        : (strp) (offset: 0xad2): descrgetfunc
     <952>   DW_AT_decl_file   : (data1) 2
     <953>   DW_AT_decl_line   : (data1) 167
     <954>   DW_AT_decl_column : (data1) 21
     <955>   DW_AT_type        : (ref4) <0x6e6>, PyObject, _object
  <1><959>: Abbrev Number: 2 (DW_TAG_typedef)
-    <95a>   DW_AT_name        : (strp) (offset: 0xbaf): descrsetfunc
+    <95a>   DW_AT_name        : (strp) (offset: 0xa97): descrsetfunc
     <95e>   DW_AT_decl_file   : (data1) 2
     <95f>   DW_AT_decl_line   : (data1) 168
     <960>   DW_AT_decl_column : (data1) 15
     <961>   DW_AT_type        : (ref4) <0x7a4>, int
  <1><965>: Abbrev Number: 2 (DW_TAG_typedef)
-    <966>   DW_AT_name        : (strp) (offset: 0x266): initproc
+    <966>   DW_AT_name        : (strp) (offset: 0x20c): initproc
     <96a>   DW_AT_decl_file   : (data1) 2
     <96b>   DW_AT_decl_line   : (data1) 169
     <96c>   DW_AT_decl_column : (data1) 15
     <96d>   DW_AT_type        : (ref4) <0x7a4>, int
  <1><971>: Abbrev Number: 2 (DW_TAG_typedef)
-    <972>   DW_AT_name        : (strp) (offset: 0x15b6): newfunc
+    <972>   DW_AT_name        : (strp) (offset: 0x1381): newfunc
     <976>   DW_AT_decl_file   : (data1) 2
     <977>   DW_AT_decl_line   : (data1) 170
     <978>   DW_AT_decl_column : (data1) 21
     <979>   DW_AT_type        : (ref4) <0x97d>, PyObject, _object
  <1><97d>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <97e>   DW_AT_byte_size   : (data1) 8
     <97f>   DW_AT_type        : (ref4) <0x983>, PyObject, _object
@@ -1234,15 +1234,15 @@
     <98d>   DW_AT_type        : (ref4) <0x646>, _typeobject
  <2><991>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <992>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><996>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <997>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><99b>: Abbrev Number: 0
  <1><99c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <99d>   DW_AT_name        : (strp) (offset: 0x1204): allocfunc
+    <99d>   DW_AT_name        : (strp) (offset: 0x105b): allocfunc
     <9a1>   DW_AT_decl_file   : (data1) 2
     <9a2>   DW_AT_decl_line   : (data1) 171
     <9a3>   DW_AT_decl_column : (data1) 21
     <9a4>   DW_AT_type        : (ref4) <0x9a8>, PyObject, _object
  <1><9a8>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <9a9>   DW_AT_byte_size   : (data1) 8
     <9aa>   DW_AT_type        : (ref4) <0x9ae>, PyObject, _object
@@ -1252,31 +1252,31 @@
     <9b3>   DW_AT_sibling     : (ref4) <0x9c2>
  <2><9b7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <9b8>   DW_AT_type        : (ref4) <0x646>, _typeobject
  <2><9bc>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <9bd>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><9c1>: Abbrev Number: 0
  <1><9c2>: Abbrev Number: 23 (DW_TAG_variable)
-    <9c3>   DW_AT_name        : (strp) (offset: 0x117): PyBaseObject_Type
+    <9c3>   DW_AT_name        : (strp) (offset: 0xed): PyBaseObject_Type
     <9c7>   DW_AT_decl_file   : (data1) 2
     <9c8>   DW_AT_decl_line   : (data1) 207
     <9c9>   DW_AT_decl_column : (data1) 32
     <9ca>   DW_AT_type        : (ref4) <0x396>, _typeobject
     <9ce>   DW_AT_external    : (flag_present) 1
     <9ce>   DW_AT_declaration : (flag_present) 1
  <1><9ce>: Abbrev Number: 24 (DW_TAG_variable)
-    <9cf>   DW_AT_name        : (strp) (offset: 0x1c0d): _Py_NoneStruct
+    <9cf>   DW_AT_name        : (strp) (offset: 0x1990): _Py_NoneStruct
     <9d3>   DW_AT_decl_file   : (data1) 2
     <9d4>   DW_AT_decl_line   : (data2) 560
     <9d6>   DW_AT_decl_column : (data1) 22
     <9d7>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
     <9db>   DW_AT_external    : (flag_present) 1
     <9db>   DW_AT_declaration : (flag_present) 1
  <1><9db>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <9dc>   DW_AT_name        : (strp) (offset: 0x1569): bufferinfo
+    <9dc>   DW_AT_name        : (strp) (offset: 0x1357): bufferinfo
     <9e0>   DW_AT_byte_size   : (data1) 80
     <9e1>   DW_AT_decl_file   : (data1) 11
     <9e2>   DW_AT_decl_line   : (data1) 40
     <9e3>   DW_AT_decl_column : (data1) 16
     <9e4>   DW_AT_sibling     : (ref4) <0xa78>
  <2><9e8>: Abbrev Number: 25 (DW_TAG_member)
     <9e9>   DW_AT_name        : (string) buf
@@ -1296,81 +1296,81 @@
     <a03>   DW_AT_name        : (string) len
     <a07>   DW_AT_decl_file   : (data1) 11
     <a08>   DW_AT_decl_line   : (data1) 43
     <a09>   DW_AT_decl_column : (data1) 16
     <a0a>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a0e>   DW_AT_data_member_location: (data1) 16
  <2><a0f>: Abbrev Number: 9 (DW_TAG_member)
-    <a10>   DW_AT_name        : (strp) (offset: 0x24c): itemsize
+    <a10>   DW_AT_name        : (strp) (offset: 0x1f2): itemsize
     <a14>   DW_AT_decl_file   : (data1) 11
     <a15>   DW_AT_decl_line   : (data1) 44
     <a16>   DW_AT_decl_column : (data1) 16
     <a17>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a1b>   DW_AT_data_member_location: (data1) 24
  <2><a1c>: Abbrev Number: 9 (DW_TAG_member)
-    <a1d>   DW_AT_name        : (strp) (offset: 0x1494): readonly
+    <a1d>   DW_AT_name        : (strp) (offset: 0x12ad): readonly
     <a21>   DW_AT_decl_file   : (data1) 11
     <a22>   DW_AT_decl_line   : (data1) 46
     <a23>   DW_AT_decl_column : (data1) 9
     <a24>   DW_AT_type        : (ref4) <0x5f>, int
     <a28>   DW_AT_data_member_location: (data1) 32
  <2><a29>: Abbrev Number: 9 (DW_TAG_member)
-    <a2a>   DW_AT_name        : (strp) (offset: 0x1676): ndim
+    <a2a>   DW_AT_name        : (strp) (offset: 0x140f): ndim
     <a2e>   DW_AT_decl_file   : (data1) 11
     <a2f>   DW_AT_decl_line   : (data1) 47
     <a30>   DW_AT_decl_column : (data1) 9
     <a31>   DW_AT_type        : (ref4) <0x5f>, int
     <a35>   DW_AT_data_member_location: (data1) 36
  <2><a36>: Abbrev Number: 9 (DW_TAG_member)
-    <a37>   DW_AT_name        : (strp) (offset: 0x12a4): format
+    <a37>   DW_AT_name        : (strp) (offset: 0x10ee): format
     <a3b>   DW_AT_decl_file   : (data1) 11
     <a3c>   DW_AT_decl_line   : (data1) 48
     <a3d>   DW_AT_decl_column : (data1) 11
     <a3e>   DW_AT_type        : (ref4) <0x93>, char
     <a42>   DW_AT_data_member_location: (data1) 40
  <2><a43>: Abbrev Number: 9 (DW_TAG_member)
-    <a44>   DW_AT_name        : (strp) (offset: 0x1631): shape
+    <a44>   DW_AT_name        : (strp) (offset: 0x13e6): shape
     <a48>   DW_AT_decl_file   : (data1) 11
     <a49>   DW_AT_decl_line   : (data1) 49
     <a4a>   DW_AT_decl_column : (data1) 17
     <a4b>   DW_AT_type        : (ref4) <0xa78>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a4f>   DW_AT_data_member_location: (data1) 48
  <2><a50>: Abbrev Number: 9 (DW_TAG_member)
-    <a51>   DW_AT_name        : (strp) (offset: 0x1913): strides
+    <a51>   DW_AT_name        : (strp) (offset: 0x16a1): strides
     <a55>   DW_AT_decl_file   : (data1) 11
     <a56>   DW_AT_decl_line   : (data1) 50
     <a57>   DW_AT_decl_column : (data1) 17
     <a58>   DW_AT_type        : (ref4) <0xa78>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a5c>   DW_AT_data_member_location: (data1) 56
  <2><a5d>: Abbrev Number: 9 (DW_TAG_member)
-    <a5e>   DW_AT_name        : (strp) (offset: 0x1158): suboffsets
+    <a5e>   DW_AT_name        : (strp) (offset: 0xfaf): suboffsets
     <a62>   DW_AT_decl_file   : (data1) 11
     <a63>   DW_AT_decl_line   : (data1) 51
     <a64>   DW_AT_decl_column : (data1) 17
     <a65>   DW_AT_type        : (ref4) <0xa78>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a69>   DW_AT_data_member_location: (data1) 64
  <2><a6a>: Abbrev Number: 9 (DW_TAG_member)
-    <a6b>   DW_AT_name        : (strp) (offset: 0x1abd): internal
+    <a6b>   DW_AT_name        : (strp) (offset: 0x1840): internal
     <a6f>   DW_AT_decl_file   : (data1) 11
     <a70>   DW_AT_decl_line   : (data1) 52
     <a71>   DW_AT_decl_column : (data1) 11
     <a72>   DW_AT_type        : (ref4) <0x85>
     <a76>   DW_AT_data_member_location: (data1) 72
  <2><a77>: Abbrev Number: 0
  <1><a78>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <a79>   DW_AT_byte_size   : (data1) 8
     <a7a>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><a7e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a7f>   DW_AT_name        : (strp) (offset: 0x1df5): Py_buffer
+    <a7f>   DW_AT_name        : (strp) (offset: 0x1b2c): Py_buffer
     <a83>   DW_AT_decl_file   : (data1) 11
     <a84>   DW_AT_decl_line   : (data1) 53
     <a85>   DW_AT_decl_column : (data1) 3
     <a86>   DW_AT_type        : (ref4) <0x9db>, bufferinfo
  <1><a8a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a8b>   DW_AT_name        : (strp) (offset: 0x16f2): getbufferproc
+    <a8b>   DW_AT_name        : (strp) (offset: 0x1480): getbufferproc
     <a8f>   DW_AT_decl_file   : (data1) 11
     <a90>   DW_AT_decl_line   : (data1) 55
     <a91>   DW_AT_decl_column : (data1) 15
     <a92>   DW_AT_type        : (ref4) <0xa96>, int
  <1><a96>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <a97>   DW_AT_byte_size   : (data1) 8
     <a98>   DW_AT_type        : (ref4) <0xa9c>, int
@@ -1385,15 +1385,15 @@
  <2><aaf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <ab0>   DW_AT_type        : (ref4) <0x5f>, int
  <2><ab4>: Abbrev Number: 0
  <1><ab5>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <ab6>   DW_AT_byte_size   : (data1) 8
     <ab7>   DW_AT_type        : (ref4) <0xa7e>, Py_buffer, bufferinfo
  <1><abb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <abc>   DW_AT_name        : (strp) (offset: 0x19fa): releasebufferproc
+    <abc>   DW_AT_name        : (strp) (offset: 0x1788): releasebufferproc
     <ac0>   DW_AT_decl_file   : (data1) 11
     <ac1>   DW_AT_decl_line   : (data1) 56
     <ac2>   DW_AT_decl_column : (data1) 16
     <ac3>   DW_AT_type        : (ref4) <0xac7>
  <1><ac7>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <ac8>   DW_AT_byte_size   : (data1) 8
     <ac9>   DW_AT_type        : (ref4) <0xacd>
@@ -1402,15 +1402,15 @@
     <ace>   DW_AT_sibling     : (ref4) <0xadd>
  <2><ad2>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <ad3>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
  <2><ad7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     <ad8>   DW_AT_type        : (ref4) <0xab5>, Py_buffer, bufferinfo
  <2><adc>: Abbrev Number: 0
  <1><add>: Abbrev Number: 2 (DW_TAG_typedef)
-    <ade>   DW_AT_name        : (strp) (offset: 0xb62): vectorcallfunc
+    <ade>   DW_AT_name        : (strp) (offset: 0xa4a): vectorcallfunc
     <ae2>   DW_AT_decl_file   : (data1) 11
     <ae3>   DW_AT_decl_line   : (data1) 58
     <ae4>   DW_AT_decl_column : (data1) 21
     <ae5>   DW_AT_type        : (ref4) <0xae9>, PyObject, _object
  <1><ae9>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <aea>   DW_AT_byte_size   : (data1) 8
     <aeb>   DW_AT_type        : (ref4) <0xaef>, PyObject, _object
@@ -1433,446 +1433,446 @@
  <1><b13>: Abbrev Number: 26 (DW_TAG_structure_type)
     <b14>   DW_AT_byte_size   : (data2) 288
     <b16>   DW_AT_decl_file   : (data1) 11
     <b17>   DW_AT_decl_line   : (data1) 95
     <b18>   DW_AT_decl_column : (data1) 9
     <b19>   DW_AT_sibling     : (ref4) <0xcf6>
  <2><b1d>: Abbrev Number: 9 (DW_TAG_member)
-    <b1e>   DW_AT_name        : (strp) (offset: 0xe8): nb_add
+    <b1e>   DW_AT_name        : (strp) (offset: 0xbe): nb_add
     <b22>   DW_AT_decl_file   : (data1) 11
     <b23>   DW_AT_decl_line   : (data1) 100
     <b24>   DW_AT_decl_column : (data1) 16
     <b25>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <b29>   DW_AT_data_member_location: (data1) 0
  <2><b2a>: Abbrev Number: 9 (DW_TAG_member)
-    <b2b>   DW_AT_name        : (strp) (offset: 0x1d09): nb_subtract
+    <b2b>   DW_AT_name        : (strp) (offset: 0x1a73): nb_subtract
     <b2f>   DW_AT_decl_file   : (data1) 11
     <b30>   DW_AT_decl_line   : (data1) 101
     <b31>   DW_AT_decl_column : (data1) 16
     <b32>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <b36>   DW_AT_data_member_location: (data1) 8
  <2><b37>: Abbrev Number: 9 (DW_TAG_member)
-    <b38>   DW_AT_name        : (strp) (offset: 0x1868): nb_multiply
+    <b38>   DW_AT_name        : (strp) (offset: 0x15f6): nb_multiply
     <b3c>   DW_AT_decl_file   : (data1) 11
     <b3d>   DW_AT_decl_line   : (data1) 102
     <b3e>   DW_AT_decl_column : (data1) 16
     <b3f>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <b43>   DW_AT_data_member_location: (data1) 16
  <2><b44>: Abbrev Number: 9 (DW_TAG_member)
-    <b45>   DW_AT_name        : (strp) (offset: 0x43b): nb_remainder
+    <b45>   DW_AT_name        : (strp) (offset: 0x3b5): nb_remainder
     <b49>   DW_AT_decl_file   : (data1) 11
     <b4a>   DW_AT_decl_line   : (data1) 103
     <b4b>   DW_AT_decl_column : (data1) 16
     <b4c>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <b50>   DW_AT_data_member_location: (data1) 24
  <2><b51>: Abbrev Number: 9 (DW_TAG_member)
-    <b52>   DW_AT_name        : (strp) (offset: 0x1e95): nb_divmod
+    <b52>   DW_AT_name        : (strp) (offset: 0x1bcc): nb_divmod
     <b56>   DW_AT_decl_file   : (data1) 11
     <b57>   DW_AT_decl_line   : (data1) 104
     <b58>   DW_AT_decl_column : (data1) 16
     <b59>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <b5d>   DW_AT_data_member_location: (data1) 32
  <2><b5e>: Abbrev Number: 9 (DW_TAG_member)
-    <b5f>   DW_AT_name        : (strp) (offset: 0x1c1): nb_power
+    <b5f>   DW_AT_name        : (strp) (offset: 0x176): nb_power
     <b63>   DW_AT_decl_file   : (data1) 11
     <b64>   DW_AT_decl_line   : (data1) 105
     <b65>   DW_AT_decl_column : (data1) 17
     <b66>   DW_AT_type        : (ref4) <0x6da>, ternaryfunc, PyObject, _object
     <b6a>   DW_AT_data_member_location: (data1) 40
  <2><b6b>: Abbrev Number: 9 (DW_TAG_member)
-    <b6c>   DW_AT_name        : (strp) (offset: 0xd91): nb_negative
+    <b6c>   DW_AT_name        : (strp) (offset: 0xc58): nb_negative
     <b70>   DW_AT_decl_file   : (data1) 11
     <b71>   DW_AT_decl_line   : (data1) 106
     <b72>   DW_AT_decl_column : (data1) 15
     <b73>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <b77>   DW_AT_data_member_location: (data1) 48
  <2><b78>: Abbrev Number: 9 (DW_TAG_member)
-    <b79>   DW_AT_name        : (strp) (offset: 0x1bf3): nb_positive
+    <b79>   DW_AT_name        : (strp) (offset: 0x1976): nb_positive
     <b7d>   DW_AT_decl_file   : (data1) 11
     <b7e>   DW_AT_decl_line   : (data1) 107
     <b7f>   DW_AT_decl_column : (data1) 15
     <b80>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <b84>   DW_AT_data_member_location: (data1) 56
  <2><b85>: Abbrev Number: 9 (DW_TAG_member)
-    <b86>   DW_AT_name        : (strp) (offset: 0x1a74): nb_absolute
+    <b86>   DW_AT_name        : (strp) (offset: 0x17f7): nb_absolute
     <b8a>   DW_AT_decl_file   : (data1) 11
     <b8b>   DW_AT_decl_line   : (data1) 108
     <b8c>   DW_AT_decl_column : (data1) 15
     <b8d>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <b91>   DW_AT_data_member_location: (data1) 64
  <2><b92>: Abbrev Number: 9 (DW_TAG_member)
-    <b93>   DW_AT_name        : (strp) (offset: 0x984): nb_bool
+    <b93>   DW_AT_name        : (strp) (offset: 0x879): nb_bool
     <b97>   DW_AT_decl_file   : (data1) 11
     <b98>   DW_AT_decl_line   : (data1) 109
     <b99>   DW_AT_decl_column : (data1) 13
     <b9a>   DW_AT_type        : (ref4) <0x705>, inquiry, int
     <b9e>   DW_AT_data_member_location: (data1) 72
  <2><b9f>: Abbrev Number: 9 (DW_TAG_member)
-    <ba0>   DW_AT_name        : (strp) (offset: 0x138b): nb_invert
+    <ba0>   DW_AT_name        : (strp) (offset: 0x11c7): nb_invert
     <ba4>   DW_AT_decl_file   : (data1) 11
     <ba5>   DW_AT_decl_line   : (data1) 110
     <ba6>   DW_AT_decl_column : (data1) 15
     <ba7>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <bab>   DW_AT_data_member_location: (data1) 80
  <2><bac>: Abbrev Number: 9 (DW_TAG_member)
-    <bad>   DW_AT_name        : (strp) (offset: 0x17b): nb_lshift
+    <bad>   DW_AT_name        : (strp) (offset: 0x130): nb_lshift
     <bb1>   DW_AT_decl_file   : (data1) 11
     <bb2>   DW_AT_decl_line   : (data1) 111
     <bb3>   DW_AT_decl_column : (data1) 16
     <bb4>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <bb8>   DW_AT_data_member_location: (data1) 88
  <2><bb9>: Abbrev Number: 9 (DW_TAG_member)
-    <bba>   DW_AT_name        : (strp) (offset: 0x1944): nb_rshift
+    <bba>   DW_AT_name        : (strp) (offset: 0x16d2): nb_rshift
     <bbe>   DW_AT_decl_file   : (data1) 11
     <bbf>   DW_AT_decl_line   : (data1) 112
     <bc0>   DW_AT_decl_column : (data1) 16
     <bc1>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <bc5>   DW_AT_data_member_location: (data1) 96
  <2><bc6>: Abbrev Number: 9 (DW_TAG_member)
-    <bc7>   DW_AT_name        : (strp) (offset: 0x59c): nb_and
+    <bc7>   DW_AT_name        : (strp) (offset: 0x4f6): nb_and
     <bcb>   DW_AT_decl_file   : (data1) 11
     <bcc>   DW_AT_decl_line   : (data1) 113
     <bcd>   DW_AT_decl_column : (data1) 16
     <bce>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <bd2>   DW_AT_data_member_location: (data1) 104
  <2><bd3>: Abbrev Number: 9 (DW_TAG_member)
-    <bd4>   DW_AT_name        : (strp) (offset: 0xd8a): nb_xor
+    <bd4>   DW_AT_name        : (strp) (offset: 0xc51): nb_xor
     <bd8>   DW_AT_decl_file   : (data1) 11
     <bd9>   DW_AT_decl_line   : (data1) 114
     <bda>   DW_AT_decl_column : (data1) 16
     <bdb>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <bdf>   DW_AT_data_member_location: (data1) 112
  <2><be0>: Abbrev Number: 9 (DW_TAG_member)
-    <be1>   DW_AT_name        : (strp) (offset: 0x1294): nb_or
+    <be1>   DW_AT_name        : (strp) (offset: 0x10de): nb_or
     <be5>   DW_AT_decl_file   : (data1) 11
     <be6>   DW_AT_decl_line   : (data1) 115
     <be7>   DW_AT_decl_column : (data1) 16
     <be8>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <bec>   DW_AT_data_member_location: (data1) 120
  <2><bed>: Abbrev Number: 9 (DW_TAG_member)
-    <bee>   DW_AT_name        : (strp) (offset: 0x1dbe): nb_int
+    <bee>   DW_AT_name        : (strp) (offset: 0x1af5): nb_int
     <bf2>   DW_AT_decl_file   : (data1) 11
     <bf3>   DW_AT_decl_line   : (data1) 116
     <bf4>   DW_AT_decl_column : (data1) 15
     <bf5>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <bf9>   DW_AT_data_member_location: (data1) 128
  <2><bfa>: Abbrev Number: 9 (DW_TAG_member)
-    <bfb>   DW_AT_name        : (strp) (offset: 0xc39): nb_reserved
+    <bfb>   DW_AT_name        : (strp) (offset: 0xb00): nb_reserved
     <bff>   DW_AT_decl_file   : (data1) 11
     <c00>   DW_AT_decl_line   : (data1) 117
     <c01>   DW_AT_decl_column : (data1) 11
     <c02>   DW_AT_type        : (ref4) <0x85>
     <c06>   DW_AT_data_member_location: (data1) 136
  <2><c07>: Abbrev Number: 9 (DW_TAG_member)
-    <c08>   DW_AT_name        : (strp) (offset: 0x1316): nb_float
+    <c08>   DW_AT_name        : (strp) (offset: 0x1160): nb_float
     <c0c>   DW_AT_decl_file   : (data1) 11
     <c0d>   DW_AT_decl_line   : (data1) 118
     <c0e>   DW_AT_decl_column : (data1) 15
     <c0f>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <c13>   DW_AT_data_member_location: (data1) 144
  <2><c14>: Abbrev Number: 9 (DW_TAG_member)
-    <c15>   DW_AT_name        : (strp) (offset: 0xc2a): nb_inplace_add
+    <c15>   DW_AT_name        : (strp) (offset: 0xaf1): nb_inplace_add
     <c19>   DW_AT_decl_file   : (data1) 11
     <c1a>   DW_AT_decl_line   : (data1) 120
     <c1b>   DW_AT_decl_column : (data1) 16
     <c1c>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c20>   DW_AT_data_member_location: (data1) 152
  <2><c21>: Abbrev Number: 9 (DW_TAG_member)
-    <c22>   DW_AT_name        : (strp) (offset: 0x1e54): nb_inplace_subtract
+    <c22>   DW_AT_name        : (strp) (offset: 0x1b8b): nb_inplace_subtract
     <c26>   DW_AT_decl_file   : (data1) 11
     <c27>   DW_AT_decl_line   : (data1) 121
     <c28>   DW_AT_decl_column : (data1) 16
     <c29>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c2d>   DW_AT_data_member_location: (data1) 160
  <2><c2e>: Abbrev Number: 9 (DW_TAG_member)
-    <c2f>   DW_AT_name        : (strp) (offset: 0x46e): nb_inplace_multiply
+    <c2f>   DW_AT_name        : (strp) (offset: 0x3e8): nb_inplace_multiply
     <c33>   DW_AT_decl_file   : (data1) 11
     <c34>   DW_AT_decl_line   : (data1) 122
     <c35>   DW_AT_decl_column : (data1) 16
     <c36>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c3a>   DW_AT_data_member_location: (data1) 168
  <2><c3b>: Abbrev Number: 9 (DW_TAG_member)
-    <c3c>   DW_AT_name        : (strp) (offset: 0x1a11): nb_inplace_remainder
+    <c3c>   DW_AT_name        : (strp) (offset: 0x179f): nb_inplace_remainder
     <c40>   DW_AT_decl_file   : (data1) 11
     <c41>   DW_AT_decl_line   : (data1) 123
     <c42>   DW_AT_decl_column : (data1) 16
     <c43>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c47>   DW_AT_data_member_location: (data1) 176
  <2><c48>: Abbrev Number: 9 (DW_TAG_member)
-    <c49>   DW_AT_name        : (strp) (offset: 0x180f): nb_inplace_power
+    <c49>   DW_AT_name        : (strp) (offset: 0x159d): nb_inplace_power
     <c4d>   DW_AT_decl_file   : (data1) 11
     <c4e>   DW_AT_decl_line   : (data1) 124
     <c4f>   DW_AT_decl_column : (data1) 17
     <c50>   DW_AT_type        : (ref4) <0x6da>, ternaryfunc, PyObject, _object
     <c54>   DW_AT_data_member_location: (data1) 184
  <2><c55>: Abbrev Number: 9 (DW_TAG_member)
-    <c56>   DW_AT_name        : (strp) (offset: 0x362): nb_inplace_lshift
+    <c56>   DW_AT_name        : (strp) (offset: 0x2dc): nb_inplace_lshift
     <c5a>   DW_AT_decl_file   : (data1) 11
     <c5b>   DW_AT_decl_line   : (data1) 125
     <c5c>   DW_AT_decl_column : (data1) 16
     <c5d>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c61>   DW_AT_data_member_location: (data1) 192
  <2><c62>: Abbrev Number: 9 (DW_TAG_member)
-    <c63>   DW_AT_name        : (strp) (offset: 0x1bbf): nb_inplace_rshift
+    <c63>   DW_AT_name        : (strp) (offset: 0x1942): nb_inplace_rshift
     <c67>   DW_AT_decl_file   : (data1) 11
     <c68>   DW_AT_decl_line   : (data1) 126
     <c69>   DW_AT_decl_column : (data1) 16
     <c6a>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c6e>   DW_AT_data_member_location: (data1) 200
  <2><c6f>: Abbrev Number: 9 (DW_TAG_member)
-    <c70>   DW_AT_name        : (strp) (offset: 0x10d0): nb_inplace_and
+    <c70>   DW_AT_name        : (strp) (offset: 0xf45): nb_inplace_and
     <c74>   DW_AT_decl_file   : (data1) 11
     <c75>   DW_AT_decl_line   : (data1) 127
     <c76>   DW_AT_decl_column : (data1) 16
     <c77>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c7b>   DW_AT_data_member_location: (data1) 208
  <2><c7c>: Abbrev Number: 9 (DW_TAG_member)
-    <c7d>   DW_AT_name        : (strp) (offset: 0x17f2): nb_inplace_xor
+    <c7d>   DW_AT_name        : (strp) (offset: 0x1580): nb_inplace_xor
     <c81>   DW_AT_decl_file   : (data1) 11
     <c82>   DW_AT_decl_line   : (data1) 128
     <c83>   DW_AT_decl_column : (data1) 16
     <c84>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c88>   DW_AT_data_member_location: (data1) 216
  <2><c89>: Abbrev Number: 9 (DW_TAG_member)
-    <c8a>   DW_AT_name        : (strp) (offset: 0x1b06): nb_inplace_or
+    <c8a>   DW_AT_name        : (strp) (offset: 0x1889): nb_inplace_or
     <c8e>   DW_AT_decl_file   : (data1) 11
     <c8f>   DW_AT_decl_line   : (data1) 129
     <c90>   DW_AT_decl_column : (data1) 16
     <c91>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <c95>   DW_AT_data_member_location: (data1) 224
  <2><c96>: Abbrev Number: 9 (DW_TAG_member)
-    <c97>   DW_AT_name        : (strp) (offset: 0x332): nb_floor_divide
+    <c97>   DW_AT_name        : (strp) (offset: 0x2cc): nb_floor_divide
     <c9b>   DW_AT_decl_file   : (data1) 11
     <c9c>   DW_AT_decl_line   : (data1) 131
     <c9d>   DW_AT_decl_column : (data1) 16
     <c9e>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <ca2>   DW_AT_data_member_location: (data1) 232
  <2><ca3>: Abbrev Number: 9 (DW_TAG_member)
-    <ca4>   DW_AT_name        : (strp) (offset: 0x187b): nb_true_divide
+    <ca4>   DW_AT_name        : (strp) (offset: 0x1609): nb_true_divide
     <ca8>   DW_AT_decl_file   : (data1) 11
     <ca9>   DW_AT_decl_line   : (data1) 132
     <caa>   DW_AT_decl_column : (data1) 16
     <cab>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <caf>   DW_AT_data_member_location: (data1) 240
  <2><cb0>: Abbrev Number: 9 (DW_TAG_member)
-    <cb1>   DW_AT_name        : (strp) (offset: 0x18fb): nb_inplace_floor_divide
+    <cb1>   DW_AT_name        : (strp) (offset: 0x1689): nb_inplace_floor_divide
     <cb5>   DW_AT_decl_file   : (data1) 11
     <cb6>   DW_AT_decl_line   : (data1) 133
     <cb7>   DW_AT_decl_column : (data1) 16
     <cb8>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <cbc>   DW_AT_data_member_location: (data1) 248
  <2><cbd>: Abbrev Number: 17 (DW_TAG_member)
-    <cbe>   DW_AT_name        : (strp) (offset: 0xf7d): nb_inplace_true_divide
+    <cbe>   DW_AT_name        : (strp) (offset: 0xe22): nb_inplace_true_divide
     <cc2>   DW_AT_decl_file   : (data1) 11
     <cc3>   DW_AT_decl_line   : (data1) 134
     <cc4>   DW_AT_decl_column : (data1) 16
     <cc5>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <cc9>   DW_AT_data_member_location: (data2) 256
  <2><ccb>: Abbrev Number: 17 (DW_TAG_member)
-    <ccc>   DW_AT_name        : (strp) (offset: 0x3f4): nb_index
+    <ccc>   DW_AT_name        : (strp) (offset: 0x36e): nb_index
     <cd0>   DW_AT_decl_file   : (data1) 11
     <cd1>   DW_AT_decl_line   : (data1) 136
     <cd2>   DW_AT_decl_column : (data1) 15
     <cd3>   DW_AT_type        : (ref4) <0x688>, unaryfunc, PyObject, _object
     <cd7>   DW_AT_data_member_location: (data2) 264
  <2><cd9>: Abbrev Number: 17 (DW_TAG_member)
-    <cda>   DW_AT_name        : (strp) (offset: 0x168): nb_matrix_multiply
+    <cda>   DW_AT_name        : (strp) (offset: 0x11d): nb_matrix_multiply
     <cde>   DW_AT_decl_file   : (data1) 11
     <cdf>   DW_AT_decl_line   : (data1) 138
     <ce0>   DW_AT_decl_column : (data1) 16
     <ce1>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <ce5>   DW_AT_data_member_location: (data2) 272
  <2><ce7>: Abbrev Number: 17 (DW_TAG_member)
-    <ce8>   DW_AT_name        : (strp) (offset: 0x1e2c): nb_inplace_matrix_multiply
+    <ce8>   DW_AT_name        : (strp) (offset: 0x1b63): nb_inplace_matrix_multiply
     <cec>   DW_AT_decl_file   : (data1) 11
     <ced>   DW_AT_decl_line   : (data1) 139
     <cee>   DW_AT_decl_column : (data1) 16
     <cef>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <cf3>   DW_AT_data_member_location: (data2) 280
  <2><cf5>: Abbrev Number: 0
  <1><cf6>: Abbrev Number: 2 (DW_TAG_typedef)
-    <cf7>   DW_AT_name        : (strp) (offset: 0x851): PyNumberMethods
+    <cf7>   DW_AT_name        : (strp) (offset: 0x75a): PyNumberMethods
     <cfb>   DW_AT_decl_file   : (data1) 11
     <cfc>   DW_AT_decl_line   : (data1) 140
     <cfd>   DW_AT_decl_column : (data1) 3
     <cfe>   DW_AT_type        : (ref4) <0xb13>
  <1><d02>: Abbrev Number: 19 (DW_TAG_structure_type)
     <d03>   DW_AT_byte_size   : (data1) 80
     <d04>   DW_AT_decl_file   : (data1) 11
     <d05>   DW_AT_decl_line   : (data1) 142
     <d06>   DW_AT_decl_column : (data1) 9
     <d07>   DW_AT_sibling     : (ref4) <0xd8e>
  <2><d0b>: Abbrev Number: 9 (DW_TAG_member)
-    <d0c>   DW_AT_name        : (strp) (offset: 0x18a9): sq_length
+    <d0c>   DW_AT_name        : (strp) (offset: 0x1637): sq_length
     <d10>   DW_AT_decl_file   : (data1) 11
     <d11>   DW_AT_decl_line   : (data1) 143
     <d12>   DW_AT_decl_column : (data1) 13
     <d13>   DW_AT_type        : (ref4) <0x726>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <d17>   DW_AT_data_member_location: (data1) 0
  <2><d18>: Abbrev Number: 9 (DW_TAG_member)
-    <d19>   DW_AT_name        : (strp) (offset: 0x23f): sq_concat
+    <d19>   DW_AT_name        : (strp) (offset: 0x1e5): sq_concat
     <d1d>   DW_AT_decl_file   : (data1) 11
     <d1e>   DW_AT_decl_line   : (data1) 144
     <d1f>   DW_AT_decl_column : (data1) 16
     <d20>   DW_AT_type        : (ref4) <0x6b4>, binaryfunc, PyObject, _object
     <d24>   DW_AT_data_member_location: (data1) 8
  <2><d25>: Abbrev Number: 9 (DW_TAG_member)
-    <d26>   DW_AT_name        : (strp) (offset: 0x1ec): sq_repeat
+    <d26>   DW_AT_name        : (strp) (offset: 0x192): sq_repeat
     <d2a>   DW_AT_decl_file   : (data1) 11
     <d2b>   DW_AT_decl_line   : (data1) 145
     <d2c>   DW_AT_decl_column : (data1) 18
     <d2d>   DW_AT_type        : (ref4) <0x747>, ssizeargfunc, PyObject, _object
     <d31>   DW_AT_data_member_location: (data1) 16
  <2><d32>: Abbrev Number: 9 (DW_TAG_member)
-    <d33>   DW_AT_name        : (strp) (offset: 0xc9): sq_item
+    <d33>   DW_AT_name        : (strp) (offset: 0x9f): sq_item
     <d37>   DW_AT_decl_file   : (data1) 11
     <d38>   DW_AT_decl_line   : (data1) 146
     <d39>   DW_AT_decl_column : (data1) 18
     <d3a>   DW_AT_type        : (ref4) <0x747>, ssizeargfunc, PyObject, _object
     <d3e>   DW_AT_data_member_location: (data1) 24
  <2><d3f>: Abbrev Number: 9 (DW_TAG_member)
-    <d40>   DW_AT_name        : (strp) (offset: 0x4b6): was_sq_slice
+    <d40>   DW_AT_name        : (strp) (offset: 0x430): was_sq_slice
     <d44>   DW_AT_decl_file   : (data1) 11
     <d45>   DW_AT_decl_line   : (data1) 147
     <d46>   DW_AT_decl_column : (data1) 11
     <d47>   DW_AT_type        : (ref4) <0x85>
     <d4b>   DW_AT_data_member_location: (data1) 32
  <2><d4c>: Abbrev Number: 9 (DW_TAG_member)
-    <d4d>   DW_AT_name        : (strp) (offset: 0x10b): sq_ass_item
+    <d4d>   DW_AT_name        : (strp) (offset: 0xe1): sq_ass_item
     <d51>   DW_AT_decl_file   : (data1) 11
     <d52>   DW_AT_decl_line   : (data1) 148
     <d53>   DW_AT_decl_column : (data1) 21
     <d54>   DW_AT_type        : (ref4) <0x76d>, ssizeobjargproc, int
     <d58>   DW_AT_data_member_location: (data1) 40
  <2><d59>: Abbrev Number: 9 (DW_TAG_member)
-    <d5a>   DW_AT_name        : (strp) (offset: 0x63d): was_sq_ass_slice
+    <d5a>   DW_AT_name        : (strp) (offset: 0x57d): was_sq_ass_slice
     <d5e>   DW_AT_decl_file   : (data1) 11
     <d5f>   DW_AT_decl_line   : (data1) 149
     <d60>   DW_AT_decl_column : (data1) 11
