# Comparing `tmp/composabl_core_dev-0.3.9.dev18-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/composabl_core_dev-0.3.9.dev20-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,78 +1,78 @@
-Zip file size: 7710048 bytes, number of entries: 76
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core_dev.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core_dev-0.3.9.dev18.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/agent/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/grpc/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/decorators/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/utils/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/cli/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/proto/
--rwxr-xr-x  2.0 unx   850496 b- defN 23-Aug-03 00:41 composabl_core/runtime_base.cpython-38-x86_64-linux-gnu.so
--rwxr-xr-x  2.0 unx    73816 b- defN 23-Aug-03 00:41 composabl_core/__init__.cpython-38-x86_64-linux-gnu.so
--rwxr-xr-x  2.0 unx   193688 b- defN 23-Aug-03 00:41 composabl_core/main.cpython-38-x86_64-linux-gnu.so
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 00:41 composabl_core/agent/skill/

    166: 000000000001a738    14 OBJECT  LOCAL  DEFAULT   13 __pyx_k_initializing
    167: 000000000001a898     8 OBJECT  LOCAL  DEFAULT   13 __pyx_k_isValid
    168: 000000000001a728    14 OBJECT  LOCAL  DEFAULT   13 __pyx_k_is_coroutine
```

### readelf --wide --notes {}

```diff
@@ -1,4 +1,4 @@
 
 Displaying notes found in: .note.gnu.build-id
   Owner                Data size 	Description
-  GNU                  0x00000014	NT_GNU_BUILD_ID (unique build ID bitstring)	    Build ID: 3f12e97e67d3f624f29ee39ba25873986076b055
+  GNU                  0x00000014	NT_GNU_BUILD_ID (unique build ID bitstring)	    Build ID: 8c639d52daae6bb0aed2e8ea8b42b19f55b2793a
```

### readelf --wide --debug-dump=info {}

```diff
@@ -2,86 +2,86 @@
 
   Compilation Unit @ offset 0:
    Length:        0x273c4 (32-bit)
    Version:       4
    Abbrev Offset: 0
    Pointer Size:  8
  <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
-    <c>   DW_AT_producer    : (strp) (offset: 0x19d6): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
+    <c>   DW_AT_producer    : (strp) (offset: 0x19ad): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
     <10>   DW_AT_language    : (data1) 12	(ANSI C99)
     <11>   DW_AT_name        : (strp) (offset: 0x3a65): dist/build_cython/composabl_core/runtime_base.c
-    <15>   DW_AT_comp_dir    : (strp) (offset: 0x6c6): /project/composabl_core
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0x69d): /project/composabl_core
     <19>   DW_AT_ranges      : (sec_offset) 0x11af0
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2a>   DW_AT_name        : (strp) (offset: 0x1fee): size_t
+    <2a>   DW_AT_name        : (strp) (offset: 0x1fc5): size_t
     <2e>   DW_AT_decl_file   : (data1) 4
     <2f>   DW_AT_decl_line   : (data1) 209
     <30>   DW_AT_decl_column : (data1) 23
     <31>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><35>: Abbrev Number: 3 (DW_TAG_base_type)
     <36>   DW_AT_byte_size   : (data1) 8
     <37>   DW_AT_encoding    : (data1) 7	(unsigned)
     <38>   DW_AT_name        : (strp) (offset: 0x440e): long unsigned int
  <1><3c>: Abbrev Number: 3 (DW_TAG_base_type)
     <3d>   DW_AT_byte_size   : (data1) 1
     <3e>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <3f>   DW_AT_name        : (strp) (offset: 0x1412): unsigned char
+    <3f>   DW_AT_name        : (strp) (offset: 0x13e9): unsigned char
  <1><43>: Abbrev Number: 3 (DW_TAG_base_type)
     <44>   DW_AT_byte_size   : (data1) 2
     <45>   DW_AT_encoding    : (data1) 7	(unsigned)
     <46>   DW_AT_name        : (strp) (offset: 0x2b07): short unsigned int
  <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
     <4b>   DW_AT_byte_size   : (data1) 4
     <4c>   DW_AT_encoding    : (data1) 7	(unsigned)
     <4d>   DW_AT_name        : (strp) (offset: 0x4413): unsigned int
  <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
     <52>   DW_AT_byte_size   : (data1) 1
     <53>   DW_AT_encoding    : (data1) 6	(signed char)
-    <54>   DW_AT_name        : (strp) (offset: 0x1414): signed char
+    <54>   DW_AT_name        : (strp) (offset: 0x13eb): signed char
  <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
     <59>   DW_AT_byte_size   : (data1) 2
     <5a>   DW_AT_encoding    : (data1) 5	(signed)
     <5b>   DW_AT_name        : (strp) (offset: 0x4fa8): short int
  <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
     <60>   DW_AT_byte_size   : (data1) 4
     <61>   DW_AT_encoding    : (data1) 5	(signed)
     <62>   DW_AT_name        : (string) int
  <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
     <67>   DW_AT_byte_size   : (data1) 8
     <68>   DW_AT_encoding    : (data1) 5	(signed)
     <69>   DW_AT_name        : (strp) (offset: 0x49bb): long int
  <1><6d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6e>   DW_AT_name        : (strp) (offset: 0x602): __off_t
+    <6e>   DW_AT_name        : (strp) (offset: 0x5d9): __off_t
     <72>   DW_AT_decl_file   : (data1) 5
     <73>   DW_AT_decl_line   : (data1) 140
     <74>   DW_AT_decl_column : (data1) 25
     <75>   DW_AT_type        : (ref4) <0x66>, long int
  <1><79>: Abbrev Number: 2 (DW_TAG_typedef)
     <7a>   DW_AT_name        : (strp) (offset: 0x2cf3): __off64_t
     <7e>   DW_AT_decl_file   : (data1) 5
     <7f>   DW_AT_decl_line   : (data1) 141
     <80>   DW_AT_decl_column : (data1) 27
     <81>   DW_AT_type        : (ref4) <0x66>, long int
  <1><85>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <86>   DW_AT_byte_size   : (data1) 8
  <1><87>: Abbrev Number: 2 (DW_TAG_typedef)
-    <88>   DW_AT_name        : (strp) (offset: 0x23a8): __ssize_t
+    <88>   DW_AT_name        : (strp) (offset: 0x237f): __ssize_t
     <8c>   DW_AT_decl_file   : (data1) 5
     <8d>   DW_AT_decl_line   : (data1) 181
     <8e>   DW_AT_decl_column : (data1) 27
     <8f>   DW_AT_type        : (ref4) <0x66>, long int
  <1><93>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <94>   DW_AT_byte_size   : (data1) 8
     <95>   DW_AT_type        : (ref4) <0x99>, char
  <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
     <9a>   DW_AT_byte_size   : (data1) 1
     <9b>   DW_AT_encoding    : (data1) 6	(signed char)
-    <9c>   DW_AT_name        : (strp) (offset: 0x141b): char
+    <9c>   DW_AT_name        : (strp) (offset: 0x13f2): char
  <1><a0>: Abbrev Number: 7 (DW_TAG_const_type)
     <a1>   DW_AT_type        : (ref4) <0x99>, char
  <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
     <a6>   DW_AT_name        : (strp) (offset: 0x3a51): FILE
     <aa>   DW_AT_decl_file   : (data1) 6
     <ab>   DW_AT_decl_line   : (data1) 48
     <ac>   DW_AT_decl_column : (data1) 25
@@ -125,22 +125,22 @@
     <f3>   DW_AT_name        : (strp) (offset: 0x2ea9): _IO_write_base
     <f7>   DW_AT_decl_file   : (data1) 7
     <f8>   DW_AT_decl_line   : (data1) 255
     <f9>   DW_AT_decl_column : (data1) 9
     <fa>   DW_AT_type        : (ref4) <0x93>, char
     <fe>   DW_AT_data_member_location: (data1) 32
  <2><ff>: Abbrev Number: 10 (DW_TAG_member)
-    <100>   DW_AT_name        : (strp) (offset: 0x1951): _IO_write_ptr
+    <100>   DW_AT_name        : (strp) (offset: 0x1928): _IO_write_ptr
     <104>   DW_AT_decl_file   : (data1) 7
     <105>   DW_AT_decl_line   : (data2) 256
     <107>   DW_AT_decl_column : (data1) 9
     <108>   DW_AT_type        : (ref4) <0x93>, char
     <10c>   DW_AT_data_member_location: (data1) 40
  <2><10d>: Abbrev Number: 10 (DW_TAG_member)
-    <10e>   DW_AT_name        : (strp) (offset: 0xac7): _IO_write_end
+    <10e>   DW_AT_name        : (strp) (offset: 0xaca): _IO_write_end
     <112>   DW_AT_decl_file   : (data1) 7
     <113>   DW_AT_decl_line   : (data2) 257
     <115>   DW_AT_decl_column : (data1) 9
     <116>   DW_AT_type        : (ref4) <0x93>, char
     <11a>   DW_AT_data_member_location: (data1) 48
  <2><11b>: Abbrev Number: 10 (DW_TAG_member)
     <11c>   DW_AT_name        : (strp) (offset: 0x38a7): _IO_buf_base
@@ -153,15 +153,15 @@
     <12a>   DW_AT_name        : (strp) (offset: 0x2d83): _IO_buf_end
     <12e>   DW_AT_decl_file   : (data1) 7
     <12f>   DW_AT_decl_line   : (data2) 259
     <131>   DW_AT_decl_column : (data1) 9
     <132>   DW_AT_type        : (ref4) <0x93>, char
     <136>   DW_AT_data_member_location: (data1) 64
  <2><137>: Abbrev Number: 10 (DW_TAG_member)
-    <138>   DW_AT_name        : (strp) (offset: 0x1e4e): _IO_save_base
+    <138>   DW_AT_name        : (strp) (offset: 0x1e25): _IO_save_base
     <13c>   DW_AT_decl_file   : (data1) 7
     <13d>   DW_AT_decl_line   : (data2) 261
     <13f>   DW_AT_decl_column : (data1) 9
     <140>   DW_AT_type        : (ref4) <0x93>, char
     <144>   DW_AT_data_member_location: (data1) 72
  <2><145>: Abbrev Number: 10 (DW_TAG_member)
     <146>   DW_AT_name        : (strp) (offset: 0x4688): _IO_backup_base
@@ -181,22 +181,22 @@
     <162>   DW_AT_name        : (strp) (offset: 0x3dfa): _markers
     <166>   DW_AT_decl_file   : (data1) 7
     <167>   DW_AT_decl_line   : (data2) 265
     <169>   DW_AT_decl_column : (data1) 22
     <16a>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <16e>   DW_AT_data_member_location: (data1) 96
  <2><16f>: Abbrev Number: 10 (DW_TAG_member)
-    <170>   DW_AT_name        : (strp) (offset: 0x1338): _chain
+    <170>   DW_AT_name        : (strp) (offset: 0x130f): _chain
     <174>   DW_AT_decl_file   : (data1) 7
     <175>   DW_AT_decl_line   : (data2) 267
     <177>   DW_AT_decl_column : (data1) 20
     <178>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
     <17c>   DW_AT_data_member_location: (data1) 104
  <2><17d>: Abbrev Number: 10 (DW_TAG_member)
-    <17e>   DW_AT_name        : (strp) (offset: 0x11b): _fileno
+    <17e>   DW_AT_name        : (strp) (offset: 0xf2): _fileno
     <182>   DW_AT_decl_file   : (data1) 7
     <183>   DW_AT_decl_line   : (data2) 269
     <185>   DW_AT_decl_column : (data1) 7
     <186>   DW_AT_type        : (ref4) <0x5f>, int
     <18a>   DW_AT_data_member_location: (data1) 112
  <2><18b>: Abbrev Number: 10 (DW_TAG_member)
     <18c>   DW_AT_name        : (strp) (offset: 0x49e6): _flags2
@@ -223,22 +223,22 @@
     <1b6>   DW_AT_name        : (strp) (offset: 0x4fd6): _vtable_offset
     <1ba>   DW_AT_decl_file   : (data1) 7
     <1bb>   DW_AT_decl_line   : (data2) 280
     <1bd>   DW_AT_decl_column : (data1) 15
     <1be>   DW_AT_type        : (ref4) <0x51>, signed char
     <1c2>   DW_AT_data_member_location: (data1) 130
  <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
-    <1c4>   DW_AT_name        : (strp) (offset: 0x429): _shortbuf
+    <1c4>   DW_AT_name        : (strp) (offset: 0x400): _shortbuf
     <1c8>   DW_AT_decl_file   : (data1) 7
     <1c9>   DW_AT_decl_line   : (data2) 281
     <1cb>   DW_AT_decl_column : (data1) 8
     <1cc>   DW_AT_type        : (ref4) <0x299>, char
     <1d0>   DW_AT_data_member_location: (data1) 131
  <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
-    <1d2>   DW_AT_name        : (strp) (offset: 0x736): _lock
+    <1d2>   DW_AT_name        : (strp) (offset: 0x70d): _lock
     <1d6>   DW_AT_decl_file   : (data1) 7
     <1d7>   DW_AT_decl_line   : (data2) 285
     <1d9>   DW_AT_decl_column : (data1) 15
     <1da>   DW_AT_type        : (ref4) <0x2a9>, _IO_lock_t
     <1de>   DW_AT_data_member_location: (data1) 136
  <2><1df>: Abbrev Number: 10 (DW_TAG_member)
     <1e0>   DW_AT_name        : (strp) (offset: 0x491d): _offset
@@ -251,15 +251,15 @@
     <1ee>   DW_AT_name        : (strp) (offset: 0x3d5c): __pad1
     <1f2>   DW_AT_decl_file   : (data1) 7
     <1f3>   DW_AT_decl_line   : (data2) 303
     <1f5>   DW_AT_decl_column : (data1) 9
     <1f6>   DW_AT_type        : (ref4) <0x85>
     <1fa>   DW_AT_data_member_location: (data1) 152
  <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
-    <1fc>   DW_AT_name        : (strp) (offset: 0x1ff5): __pad2
+    <1fc>   DW_AT_name        : (strp) (offset: 0x1fcc): __pad2
     <200>   DW_AT_decl_file   : (data1) 7
     <201>   DW_AT_decl_line   : (data2) 304
     <203>   DW_AT_decl_column : (data1) 9
     <204>   DW_AT_type        : (ref4) <0x85>
     <208>   DW_AT_data_member_location: (data1) 160
  <2><209>: Abbrev Number: 10 (DW_TAG_member)
     <20a>   DW_AT_name        : (strp) (offset: 0x3d63): __pad3
@@ -294,27 +294,27 @@
     <246>   DW_AT_decl_file   : (data1) 7
     <247>   DW_AT_decl_line   : (data2) 311
     <249>   DW_AT_decl_column : (data1) 8
     <24a>   DW_AT_type        : (ref4) <0x2af>, char
     <24e>   DW_AT_data_member_location: (data1) 196
  <2><24f>: Abbrev Number: 0
  <1><250>: Abbrev Number: 11 (DW_TAG_typedef)
-    <251>   DW_AT_name        : (strp) (offset: 0x1483): _IO_lock_t
+    <251>   DW_AT_name        : (strp) (offset: 0x145a): _IO_lock_t
     <255>   DW_AT_decl_file   : (data1) 7
     <256>   DW_AT_decl_line   : (data1) 155
     <257>   DW_AT_decl_column : (data1) 14
  <1><258>: Abbrev Number: 8 (DW_TAG_structure_type)
     <259>   DW_AT_name        : (strp) (offset: 0x3177): _IO_marker
     <25d>   DW_AT_byte_size   : (data1) 24
     <25e>   DW_AT_decl_file   : (data1) 7
     <25f>   DW_AT_decl_line   : (data1) 161
     <260>   DW_AT_decl_column : (data1) 8
     <261>   DW_AT_sibling     : (ref4) <0x28d>
  <2><265>: Abbrev Number: 9 (DW_TAG_member)
-    <266>   DW_AT_name        : (strp) (offset: 0x2144): _next
+    <266>   DW_AT_name        : (strp) (offset: 0x211b): _next
     <26a>   DW_AT_decl_file   : (data1) 7
     <26b>   DW_AT_decl_line   : (data1) 162
     <26c>   DW_AT_decl_column : (data1) 22
     <26d>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <271>   DW_AT_data_member_location: (data1) 0
  <2><272>: Abbrev Number: 9 (DW_TAG_member)
     <273>   DW_AT_name        : (strp) (offset: 0x2824): _sbuf
@@ -354,15 +354,15 @@
     <2b9>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <2bd>   DW_AT_upper_bound : (data1) 19
  <2><2be>: Abbrev Number: 0
  <1><2bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <2c0>   DW_AT_byte_size   : (data1) 8
     <2c1>   DW_AT_type        : (ref4) <0xa0>, char
  <1><2c5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2c6>   DW_AT_name        : (strp) (offset: 0x23aa): ssize_t
+    <2c6>   DW_AT_name        : (strp) (offset: 0x2381): ssize_t
     <2ca>   DW_AT_decl_file   : (data1) 6
     <2cb>   DW_AT_decl_line   : (data1) 102
     <2cc>   DW_AT_decl_column : (data1) 19
     <2cd>   DW_AT_type        : (ref4) <0x87>, __ssize_t, long int
  <1><2d1>: Abbrev Number: 14 (DW_TAG_typedef)
     <2d2>   DW_AT_name        : (strp) (offset: 0x2cfd): wchar_t
     <2d6>   DW_AT_decl_file   : (data1) 4
@@ -376,61 +376,61 @@
  <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
     <2e6>   DW_AT_name        : (strp) (offset: 0x33c4): int32_t
     <2ea>   DW_AT_decl_file   : (data1) 8
     <2eb>   DW_AT_decl_line   : (data1) 196
     <2ec>   DW_AT_decl_column : (data1) 1
     <2ed>   DW_AT_type        : (ref4) <0x5f>, int
  <1><2f1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2f2>   DW_AT_name        : (strp) (offset: 0x16c7): int64_t
+    <2f2>   DW_AT_name        : (strp) (offset: 0x169e): int64_t
     <2f6>   DW_AT_decl_file   : (data1) 8
     <2f7>   DW_AT_decl_line   : (data1) 197
     <2f8>   DW_AT_decl_column : (data1) 1
     <2f9>   DW_AT_type        : (ref4) <0x66>, long int
  <1><2fd>: Abbrev Number: 3 (DW_TAG_base_type)
     <2fe>   DW_AT_byte_size   : (data1) 8
     <2ff>   DW_AT_encoding    : (data1) 7	(unsigned)
     <300>   DW_AT_name        : (strp) (offset: 0x4409): long long unsigned int
  <1><304>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <305>   DW_AT_byte_size   : (data1) 8
     <306>   DW_AT_type        : (ref4) <0x30a>
  <1><30a>: Abbrev Number: 15 (DW_TAG_const_type)
  <1><30b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <30c>   DW_AT_name        : (strp) (offset: 0x1c73): uint8_t
+    <30c>   DW_AT_name        : (strp) (offset: 0x1c4a): uint8_t
     <310>   DW_AT_decl_file   : (data1) 9
     <311>   DW_AT_decl_line   : (data1) 48
     <312>   DW_AT_decl_column : (data1) 24
     <313>   DW_AT_type        : (ref4) <0x3c>, unsigned char
  <1><317>: Abbrev Number: 2 (DW_TAG_typedef)
-    <318>   DW_AT_name        : (strp) (offset: 0x55f): uint16_t
+    <318>   DW_AT_name        : (strp) (offset: 0x536): uint16_t
     <31c>   DW_AT_decl_file   : (data1) 9
     <31d>   DW_AT_decl_line   : (data1) 49
     <31e>   DW_AT_decl_column : (data1) 28
     <31f>   DW_AT_type        : (ref4) <0x43>, short unsigned int
  <1><323>: Abbrev Number: 2 (DW_TAG_typedef)
     <324>   DW_AT_name        : (strp) (offset: 0x33c3): uint32_t
     <328>   DW_AT_decl_file   : (data1) 9
     <329>   DW_AT_decl_line   : (data1) 51
     <32a>   DW_AT_decl_column : (data1) 23
     <32b>   DW_AT_type        : (ref4) <0x4a>, unsigned int
  <1><32f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <330>   DW_AT_name        : (strp) (offset: 0x16c6): uint64_t
+    <330>   DW_AT_name        : (strp) (offset: 0x169d): uint64_t
     <334>   DW_AT_decl_file   : (data1) 9
     <335>   DW_AT_decl_line   : (data1) 55
     <336>   DW_AT_decl_column : (data1) 27
     <337>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><33b>: Abbrev Number: 2 (DW_TAG_typedef)
     <33c>   DW_AT_name        : (strp) (offset: 0x490e): Py_ssize_t
     <340>   DW_AT_decl_file   : (data1) 10
     <341>   DW_AT_decl_line   : (data1) 105
     <342>   DW_AT_decl_column : (data1) 25
     <343>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
  <1><347>: Abbrev Number: 7 (DW_TAG_const_type)
     <348>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><34c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <34d>   DW_AT_name        : (strp) (offset: 0x2115): Py_hash_t
+    <34d>   DW_AT_name        : (strp) (offset: 0x20ec): Py_hash_t
     <351>   DW_AT_decl_file   : (data1) 10
     <352>   DW_AT_decl_line   : (data1) 114
     <353>   DW_AT_decl_column : (data1) 20
     <354>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><358>: Abbrev Number: 3 (DW_TAG_base_type)
     <359>   DW_AT_byte_size   : (data1) 4
     <35a>   DW_AT_encoding    : (data1) 4	(float)
@@ -463,44 +463,44 @@
  <2><38d>: Abbrev Number: 0
  <1><38e>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <38f>   DW_AT_byte_size   : (data1) 8
     <390>   DW_AT_type        : (ref4) <0x366>, timezone
  <1><394>: Abbrev Number: 16 (DW_TAG_restrict_type)
     <395>   DW_AT_type        : (ref4) <0x38e>, timezone
  <1><399>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <39a>   DW_AT_name        : (strp) (offset: 0x105e): _object
+    <39a>   DW_AT_name        : (strp) (offset: 0x1061): _object
     <39e>   DW_AT_byte_size   : (data1) 16
     <39f>   DW_AT_decl_file   : (data1) 2
     <3a0>   DW_AT_decl_line   : (data1) 104
     <3a1>   DW_AT_decl_column : (data1) 16
     <3a2>   DW_AT_sibling     : (ref4) <0x3c1>
  <2><3a6>: Abbrev Number: 9 (DW_TAG_member)
-    <3a7>   DW_AT_name        : (strp) (offset: 0x2b3): ob_refcnt
+    <3a7>   DW_AT_name        : (strp) (offset: 0x28a): ob_refcnt
     <3ab>   DW_AT_decl_file   : (data1) 2
     <3ac>   DW_AT_decl_line   : (data1) 106
     <3ad>   DW_AT_decl_column : (data1) 16
     <3ae>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3b2>   DW_AT_data_member_location: (data1) 0
  <2><3b3>: Abbrev Number: 9 (DW_TAG_member)
-    <3b4>   DW_AT_name        : (strp) (offset: 0xcf9): ob_type
+    <3b4>   DW_AT_name        : (strp) (offset: 0xcfc): ob_type
     <3b8>   DW_AT_decl_file   : (data1) 2
     <3b9>   DW_AT_decl_line   : (data1) 107
     <3ba>   DW_AT_decl_column : (data1) 25
     <3bb>   DW_AT_type        : (ref4) <0x671>, _typeobject
     <3bf>   DW_AT_data_member_location: (data1) 8
  <2><3c0>: Abbrev Number: 0
  <1><3c1>: Abbrev Number: 17 (DW_TAG_structure_type)
-    <3c2>   DW_AT_name        : (strp) (offset: 0x7fc): _typeobject
+    <3c2>   DW_AT_name        : (strp) (offset: 0x7d3): _typeobject
     <3c6>   DW_AT_byte_size   : (data2) 416
     <3c8>   DW_AT_decl_file   : (data1) 12
     <3c9>   DW_AT_decl_line   : (data1) 177
     <3ca>   DW_AT_decl_column : (data1) 16
     <3cb>   DW_AT_sibling     : (ref4) <0x671>
  <2><3cf>: Abbrev Number: 9 (DW_TAG_member)
-    <3d0>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <3d0>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <3d4>   DW_AT_decl_file   : (data1) 12
     <3d5>   DW_AT_decl_line   : (data1) 178
     <3d6>   DW_AT_decl_column : (data1) 5
     <3d7>   DW_AT_type        : (ref4) <0x6a7>, PyVarObject
     <3db>   DW_AT_data_member_location: (data1) 0
  <2><3dc>: Abbrev Number: 9 (DW_TAG_member)
     <3dd>   DW_AT_name        : (strp) (offset: 0x290a): tp_name
@@ -513,50 +513,50 @@
     <3ea>   DW_AT_name        : (strp) (offset: 0x500f): tp_basicsize
     <3ee>   DW_AT_decl_file   : (data1) 12
     <3ef>   DW_AT_decl_line   : (data1) 180
     <3f0>   DW_AT_decl_column : (data1) 16
     <3f1>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3f5>   DW_AT_data_member_location: (data1) 32
  <2><3f6>: Abbrev Number: 9 (DW_TAG_member)
-    <3f7>   DW_AT_name        : (strp) (offset: 0x4f4): tp_itemsize
+    <3f7>   DW_AT_name        : (strp) (offset: 0x4cb): tp_itemsize
     <3fb>   DW_AT_decl_file   : (data1) 12
     <3fc>   DW_AT_decl_line   : (data1) 180
     <3fd>   DW_AT_decl_column : (data1) 30
     <3fe>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <402>   DW_AT_data_member_location: (data1) 40
  <2><403>: Abbrev Number: 9 (DW_TAG_member)
-    <404>   DW_AT_name        : (strp) (offset: 0x7a9): tp_dealloc
+    <404>   DW_AT_name        : (strp) (offset: 0x780): tp_dealloc
     <408>   DW_AT_decl_file   : (data1) 12
     <409>   DW_AT_decl_line   : (data1) 184
     <40a>   DW_AT_decl_column : (data1) 16
     <40b>   DW_AT_type        : (ref4) <0x882>, destructor
     <40f>   DW_AT_data_member_location: (data1) 48
  <2><410>: Abbrev Number: 9 (DW_TAG_member)
     <411>   DW_AT_name        : (strp) (offset: 0x337e): tp_vectorcall_offset
     <415>   DW_AT_decl_file   : (data1) 12
     <416>   DW_AT_decl_line   : (data1) 185
     <417>   DW_AT_decl_column : (data1) 16
     <418>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <41c>   DW_AT_data_member_location: (data1) 56
  <2><41d>: Abbrev Number: 9 (DW_TAG_member)
-    <41e>   DW_AT_name        : (strp) (offset: 0x1f7): tp_getattr
+    <41e>   DW_AT_name        : (strp) (offset: 0x1ce): tp_getattr
     <422>   DW_AT_decl_file   : (data1) 12
     <423>   DW_AT_decl_line   : (data1) 186
     <424>   DW_AT_decl_column : (data1) 17
     <425>   DW_AT_type        : (ref4) <0x89f>, getattrfunc, PyObject, _object
     <429>   DW_AT_data_member_location: (data1) 64
  <2><42a>: Abbrev Number: 9 (DW_TAG_member)
-    <42b>   DW_AT_name        : (strp) (offset: 0x1381): tp_setattr
+    <42b>   DW_AT_name        : (strp) (offset: 0x1358): tp_setattr
     <42f>   DW_AT_decl_file   : (data1) 12
     <430>   DW_AT_decl_line   : (data1) 187
     <431>   DW_AT_decl_column : (data1) 17
     <432>   DW_AT_type        : (ref4) <0x8d1>, setattrfunc, int
     <436>   DW_AT_data_member_location: (data1) 72
  <2><437>: Abbrev Number: 9 (DW_TAG_member)
-    <438>   DW_AT_name        : (strp) (offset: 0x39a): tp_as_async
+    <438>   DW_AT_name        : (strp) (offset: 0x371): tp_as_async
     <43c>   DW_AT_decl_file   : (data1) 12
     <43d>   DW_AT_decl_line   : (data1) 188
     <43e>   DW_AT_decl_column : (data1) 21
     <43f>   DW_AT_type        : (ref4) <0xe7b>, PyAsyncMethods
     <443>   DW_AT_data_member_location: (data1) 80
  <2><444>: Abbrev Number: 9 (DW_TAG_member)
     <445>   DW_AT_name        : (strp) (offset: 0x48a2): tp_repr
@@ -576,36 +576,36 @@
     <45f>   DW_AT_name        : (strp) (offset: 0x2a2f): tp_as_sequence
     <463>   DW_AT_decl_file   : (data1) 12
     <464>   DW_AT_decl_line   : (data1) 195
     <465>   DW_AT_decl_column : (data1) 24
     <466>   DW_AT_type        : (ref4) <0xe87>, PySequenceMethods
     <46a>   DW_AT_data_member_location: (data1) 104
  <2><46b>: Abbrev Number: 9 (DW_TAG_member)
-    <46c>   DW_AT_name        : (strp) (offset: 0x195f): tp_as_mapping
+    <46c>   DW_AT_name        : (strp) (offset: 0x1936): tp_as_mapping
     <470>   DW_AT_decl_file   : (data1) 12
     <471>   DW_AT_decl_line   : (data1) 196
     <472>   DW_AT_decl_column : (data1) 23
     <473>   DW_AT_type        : (ref4) <0xe8d>, PyMappingMethods
     <477>   DW_AT_data_member_location: (data1) 112
  <2><478>: Abbrev Number: 9 (DW_TAG_member)
     <479>   DW_AT_name        : (strp) (offset: 0x3ba7): tp_hash
     <47d>   DW_AT_decl_file   : (data1) 12
     <47e>   DW_AT_decl_line   : (data1) 200
     <47f>   DW_AT_decl_column : (data1) 14
     <480>   DW_AT_type        : (ref4) <0x914>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <484>   DW_AT_data_member_location: (data1) 120
  <2><485>: Abbrev Number: 9 (DW_TAG_member)
-    <486>   DW_AT_name        : (strp) (offset: 0xf8d): tp_call
+    <486>   DW_AT_name        : (strp) (offset: 0xf90): tp_call
     <48a>   DW_AT_decl_file   : (data1) 12
     <48b>   DW_AT_decl_line   : (data1) 201
     <48c>   DW_AT_decl_column : (data1) 17
     <48d>   DW_AT_type        : (ref4) <0x705>, ternaryfunc, PyObject, _object
     <491>   DW_AT_data_member_location: (data1) 128
  <2><492>: Abbrev Number: 9 (DW_TAG_member)
-    <493>   DW_AT_name        : (strp) (offset: 0x108d): tp_str
+    <493>   DW_AT_name        : (strp) (offset: 0x1090): tp_str
     <497>   DW_AT_decl_file   : (data1) 12
     <498>   DW_AT_decl_line   : (data1) 202
     <499>   DW_AT_decl_column : (data1) 14
     <49a>   DW_AT_type        : (ref4) <0x908>, reprfunc, PyObject, _object
     <49e>   DW_AT_data_member_location: (data1) 136
  <2><49f>: Abbrev Number: 9 (DW_TAG_member)
     <4a0>   DW_AT_name        : (strp) (offset: 0x2dd6): tp_getattro
@@ -646,22 +646,22 @@
     <4e1>   DW_AT_name        : (strp) (offset: 0x3edd): tp_traverse
     <4e5>   DW_AT_decl_file   : (data1) 12
     <4e6>   DW_AT_decl_line   : (data1) 216
     <4e7>   DW_AT_decl_column : (data1) 18
     <4e8>   DW_AT_type        : (ref4) <0x83a>, traverseproc, int
     <4ec>   DW_AT_data_member_location: (data1) 184
  <2><4ed>: Abbrev Number: 9 (DW_TAG_member)
-    <4ee>   DW_AT_name        : (strp) (offset: 0x1631): tp_clear
+    <4ee>   DW_AT_name        : (strp) (offset: 0x1608): tp_clear
     <4f2>   DW_AT_decl_file   : (data1) 12
     <4f3>   DW_AT_decl_line   : (data1) 219
     <4f4>   DW_AT_decl_column : (data1) 13
     <4f5>   DW_AT_type        : (ref4) <0x730>, inquiry, int
     <4f9>   DW_AT_data_member_location: (data1) 192
  <2><4fa>: Abbrev Number: 9 (DW_TAG_member)
-    <4fb>   DW_AT_name        : (strp) (offset: 0xa54): tp_richcompare
+    <4fb>   DW_AT_name        : (strp) (offset: 0xa57): tp_richcompare
     <4ff>   DW_AT_decl_file   : (data1) 12
     <500>   DW_AT_decl_line   : (data1) 223
     <501>   DW_AT_decl_column : (data1) 17
     <502>   DW_AT_type        : (ref4) <0x935>, richcmpfunc, PyObject, _object
     <506>   DW_AT_data_member_location: (data1) 200
  <2><507>: Abbrev Number: 9 (DW_TAG_member)
     <508>   DW_AT_name        : (strp) (offset: 0x35a9): tp_weaklistoffset
@@ -709,15 +709,15 @@
     <556>   DW_AT_name        : (strp) (offset: 0x42bf): tp_base
     <55a>   DW_AT_decl_file   : (data1) 12
     <55b>   DW_AT_decl_line   : (data1) 236
     <55c>   DW_AT_decl_column : (data1) 25
     <55d>   DW_AT_type        : (ref4) <0x671>, _typeobject
     <561>   DW_AT_data_member_location: (data2) 256
  <2><563>: Abbrev Number: 18 (DW_TAG_member)
-    <564>   DW_AT_name        : (strp) (offset: 0x192d): tp_dict
+    <564>   DW_AT_name        : (strp) (offset: 0x1904): tp_dict
     <568>   DW_AT_decl_file   : (data1) 12
     <569>   DW_AT_decl_line   : (data1) 237
     <56a>   DW_AT_decl_column : (data1) 15
     <56b>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
     <56f>   DW_AT_data_member_location: (data2) 264
  <2><571>: Abbrev Number: 18 (DW_TAG_member)
     <572>   DW_AT_name        : (strp) (offset: 0x41b6): tp_descr_get
@@ -730,57 +730,57 @@
     <580>   DW_AT_name        : (strp) (offset: 0x4f31): tp_descr_set
     <584>   DW_AT_decl_file   : (data1) 12
     <585>   DW_AT_decl_line   : (data1) 239
     <586>   DW_AT_decl_column : (data1) 18
     <587>   DW_AT_type        : (ref4) <0x984>, descrsetfunc, int
     <58b>   DW_AT_data_member_location: (data2) 280
  <2><58d>: Abbrev Number: 18 (DW_TAG_member)
-    <58e>   DW_AT_name        : (strp) (offset: 0x14fb): tp_dictoffset
+    <58e>   DW_AT_name        : (strp) (offset: 0x14d2): tp_dictoffset
     <592>   DW_AT_decl_file   : (data1) 12
     <593>   DW_AT_decl_line   : (data1) 240
     <594>   DW_AT_decl_column : (data1) 16
     <595>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <599>   DW_AT_data_member_location: (data2) 288
  <2><59b>: Abbrev Number: 18 (DW_TAG_member)
-    <59c>   DW_AT_name        : (strp) (offset: 0x184a): tp_init
+    <59c>   DW_AT_name        : (strp) (offset: 0x1821): tp_init
     <5a0>   DW_AT_decl_file   : (data1) 12
     <5a1>   DW_AT_decl_line   : (data1) 241
     <5a2>   DW_AT_decl_column : (data1) 14
     <5a3>   DW_AT_type        : (ref4) <0x990>, initproc, int
     <5a7>   DW_AT_data_member_location: (data2) 296
  <2><5a9>: Abbrev Number: 18 (DW_TAG_member)
     <5aa>   DW_AT_name        : (strp) (offset: 0x2c11): tp_alloc
     <5ae>   DW_AT_decl_file   : (data1) 12
     <5af>   DW_AT_decl_line   : (data1) 242
     <5b0>   DW_AT_decl_column : (data1) 15
     <5b1>   DW_AT_type        : (ref4) <0x9c7>, allocfunc, PyObject, _object
     <5b5>   DW_AT_data_member_location: (data2) 304
  <2><5b7>: Abbrev Number: 18 (DW_TAG_member)
-    <5b8>   DW_AT_name        : (strp) (offset: 0x2648): tp_new
+    <5b8>   DW_AT_name        : (strp) (offset: 0x261f): tp_new
     <5bc>   DW_AT_decl_file   : (data1) 12
     <5bd>   DW_AT_decl_line   : (data1) 243
     <5be>   DW_AT_decl_column : (data1) 13
     <5bf>   DW_AT_type        : (ref4) <0x99c>, newfunc, PyObject, _object
     <5c3>   DW_AT_data_member_location: (data2) 312
  <2><5c5>: Abbrev Number: 18 (DW_TAG_member)
-    <5c6>   DW_AT_name        : (strp) (offset: 0xd5e): tp_free
+    <5c6>   DW_AT_name        : (strp) (offset: 0xd61): tp_free
     <5ca>   DW_AT_decl_file   : (data1) 12
     <5cb>   DW_AT_decl_line   : (data1) 244
     <5cc>   DW_AT_decl_column : (data1) 14
     <5cd>   DW_AT_type        : (ref4) <0x865>, freefunc
     <5d1>   DW_AT_data_member_location: (data2) 320
  <2><5d3>: Abbrev Number: 18 (DW_TAG_member)
-    <5d4>   DW_AT_name        : (strp) (offset: 0x411): tp_is_gc
+    <5d4>   DW_AT_name        : (strp) (offset: 0x3e8): tp_is_gc
     <5d8>   DW_AT_decl_file   : (data1) 12
     <5d9>   DW_AT_decl_line   : (data1) 245
     <5da>   DW_AT_decl_column : (data1) 13
     <5db>   DW_AT_type        : (ref4) <0x730>, inquiry, int
     <5df>   DW_AT_data_member_location: (data2) 328
  <2><5e1>: Abbrev Number: 18 (DW_TAG_member)
-    <5e2>   DW_AT_name        : (strp) (offset: 0x5f9): tp_bases
+    <5e2>   DW_AT_name        : (strp) (offset: 0x5d0): tp_bases
     <5e6>   DW_AT_decl_file   : (data1) 12
     <5e7>   DW_AT_decl_line   : (data1) 246
     <5e8>   DW_AT_decl_column : (data1) 15
     <5e9>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
     <5ed>   DW_AT_data_member_location: (data2) 336
  <2><5ef>: Abbrev Number: 18 (DW_TAG_member)
     <5f0>   DW_AT_name        : (strp) (offset: 0x2f1c): tp_mro
@@ -821,15 +821,15 @@
     <636>   DW_AT_name        : (strp) (offset: 0x3cf6): tp_version_tag
     <63a>   DW_AT_decl_file   : (data1) 12
     <63b>   DW_AT_decl_line   : (data1) 254
     <63c>   DW_AT_decl_column : (data1) 18
     <63d>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <641>   DW_AT_data_member_location: (data2) 384
  <2><643>: Abbrev Number: 19 (DW_TAG_member)
-    <644>   DW_AT_name        : (strp) (offset: 0x156b): tp_finalize
+    <644>   DW_AT_name        : (strp) (offset: 0x1542): tp_finalize
     <648>   DW_AT_decl_file   : (data1) 12
     <649>   DW_AT_decl_line   : (data2) 256
     <64b>   DW_AT_decl_column : (data1) 16
     <64c>   DW_AT_type        : (ref4) <0x882>, destructor
     <650>   DW_AT_data_member_location: (data2) 392
  <2><652>: Abbrev Number: 19 (DW_TAG_member)
     <653>   DW_AT_name        : (strp) (offset: 0x3c9e): tp_vectorcall
@@ -846,42 +846,42 @@
     <66a>   DW_AT_type        : (ref4) <0xfaa>, int
     <66e>   DW_AT_data_member_location: (data2) 408
  <2><670>: Abbrev Number: 0
  <1><671>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <672>   DW_AT_byte_size   : (data1) 8
     <673>   DW_AT_type        : (ref4) <0x3c1>, _typeobject
  <1><677>: Abbrev Number: 2 (DW_TAG_typedef)
-    <678>   DW_AT_name        : (strp) (offset: 0x214a): PyObject
+    <678>   DW_AT_name        : (strp) (offset: 0x2121): PyObject
     <67c>   DW_AT_decl_file   : (data1) 2
     <67d>   DW_AT_decl_line   : (data1) 108
     <67e>   DW_AT_decl_column : (data1) 3
     <67f>   DW_AT_type        : (ref4) <0x399>, _object
  <1><683>: Abbrev Number: 20 (DW_TAG_structure_type)
     <684>   DW_AT_byte_size   : (data1) 24
     <685>   DW_AT_decl_file   : (data1) 2
     <686>   DW_AT_decl_line   : (data1) 113
     <687>   DW_AT_decl_column : (data1) 9
     <688>   DW_AT_sibling     : (ref4) <0x6a7>
  <2><68c>: Abbrev Number: 9 (DW_TAG_member)
-    <68d>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <68d>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <691>   DW_AT_decl_file   : (data1) 2
     <692>   DW_AT_decl_line   : (data1) 114
     <693>   DW_AT_decl_column : (data1) 14
     <694>   DW_AT_type        : (ref4) <0x677>, PyObject, _object
     <698>   DW_AT_data_member_location: (data1) 0
  <2><699>: Abbrev Number: 9 (DW_TAG_member)
-    <69a>   DW_AT_name        : (strp) (offset: 0x1877): ob_size
+    <69a>   DW_AT_name        : (strp) (offset: 0x184e): ob_size
     <69e>   DW_AT_decl_file   : (data1) 2
     <69f>   DW_AT_decl_line   : (data1) 115
     <6a0>   DW_AT_decl_column : (data1) 16
     <6a1>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <6a5>   DW_AT_data_member_location: (data1) 16
  <2><6a6>: Abbrev Number: 0
  <1><6a7>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6a8>   DW_AT_name        : (strp) (offset: 0xdde): PyVarObject
+    <6a8>   DW_AT_name        : (strp) (offset: 0xde1): PyVarObject
     <6ac>   DW_AT_decl_file   : (data1) 2
     <6ad>   DW_AT_decl_line   : (data1) 116
     <6ae>   DW_AT_decl_column : (data1) 3
     <6af>   DW_AT_type        : (ref4) <0x683>
  <1><6b3>: Abbrev Number: 2 (DW_TAG_typedef)
     <6b4>   DW_AT_name        : (strp) (offset: 0x316d): unaryfunc
     <6b8>   DW_AT_decl_file   : (data1) 2
@@ -900,15 +900,15 @@
  <2><6d3>: Abbrev Number: 0
  <1><6d4>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6d5>   DW_AT_byte_size   : (data1) 8
     <6d6>   DW_AT_type        : (ref4) <0x677>, PyObject, _object
  <1><6da>: Abbrev Number: 7 (DW_TAG_const_type)
     <6db>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <1><6df>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6e0>   DW_AT_name        : (strp) (offset: 0x1a54): binaryfunc
+    <6e0>   DW_AT_name        : (strp) (offset: 0x1a2b): binaryfunc
     <6e4>   DW_AT_decl_file   : (data1) 2
     <6e5>   DW_AT_decl_line   : (data1) 141
     <6e6>   DW_AT_decl_column : (data1) 22
     <6e7>   DW_AT_type        : (ref4) <0x6eb>, PyObject, _object
  <1><6eb>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6ec>   DW_AT_byte_size   : (data1) 8
     <6ed>   DW_AT_type        : (ref4) <0x6f1>, PyObject, _object
@@ -918,15 +918,15 @@
     <6f6>   DW_AT_sibling     : (ref4) <0x705>
  <2><6fa>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <6fb>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><6ff>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <700>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><704>: Abbrev Number: 0
  <1><705>: Abbrev Number: 2 (DW_TAG_typedef)
-    <706>   DW_AT_name        : (strp) (offset: 0x1143): ternaryfunc
+    <706>   DW_AT_name        : (strp) (offset: 0x1146): ternaryfunc
     <70a>   DW_AT_decl_file   : (data1) 2
     <70b>   DW_AT_decl_line   : (data1) 142
     <70c>   DW_AT_decl_column : (data1) 22
     <70d>   DW_AT_type        : (ref4) <0x711>, PyObject, _object
  <1><711>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <712>   DW_AT_byte_size   : (data1) 8
     <713>   DW_AT_type        : (ref4) <0x717>, PyObject, _object
@@ -954,15 +954,15 @@
     <743>   DW_AT_prototyped  : (flag_present) 1
     <743>   DW_AT_type        : (ref4) <0x5f>, int
     <747>   DW_AT_sibling     : (ref4) <0x751>
  <2><74b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <74c>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><750>: Abbrev Number: 0
  <1><751>: Abbrev Number: 2 (DW_TAG_typedef)
-    <752>   DW_AT_name        : (strp) (offset: 0x12b): lenfunc
+    <752>   DW_AT_name        : (strp) (offset: 0x102): lenfunc
     <756>   DW_AT_decl_file   : (data1) 2
     <757>   DW_AT_decl_line   : (data1) 144
     <758>   DW_AT_decl_column : (data1) 22
     <759>   DW_AT_type        : (ref4) <0x75d>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><75d>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <75e>   DW_AT_byte_size   : (data1) 8
     <75f>   DW_AT_type        : (ref4) <0x763>, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -970,15 +970,15 @@
     <764>   DW_AT_prototyped  : (flag_present) 1
     <764>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <768>   DW_AT_sibling     : (ref4) <0x772>
  <2><76c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <76d>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><771>: Abbrev Number: 0
  <1><772>: Abbrev Number: 2 (DW_TAG_typedef)
-    <773>   DW_AT_name        : (strp) (offset: 0x1c22): ssizeargfunc
+    <773>   DW_AT_name        : (strp) (offset: 0x1bf9): ssizeargfunc
     <777>   DW_AT_decl_file   : (data1) 2
     <778>   DW_AT_decl_line   : (data1) 145
     <779>   DW_AT_decl_column : (data1) 21
     <77a>   DW_AT_type        : (ref4) <0x77e>, PyObject, _object
  <1><77e>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <77f>   DW_AT_byte_size   : (data1) 8
     <780>   DW_AT_type        : (ref4) <0x784>, PyObject, _object
@@ -1008,15 +1008,15 @@
     <7b4>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><7b8>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <7b9>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7bd>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <7be>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><7c2>: Abbrev Number: 0
  <1><7c3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7c4>   DW_AT_name        : (strp) (offset: 0x1869): objobjargproc
+    <7c4>   DW_AT_name        : (strp) (offset: 0x1840): objobjargproc
     <7c8>   DW_AT_decl_file   : (data1) 2
     <7c9>   DW_AT_decl_line   : (data1) 149
     <7ca>   DW_AT_decl_column : (data1) 14
     <7cb>   DW_AT_type        : (ref4) <0x7cf>, int
  <1><7cf>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7d0>   DW_AT_byte_size   : (data1) 8
     <7d1>   DW_AT_type        : (ref4) <0x7d5>, int
@@ -1046,15 +1046,15 @@
     <805>   DW_AT_sibling     : (ref4) <0x814>
  <2><809>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <80a>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><80e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <80f>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><813>: Abbrev Number: 0
  <1><814>: Abbrev Number: 2 (DW_TAG_typedef)
-    <815>   DW_AT_name        : (strp) (offset: 0xb4f): visitproc
+    <815>   DW_AT_name        : (strp) (offset: 0xb52): visitproc
     <819>   DW_AT_decl_file   : (data1) 2
     <81a>   DW_AT_decl_line   : (data1) 152
     <81b>   DW_AT_decl_column : (data1) 15
     <81c>   DW_AT_type        : (ref4) <0x820>, int
  <1><820>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <821>   DW_AT_byte_size   : (data1) 8
     <822>   DW_AT_type        : (ref4) <0x826>, int
@@ -1099,15 +1099,15 @@
  <1><877>: Abbrev Number: 23 (DW_TAG_subroutine_type)
     <878>   DW_AT_prototyped  : (flag_present) 1
     <878>   DW_AT_sibling     : (ref4) <0x882>
  <2><87c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <87d>   DW_AT_type        : (ref4) <0x85>
  <2><881>: Abbrev Number: 0
  <1><882>: Abbrev Number: 2 (DW_TAG_typedef)
-    <883>   DW_AT_name        : (strp) (offset: 0x2794): destructor
+    <883>   DW_AT_name        : (strp) (offset: 0x276b): destructor
     <887>   DW_AT_decl_file   : (data1) 2
     <888>   DW_AT_decl_line   : (data1) 157
     <889>   DW_AT_decl_column : (data1) 16
     <88a>   DW_AT_type        : (ref4) <0x88e>
  <1><88e>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <88f>   DW_AT_byte_size   : (data1) 8
     <890>   DW_AT_type        : (ref4) <0x894>
@@ -1138,15 +1138,15 @@
  <1><8c5>: Abbrev Number: 2 (DW_TAG_typedef)
     <8c6>   DW_AT_name        : (strp) (offset: 0x36df): getattrofunc
     <8ca>   DW_AT_decl_file   : (data1) 2
     <8cb>   DW_AT_decl_line   : (data1) 159
     <8cc>   DW_AT_decl_column : (data1) 21
     <8cd>   DW_AT_type        : (ref4) <0x6eb>, PyObject, _object
  <1><8d1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8d2>   DW_AT_name        : (strp) (offset: 0x1974): setattrfunc
+    <8d2>   DW_AT_name        : (strp) (offset: 0x194b): setattrfunc
     <8d6>   DW_AT_decl_file   : (data1) 2
     <8d7>   DW_AT_decl_line   : (data1) 160
     <8d8>   DW_AT_decl_column : (data1) 15
     <8d9>   DW_AT_type        : (ref4) <0x8dd>, int
  <1><8dd>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <8de>   DW_AT_byte_size   : (data1) 8
     <8df>   DW_AT_type        : (ref4) <0x8e3>, int
@@ -1158,21 +1158,21 @@
     <8ed>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><8f1>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <8f2>   DW_AT_type        : (ref4) <0x93>, char
  <2><8f6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <8f7>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><8fb>: Abbrev Number: 0
  <1><8fc>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8fd>   DW_AT_name        : (strp) (offset: 0x755): setattrofunc
+    <8fd>   DW_AT_name        : (strp) (offset: 0x72c): setattrofunc
     <901>   DW_AT_decl_file   : (data1) 2
     <902>   DW_AT_decl_line   : (data1) 161
     <903>   DW_AT_decl_column : (data1) 15
     <904>   DW_AT_type        : (ref4) <0x7cf>, int
  <1><908>: Abbrev Number: 2 (DW_TAG_typedef)
-    <909>   DW_AT_name        : (strp) (offset: 0x1f0b): reprfunc
+    <909>   DW_AT_name        : (strp) (offset: 0x1ee2): reprfunc
     <90d>   DW_AT_decl_file   : (data1) 2
     <90e>   DW_AT_decl_line   : (data1) 162
     <90f>   DW_AT_decl_column : (data1) 21
     <910>   DW_AT_type        : (ref4) <0x6bf>, PyObject, _object
  <1><914>: Abbrev Number: 2 (DW_TAG_typedef)
     <915>   DW_AT_name        : (strp) (offset: 0x393e): hashfunc
     <919>   DW_AT_decl_file   : (data1) 2
@@ -1186,15 +1186,15 @@
     <927>   DW_AT_prototyped  : (flag_present) 1
     <927>   DW_AT_type        : (ref4) <0x34c>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <92b>   DW_AT_sibling     : (ref4) <0x935>
  <2><92f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <930>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><934>: Abbrev Number: 0
  <1><935>: Abbrev Number: 2 (DW_TAG_typedef)
-    <936>   DW_AT_name        : (strp) (offset: 0x1406): richcmpfunc
+    <936>   DW_AT_name        : (strp) (offset: 0x13dd): richcmpfunc
     <93a>   DW_AT_decl_file   : (data1) 2
     <93b>   DW_AT_decl_line   : (data1) 164
     <93c>   DW_AT_decl_column : (data1) 21
     <93d>   DW_AT_type        : (ref4) <0x941>, PyObject, _object
  <1><941>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <942>   DW_AT_byte_size   : (data1) 8
     <943>   DW_AT_type        : (ref4) <0x947>, PyObject, _object
@@ -1206,39 +1206,39 @@
     <951>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><955>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <956>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><95a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <95b>   DW_AT_type        : (ref4) <0x5f>, int
  <2><95f>: Abbrev Number: 0
  <1><960>: Abbrev Number: 2 (DW_TAG_typedef)
-    <961>   DW_AT_name        : (strp) (offset: 0x1bd4): getiterfunc
+    <961>   DW_AT_name        : (strp) (offset: 0x1bab): getiterfunc
     <965>   DW_AT_decl_file   : (data1) 2
     <966>   DW_AT_decl_line   : (data1) 165
     <967>   DW_AT_decl_column : (data1) 21
     <968>   DW_AT_type        : (ref4) <0x6bf>, PyObject, _object
  <1><96c>: Abbrev Number: 2 (DW_TAG_typedef)
     <96d>   DW_AT_name        : (strp) (offset: 0x4e87): iternextfunc
     <971>   DW_AT_decl_file   : (data1) 2
     <972>   DW_AT_decl_line   : (data1) 166
     <973>   DW_AT_decl_column : (data1) 21
     <974>   DW_AT_type        : (ref4) <0x6bf>, PyObject, _object
  <1><978>: Abbrev Number: 2 (DW_TAG_typedef)
-    <979>   DW_AT_name        : (strp) (offset: 0x1cfb): descrgetfunc
+    <979>   DW_AT_name        : (strp) (offset: 0x1cd2): descrgetfunc
     <97d>   DW_AT_decl_file   : (data1) 2
     <97e>   DW_AT_decl_line   : (data1) 167
     <97f>   DW_AT_decl_column : (data1) 21
     <980>   DW_AT_type        : (ref4) <0x711>, PyObject, _object
  <1><984>: Abbrev Number: 2 (DW_TAG_typedef)
-    <985>   DW_AT_name        : (strp) (offset: 0x1c7b): descrsetfunc
+    <985>   DW_AT_name        : (strp) (offset: 0x1c52): descrsetfunc
     <989>   DW_AT_decl_file   : (data1) 2
     <98a>   DW_AT_decl_line   : (data1) 168
     <98b>   DW_AT_decl_column : (data1) 15
     <98c>   DW_AT_type        : (ref4) <0x7cf>, int
  <1><990>: Abbrev Number: 2 (DW_TAG_typedef)
-    <991>   DW_AT_name        : (strp) (offset: 0x568): initproc
+    <991>   DW_AT_name        : (strp) (offset: 0x53f): initproc
     <995>   DW_AT_decl_file   : (data1) 2
     <996>   DW_AT_decl_line   : (data1) 169
     <997>   DW_AT_decl_column : (data1) 15
     <998>   DW_AT_type        : (ref4) <0x7cf>, int
  <1><99c>: Abbrev Number: 2 (DW_TAG_typedef)
     <99d>   DW_AT_name        : (strp) (offset: 0x3936): newfunc
     <9a1>   DW_AT_decl_file   : (data1) 2
@@ -1282,15 +1282,15 @@
     <9f2>   DW_AT_decl_file   : (data1) 2
     <9f3>   DW_AT_decl_line   : (data1) 206
     <9f4>   DW_AT_decl_column : (data1) 32
     <9f5>   DW_AT_type        : (ref4) <0x3c1>, _typeobject
     <9f9>   DW_AT_external    : (flag_present) 1
     <9f9>   DW_AT_declaration : (flag_present) 1
  <1><9f9>: Abbrev Number: 24 (DW_TAG_variable)
-    <9fa>   DW_AT_name        : (strp) (offset: 0x30c): PyBaseObject_Type
+    <9fa>   DW_AT_name        : (strp) (offset: 0x2e3): PyBaseObject_Type
     <9fe>   DW_AT_decl_file   : (data1) 2
     <9ff>   DW_AT_decl_line   : (data1) 207
     <a00>   DW_AT_decl_column : (data1) 32
     <a01>   DW_AT_type        : (ref4) <0x3c1>, _typeobject
     <a05>   DW_AT_external    : (flag_present) 1
     <a05>   DW_AT_declaration : (flag_present) 1
  <1><a05>: Abbrev Number: 25 (DW_TAG_variable)
@@ -1326,15 +1326,15 @@
     <a3a>   DW_AT_name        : (string) len
     <a3e>   DW_AT_decl_file   : (data1) 12
     <a3f>   DW_AT_decl_line   : (data1) 43
     <a40>   DW_AT_decl_column : (data1) 16
     <a41>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a45>   DW_AT_data_member_location: (data1) 16
  <2><a46>: Abbrev Number: 9 (DW_TAG_member)
-    <a47>   DW_AT_name        : (strp) (offset: 0x4f7): itemsize
+    <a47>   DW_AT_name        : (strp) (offset: 0x4ce): itemsize
     <a4b>   DW_AT_decl_file   : (data1) 12
     <a4c>   DW_AT_decl_line   : (data1) 44
     <a4d>   DW_AT_decl_column : (data1) 16
     <a4e>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <a52>   DW_AT_data_member_location: (data1) 24
  <2><a53>: Abbrev Number: 9 (DW_TAG_member)
     <a54>   DW_AT_name        : (strp) (offset: 0x3672): readonly
@@ -1432,15 +1432,15 @@
     <b05>   DW_AT_sibling     : (ref4) <0xb14>
  <2><b09>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <b0a>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><b0e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <b0f>   DW_AT_type        : (ref4) <0xaec>, Py_buffer, bufferinfo
  <2><b13>: Abbrev Number: 0
  <1><b14>: Abbrev Number: 2 (DW_TAG_typedef)
-    <b15>   DW_AT_name        : (strp) (offset: 0x1ba4): vectorcallfunc
+    <b15>   DW_AT_name        : (strp) (offset: 0x1b7b): vectorcallfunc
     <b19>   DW_AT_decl_file   : (data1) 12
     <b1a>   DW_AT_decl_line   : (data1) 58
     <b1b>   DW_AT_decl_column : (data1) 21
     <b1c>   DW_AT_type        : (ref4) <0xb20>, PyObject, _object
  <1><b20>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <b21>   DW_AT_byte_size   : (data1) 8
     <b22>   DW_AT_type        : (ref4) <0xb26>, PyObject, _object
@@ -1463,15 +1463,15 @@
  <1><b4a>: Abbrev Number: 27 (DW_TAG_structure_type)
     <b4b>   DW_AT_byte_size   : (data2) 288
     <b4d>   DW_AT_decl_file   : (data1) 12
     <b4e>   DW_AT_decl_line   : (data1) 95
     <b4f>   DW_AT_decl_column : (data1) 9
     <b50>   DW_AT_sibling     : (ref4) <0xd2d>
  <2><b54>: Abbrev Number: 9 (DW_TAG_member)
-    <b55>   DW_AT_name        : (strp) (offset: 0x25a): nb_add
+    <b55>   DW_AT_name        : (strp) (offset: 0x231): nb_add
     <b59>   DW_AT_decl_file   : (data1) 12
     <b5a>   DW_AT_decl_line   : (data1) 100
     <b5b>   DW_AT_decl_column : (data1) 16
     <b5c>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <b60>   DW_AT_data_member_location: (data1) 0
  <2><b61>: Abbrev Number: 9 (DW_TAG_member)
     <b62>   DW_AT_name        : (strp) (offset: 0x4ca8): nb_subtract
@@ -1484,36 +1484,36 @@
     <b6f>   DW_AT_name        : (strp) (offset: 0x4071): nb_multiply
     <b73>   DW_AT_decl_file   : (data1) 12
     <b74>   DW_AT_decl_line   : (data1) 102
     <b75>   DW_AT_decl_column : (data1) 16
     <b76>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <b7a>   DW_AT_data_member_location: (data1) 16
  <2><b7b>: Abbrev Number: 9 (DW_TAG_member)
-    <b7c>   DW_AT_name        : (strp) (offset: 0xb01): nb_remainder
+    <b7c>   DW_AT_name        : (strp) (offset: 0xb04): nb_remainder
     <b80>   DW_AT_decl_file   : (data1) 12
     <b81>   DW_AT_decl_line   : (data1) 103
     <b82>   DW_AT_decl_column : (data1) 16
     <b83>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <b87>   DW_AT_data_member_location: (data1) 24
  <2><b88>: Abbrev Number: 9 (DW_TAG_member)
     <b89>   DW_AT_name        : (strp) (offset: 0x5077): nb_divmod
     <b8d>   DW_AT_decl_file   : (data1) 12
     <b8e>   DW_AT_decl_line   : (data1) 104
     <b8f>   DW_AT_decl_column : (data1) 16
     <b90>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <b94>   DW_AT_data_member_location: (data1) 32
  <2><b95>: Abbrev Number: 9 (DW_TAG_member)
-    <b96>   DW_AT_name        : (strp) (offset: 0x433): nb_power
+    <b96>   DW_AT_name        : (strp) (offset: 0x40a): nb_power
     <b9a>   DW_AT_decl_file   : (data1) 12
     <b9b>   DW_AT_decl_line   : (data1) 105
     <b9c>   DW_AT_decl_column : (data1) 17
     <b9d>   DW_AT_type        : (ref4) <0x705>, ternaryfunc, PyObject, _object
     <ba1>   DW_AT_data_member_location: (data1) 40
  <2><ba2>: Abbrev Number: 9 (DW_TAG_member)
-    <ba3>   DW_AT_name        : (strp) (offset: 0x2247): nb_negative
+    <ba3>   DW_AT_name        : (strp) (offset: 0x221e): nb_negative
     <ba7>   DW_AT_decl_file   : (data1) 12
     <ba8>   DW_AT_decl_line   : (data1) 106
     <ba9>   DW_AT_decl_column : (data1) 15
     <baa>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <bae>   DW_AT_data_member_location: (data1) 48
  <2><baf>: Abbrev Number: 9 (DW_TAG_member)
     <bb0>   DW_AT_name        : (strp) (offset: 0x49aa): nb_positive
@@ -1526,50 +1526,50 @@
     <bbd>   DW_AT_name        : (strp) (offset: 0x467c): nb_absolute
     <bc1>   DW_AT_decl_file   : (data1) 12
     <bc2>   DW_AT_decl_line   : (data1) 108
     <bc3>   DW_AT_decl_column : (data1) 15
     <bc4>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <bc8>   DW_AT_data_member_location: (data1) 64
  <2><bc9>: Abbrev Number: 9 (DW_TAG_member)
-    <bca>   DW_AT_name        : (strp) (offset: 0x1793): nb_bool
+    <bca>   DW_AT_name        : (strp) (offset: 0x176a): nb_bool
     <bce>   DW_AT_decl_file   : (data1) 12
     <bcf>   DW_AT_decl_line   : (data1) 109
     <bd0>   DW_AT_decl_column : (data1) 13
     <bd1>   DW_AT_type        : (ref4) <0x730>, inquiry, int
     <bd5>   DW_AT_data_member_location: (data1) 72
  <2><bd6>: Abbrev Number: 9 (DW_TAG_member)
     <bd7>   DW_AT_name        : (strp) (offset: 0x33cc): nb_invert
     <bdb>   DW_AT_decl_file   : (data1) 12
     <bdc>   DW_AT_decl_line   : (data1) 110
     <bdd>   DW_AT_decl_column : (data1) 15
     <bde>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <be2>   DW_AT_data_member_location: (data1) 80
  <2><be3>: Abbrev Number: 9 (DW_TAG_member)
-    <be4>   DW_AT_name        : (strp) (offset: 0x3ed): nb_lshift
+    <be4>   DW_AT_name        : (strp) (offset: 0x3c4): nb_lshift
     <be8>   DW_AT_decl_file   : (data1) 12
     <be9>   DW_AT_decl_line   : (data1) 111
     <bea>   DW_AT_decl_column : (data1) 16
     <beb>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <bef>   DW_AT_data_member_location: (data1) 88
  <2><bf0>: Abbrev Number: 9 (DW_TAG_member)
     <bf1>   DW_AT_name        : (strp) (offset: 0x42c7): nb_rshift
     <bf5>   DW_AT_decl_file   : (data1) 12
     <bf6>   DW_AT_decl_line   : (data1) 112
     <bf7>   DW_AT_decl_column : (data1) 16
     <bf8>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <bfc>   DW_AT_data_member_location: (data1) 96
  <2><bfd>: Abbrev Number: 9 (DW_TAG_member)
-    <bfe>   DW_AT_name        : (strp) (offset: 0xed2): nb_and
+    <bfe>   DW_AT_name        : (strp) (offset: 0xed5): nb_and
     <c02>   DW_AT_decl_file   : (data1) 12
     <c03>   DW_AT_decl_line   : (data1) 113
     <c04>   DW_AT_decl_column : (data1) 16
     <c05>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c09>   DW_AT_data_member_location: (data1) 104
  <2><c0a>: Abbrev Number: 9 (DW_TAG_member)
-    <c0b>   DW_AT_name        : (strp) (offset: 0x2175): nb_xor
+    <c0b>   DW_AT_name        : (strp) (offset: 0x214c): nb_xor
     <c0f>   DW_AT_decl_file   : (data1) 12
     <c10>   DW_AT_decl_line   : (data1) 114
     <c11>   DW_AT_decl_column : (data1) 16
     <c12>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c16>   DW_AT_data_member_location: (data1) 112
  <2><c17>: Abbrev Number: 9 (DW_TAG_member)
     <c18>   DW_AT_name        : (strp) (offset: 0x3115): nb_or
@@ -1582,43 +1582,43 @@
     <c25>   DW_AT_name        : (strp) (offset: 0x4ed4): nb_int
     <c29>   DW_AT_decl_file   : (data1) 12
     <c2a>   DW_AT_decl_line   : (data1) 116
     <c2b>   DW_AT_decl_column : (data1) 15
     <c2c>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <c30>   DW_AT_data_member_location: (data1) 128
  <2><c31>: Abbrev Number: 9 (DW_TAG_member)
-    <c32>   DW_AT_name        : (strp) (offset: 0x1d9a): nb_reserved
+    <c32>   DW_AT_name        : (strp) (offset: 0x1d71): nb_reserved
     <c36>   DW_AT_decl_file   : (data1) 12
     <c37>   DW_AT_decl_line   : (data1) 117
     <c38>   DW_AT_decl_column : (data1) 11
     <c39>   DW_AT_type        : (ref4) <0x85>
     <c3d>   DW_AT_data_member_location: (data1) 136
  <2><c3e>: Abbrev Number: 9 (DW_TAG_member)
     <c3f>   DW_AT_name        : (strp) (offset: 0x32ad): nb_float
     <c43>   DW_AT_decl_file   : (data1) 12
     <c44>   DW_AT_decl_line   : (data1) 118
     <c45>   DW_AT_decl_column : (data1) 15
     <c46>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <c4a>   DW_AT_data_member_location: (data1) 144
  <2><c4b>: Abbrev Number: 9 (DW_TAG_member)
-    <c4c>   DW_AT_name        : (strp) (offset: 0x1d62): nb_inplace_add
+    <c4c>   DW_AT_name        : (strp) (offset: 0x1d39): nb_inplace_add
     <c50>   DW_AT_decl_file   : (data1) 12
     <c51>   DW_AT_decl_line   : (data1) 120
     <c52>   DW_AT_decl_column : (data1) 16
     <c53>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c57>   DW_AT_data_member_location: (data1) 152
  <2><c58>: Abbrev Number: 9 (DW_TAG_member)
     <c59>   DW_AT_name        : (strp) (offset: 0x501c): nb_inplace_subtract
     <c5d>   DW_AT_decl_file   : (data1) 12
     <c5e>   DW_AT_decl_line   : (data1) 121
     <c5f>   DW_AT_decl_column : (data1) 16
     <c60>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c64>   DW_AT_data_member_location: (data1) 160
  <2><c65>: Abbrev Number: 9 (DW_TAG_member)
-    <c66>   DW_AT_name        : (strp) (offset: 0xbf8): nb_inplace_multiply
+    <c66>   DW_AT_name        : (strp) (offset: 0xbfb): nb_inplace_multiply
     <c6a>   DW_AT_decl_file   : (data1) 12
     <c6b>   DW_AT_decl_line   : (data1) 122
     <c6c>   DW_AT_decl_column : (data1) 16
     <c6d>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c71>   DW_AT_data_member_location: (data1) 168
  <2><c72>: Abbrev Number: 9 (DW_TAG_member)
     <c73>   DW_AT_name        : (strp) (offset: 0x44d1): nb_inplace_remainder
@@ -1631,15 +1631,15 @@
     <c80>   DW_AT_name        : (strp) (offset: 0x3fcb): nb_inplace_power
     <c84>   DW_AT_decl_file   : (data1) 12
     <c85>   DW_AT_decl_line   : (data1) 124
     <c86>   DW_AT_decl_column : (data1) 17
     <c87>   DW_AT_type        : (ref4) <0x705>, ternaryfunc, PyObject, _object
     <c8b>   DW_AT_data_member_location: (data1) 184
  <2><c8c>: Abbrev Number: 9 (DW_TAG_member)
-    <c8d>   DW_AT_name        : (strp) (offset: 0x891): nb_inplace_lshift
+    <c8d>   DW_AT_name        : (strp) (offset: 0x868): nb_inplace_lshift
     <c91>   DW_AT_decl_file   : (data1) 12
     <c92>   DW_AT_decl_line   : (data1) 125
     <c93>   DW_AT_decl_column : (data1) 16
     <c94>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <c98>   DW_AT_data_member_location: (data1) 192
  <2><c99>: Abbrev Number: 9 (DW_TAG_member)
     <c9a>   DW_AT_name        : (strp) (offset: 0x4925): nb_inplace_rshift
@@ -1666,15 +1666,15 @@
     <cc1>   DW_AT_name        : (strp) (offset: 0x47b9): nb_inplace_or
     <cc5>   DW_AT_decl_file   : (data1) 12
     <cc6>   DW_AT_decl_line   : (data1) 129
     <cc7>   DW_AT_decl_column : (data1) 16
     <cc8>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <ccc>   DW_AT_data_member_location: (data1) 224
  <2><ccd>: Abbrev Number: 9 (DW_TAG_member)
-    <cce>   DW_AT_name        : (strp) (offset: 0x821): nb_floor_divide
+    <cce>   DW_AT_name        : (strp) (offset: 0x7f8): nb_floor_divide
     <cd2>   DW_AT_decl_file   : (data1) 12
     <cd3>   DW_AT_decl_line   : (data1) 131
     <cd4>   DW_AT_decl_column : (data1) 16
     <cd5>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <cd9>   DW_AT_data_member_location: (data1) 232
  <2><cda>: Abbrev Number: 9 (DW_TAG_member)
     <cdb>   DW_AT_name        : (strp) (offset: 0x408e): nb_true_divide
@@ -1687,44 +1687,44 @@
     <ce8>   DW_AT_name        : (strp) (offset: 0x4218): nb_inplace_floor_divide
     <cec>   DW_AT_decl_file   : (data1) 12
     <ced>   DW_AT_decl_line   : (data1) 133
     <cee>   DW_AT_decl_column : (data1) 16
     <cef>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <cf3>   DW_AT_data_member_location: (data1) 248
  <2><cf4>: Abbrev Number: 18 (DW_TAG_member)
-    <cf5>   DW_AT_name        : (strp) (offset: 0x272e): nb_inplace_true_divide
+    <cf5>   DW_AT_name        : (strp) (offset: 0x2705): nb_inplace_true_divide
     <cf9>   DW_AT_decl_file   : (data1) 12
     <cfa>   DW_AT_decl_line   : (data1) 134
     <cfb>   DW_AT_decl_column : (data1) 16
     <cfc>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <d00>   DW_AT_data_member_location: (data2) 256
  <2><d02>: Abbrev Number: 18 (DW_TAG_member)
-    <d03>   DW_AT_name        : (strp) (offset: 0xa4b): nb_index
+    <d03>   DW_AT_name        : (strp) (offset: 0xa4e): nb_index
     <d07>   DW_AT_decl_file   : (data1) 12
     <d08>   DW_AT_decl_line   : (data1) 136
     <d09>   DW_AT_decl_column : (data1) 15
     <d0a>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <d0e>   DW_AT_data_member_location: (data2) 264
  <2><d10>: Abbrev Number: 18 (DW_TAG_member)
-    <d11>   DW_AT_name        : (strp) (offset: 0x3c7): nb_matrix_multiply
+    <d11>   DW_AT_name        : (strp) (offset: 0x39e): nb_matrix_multiply
     <d15>   DW_AT_decl_file   : (data1) 12
     <d16>   DW_AT_decl_line   : (data1) 138
     <d17>   DW_AT_decl_column : (data1) 16
     <d18>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <d1c>   DW_AT_data_member_location: (data2) 272
  <2><d1e>: Abbrev Number: 18 (DW_TAG_member)
     <d1f>   DW_AT_name        : (strp) (offset: 0x4ff4): nb_inplace_matrix_multiply
     <d23>   DW_AT_decl_file   : (data1) 12
     <d24>   DW_AT_decl_line   : (data1) 139
     <d25>   DW_AT_decl_column : (data1) 16
     <d26>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <d2a>   DW_AT_data_member_location: (data2) 280
  <2><d2c>: Abbrev Number: 0
  <1><d2d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <d2e>   DW_AT_name        : (strp) (offset: 0x1545): PyNumberMethods
+    <d2e>   DW_AT_name        : (strp) (offset: 0x151c): PyNumberMethods
     <d32>   DW_AT_decl_file   : (data1) 12
     <d33>   DW_AT_decl_line   : (data1) 140
     <d34>   DW_AT_decl_column : (data1) 3
     <d35>   DW_AT_type        : (ref4) <0xb4a>
  <1><d39>: Abbrev Number: 20 (DW_TAG_structure_type)
     <d3a>   DW_AT_byte_size   : (data1) 80
     <d3b>   DW_AT_decl_file   : (data1) 12
@@ -1735,71 +1735,71 @@
     <d43>   DW_AT_name        : (strp) (offset: 0x4148): sq_length
     <d47>   DW_AT_decl_file   : (data1) 12
     <d48>   DW_AT_decl_line   : (data1) 143
     <d49>   DW_AT_decl_column : (data1) 13
     <d4a>   DW_AT_type        : (ref4) <0x751>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <d4e>   DW_AT_data_member_location: (data1) 0
  <2><d4f>: Abbrev Number: 9 (DW_TAG_member)
-    <d50>   DW_AT_name        : (strp) (offset: 0x547): sq_concat
+    <d50>   DW_AT_name        : (strp) (offset: 0x51e): sq_concat
     <d54>   DW_AT_decl_file   : (data1) 12
     <d55>   DW_AT_decl_line   : (data1) 144
     <d56>   DW_AT_decl_column : (data1) 16
     <d57>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <d5b>   DW_AT_data_member_location: (data1) 8
  <2><d5c>: Abbrev Number: 9 (DW_TAG_member)
-    <d5d>   DW_AT_name        : (strp) (offset: 0x4bb): sq_repeat
+    <d5d>   DW_AT_name        : (strp) (offset: 0x492): sq_repeat
     <d61>   DW_AT_decl_file   : (data1) 12
     <d62>   DW_AT_decl_line   : (data1) 145
     <d63>   DW_AT_decl_column : (data1) 18
     <d64>   DW_AT_type        : (ref4) <0x772>, ssizeargfunc, PyObject, _object
     <d68>   DW_AT_data_member_location: (data1) 16
  <2><d69>: Abbrev Number: 9 (DW_TAG_member)
-    <d6a>   DW_AT_name        : (strp) (offset: 0x225): sq_item
+    <d6a>   DW_AT_name        : (strp) (offset: 0x1fc): sq_item
     <d6e>   DW_AT_decl_file   : (data1) 12
     <d6f>   DW_AT_decl_line   : (data1) 146
     <d70>   DW_AT_decl_column : (data1) 18
     <d71>   DW_AT_type        : (ref4) <0x772>, ssizeargfunc, PyObject, _object
     <d75>   DW_AT_data_member_location: (data1) 24
  <2><d76>: Abbrev Number: 9 (DW_TAG_member)
-    <d77>   DW_AT_name        : (strp) (offset: 0xca9): was_sq_slice
+    <d77>   DW_AT_name        : (strp) (offset: 0xcac): was_sq_slice
     <d7b>   DW_AT_decl_file   : (data1) 12
     <d7c>   DW_AT_decl_line   : (data1) 147
     <d7d>   DW_AT_decl_column : (data1) 11
     <d7e>   DW_AT_type        : (ref4) <0x85>
     <d82>   DW_AT_data_member_location: (data1) 32
  <2><d83>: Abbrev Number: 9 (DW_TAG_member)
-    <d84>   DW_AT_name        : (strp) (offset: 0x2e4): sq_ass_item
+    <d84>   DW_AT_name        : (strp) (offset: 0x2bb): sq_ass_item
     <d88>   DW_AT_decl_file   : (data1) 12
     <d89>   DW_AT_decl_line   : (data1) 148
     <d8a>   DW_AT_decl_column : (data1) 21
     <d8b>   DW_AT_type        : (ref4) <0x798>, ssizeobjargproc, int
     <d8f>   DW_AT_data_member_location: (data1) 40
  <2><d90>: Abbrev Number: 9 (DW_TAG_member)
-    <d91>   DW_AT_name        : (strp) (offset: 0x10d1): was_sq_ass_slice
+    <d91>   DW_AT_name        : (strp) (offset: 0x10d4): was_sq_ass_slice
     <d95>   DW_AT_decl_file   : (data1) 12
     <d96>   DW_AT_decl_line   : (data1) 149
     <d97>   DW_AT_decl_column : (data1) 11
     <d98>   DW_AT_type        : (ref4) <0x85>
     <d9c>   DW_AT_data_member_location: (data1) 48
  <2><d9d>: Abbrev Number: 9 (DW_TAG_member)
-    <d9e>   DW_AT_name        : (strp) (offset: 0x12f4): sq_contains
+    <d9e>   DW_AT_name        : (strp) (offset: 0x12cb): sq_contains
     <da2>   DW_AT_decl_file   : (data1) 12
     <da3>   DW_AT_decl_line   : (data1) 150
     <da4>   DW_AT_decl_column : (data1) 16
     <da5>   DW_AT_type        : (ref4) <0x7ee>, objobjproc, int
     <da9>   DW_AT_data_member_location: (data1) 56
  <2><daa>: Abbrev Number: 9 (DW_TAG_member)
-    <dab>   DW_AT_name        : (strp) (offset: 0x3f7): sq_inplace_concat
+    <dab>   DW_AT_name        : (strp) (offset: 0x3ce): sq_inplace_concat
     <daf>   DW_AT_decl_file   : (data1) 12
     <db0>   DW_AT_decl_line   : (data1) 152
     <db1>   DW_AT_decl_column : (data1) 16
     <db2>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <db6>   DW_AT_data_member_location: (data1) 64
  <2><db7>: Abbrev Number: 9 (DW_TAG_member)
-    <db8>   DW_AT_name        : (strp) (offset: 0x353): sq_inplace_repeat
+    <db8>   DW_AT_name        : (strp) (offset: 0x32a): sq_inplace_repeat
     <dbc>   DW_AT_decl_file   : (data1) 12
     <dbd>   DW_AT_decl_line   : (data1) 153
     <dbe>   DW_AT_decl_column : (data1) 18
     <dbf>   DW_AT_type        : (ref4) <0x772>, ssizeargfunc, PyObject, _object
     <dc3>   DW_AT_data_member_location: (data1) 72
  <2><dc4>: Abbrev Number: 0
  <1><dc5>: Abbrev Number: 2 (DW_TAG_typedef)
@@ -1818,22 +1818,22 @@
     <ddb>   DW_AT_name        : (strp) (offset: 0x3efa): mp_length
     <ddf>   DW_AT_decl_file   : (data1) 12
     <de0>   DW_AT_decl_line   : (data1) 157
     <de1>   DW_AT_decl_column : (data1) 13
     <de2>   DW_AT_type        : (ref4) <0x751>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <de6>   DW_AT_data_member_location: (data1) 0
  <2><de7>: Abbrev Number: 9 (DW_TAG_member)
-    <de8>   DW_AT_name        : (strp) (offset: 0x15e1): mp_subscript
+    <de8>   DW_AT_name        : (strp) (offset: 0x15b8): mp_subscript
     <dec>   DW_AT_decl_file   : (data1) 12
     <ded>   DW_AT_decl_line   : (data1) 158
     <dee>   DW_AT_decl_column : (data1) 16
     <def>   DW_AT_type        : (ref4) <0x6df>, binaryfunc, PyObject, _object
     <df3>   DW_AT_data_member_location: (data1) 8
  <2><df4>: Abbrev Number: 9 (DW_TAG_member)
-    <df5>   DW_AT_name        : (strp) (offset: 0x1451): mp_ass_subscript
+    <df5>   DW_AT_name        : (strp) (offset: 0x1428): mp_ass_subscript
     <df9>   DW_AT_decl_file   : (data1) 12
     <dfa>   DW_AT_decl_line   : (data1) 159
     <dfb>   DW_AT_decl_column : (data1) 19
     <dfc>   DW_AT_type        : (ref4) <0x7c3>, objobjargproc, int
     <e00>   DW_AT_data_member_location: (data1) 16
  <2><e01>: Abbrev Number: 0
  <1><e02>: Abbrev Number: 2 (DW_TAG_typedef)
@@ -1859,15 +1859,15 @@
     <e25>   DW_AT_name        : (strp) (offset: 0x3f41): am_aiter
     <e29>   DW_AT_decl_file   : (data1) 12
     <e2a>   DW_AT_decl_line   : (data1) 164
     <e2b>   DW_AT_decl_column : (data1) 15
     <e2c>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <e30>   DW_AT_data_member_location: (data1) 8
  <2><e31>: Abbrev Number: 9 (DW_TAG_member)
-    <e32>   DW_AT_name        : (strp) (offset: 0x497): am_anext
+    <e32>   DW_AT_name        : (strp) (offset: 0x46e): am_anext
     <e36>   DW_AT_decl_file   : (data1) 12
     <e37>   DW_AT_decl_line   : (data1) 165
     <e38>   DW_AT_decl_column : (data1) 15
     <e39>   DW_AT_type        : (ref4) <0x6b3>, unaryfunc, PyObject, _object
     <e3d>   DW_AT_data_member_location: (data1) 16
  <2><e3e>: Abbrev Number: 0
  <1><e3f>: Abbrev Number: 2 (DW_TAG_typedef)
@@ -1879,30 +1879,30 @@
  <1><e4b>: Abbrev Number: 20 (DW_TAG_structure_type)
     <e4c>   DW_AT_byte_size   : (data1) 16
     <e4d>   DW_AT_decl_file   : (data1) 12
     <e4e>   DW_AT_decl_line   : (data1) 168
     <e4f>   DW_AT_decl_column : (data1) 9
     <e50>   DW_AT_sibling     : (ref4) <0xe6f>
  <2><e54>: Abbrev Number: 9 (DW_TAG_member)
-    <e55>   DW_AT_name        : (strp) (offset: 0x1b71): bf_getbuffer
+    <e55>   DW_AT_name        : (strp) (offset: 0x1b48): bf_getbuffer
     <e59>   DW_AT_decl_file   : (data1) 12
     <e5a>   DW_AT_decl_line   : (data1) 169
     <e5b>   DW_AT_decl_column : (data1) 20
     <e5c>   DW_AT_type        : (ref4) <0xac1>, getbufferproc, int
     <e60>   DW_AT_data_member_location: (data1) 0
  <2><e61>: Abbrev Number: 9 (DW_TAG_member)
     <e62>   DW_AT_name        : (strp) (offset: 0x43b6): bf_releasebuffer
     <e66>   DW_AT_decl_file   : (data1) 12
     <e67>   DW_AT_decl_line   : (data1) 170
     <e68>   DW_AT_decl_column : (data1) 24
     <e69>   DW_AT_type        : (ref4) <0xaf2>, releasebufferproc
     <e6d>   DW_AT_data_member_location: (data1) 8
  <2><e6e>: Abbrev Number: 0
  <1><e6f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <e70>   DW_AT_name        : (strp) (offset: 0x25ed): PyBufferProcs
+    <e70>   DW_AT_name        : (strp) (offset: 0x25c4): PyBufferProcs
     <e74>   DW_AT_decl_file   : (data1) 12
     <e75>   DW_AT_decl_line   : (data1) 171
     <e76>   DW_AT_decl_column : (data1) 3
     <e77>   DW_AT_type        : (ref4) <0xe4b>
  <1><e7b>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <e7c>   DW_AT_byte_size   : (data1) 8
     <e7d>   DW_AT_type        : (ref4) <0xe3f>, PyAsyncMethods
@@ -1915,15 +1915,15 @@
  <1><e8d>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <e8e>   DW_AT_byte_size   : (data1) 8
     <e8f>   DW_AT_type        : (ref4) <0xe02>, PyMappingMethods
  <1><e93>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <e94>   DW_AT_byte_size   : (data1) 8
     <e95>   DW_AT_type        : (ref4) <0xe6f>, PyBufferProcs
  <1><e99>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <e9a>   DW_AT_name        : (strp) (offset: 0x155f): PyMethodDef
+    <e9a>   DW_AT_name        : (strp) (offset: 0x1536): PyMethodDef
     <e9e>   DW_AT_byte_size   : (data1) 32
     <e9f>   DW_AT_decl_file   : (data1) 13
     <ea0>   DW_AT_decl_line   : (data1) 51
     <ea1>   DW_AT_decl_column : (data1) 8
     <ea2>   DW_AT_sibling     : (ref4) <0xedb>
  <2><ea6>: Abbrev Number: 9 (DW_TAG_member)
     <ea7>   DW_AT_name        : (strp) (offset: 0x3446): ml_name
@@ -1936,15 +1936,15 @@
     <eb4>   DW_AT_name        : (strp) (offset: 0x3622): ml_meth
     <eb8>   DW_AT_decl_file   : (data1) 13
     <eb9>   DW_AT_decl_line   : (data1) 53
     <eba>   DW_AT_decl_column : (data1) 17
     <ebb>   DW_AT_type        : (ref4) <0x1348>, PyCFunction, PyObject, _object
     <ebf>   DW_AT_data_member_location: (data1) 8
  <2><ec0>: Abbrev Number: 9 (DW_TAG_member)
-    <ec1>   DW_AT_name        : (strp) (offset: 0x2637): ml_flags
+    <ec1>   DW_AT_name        : (strp) (offset: 0x260e): ml_flags
     <ec5>   DW_AT_decl_file   : (data1) 13
     <ec6>   DW_AT_decl_line   : (data1) 54
     <ec7>   DW_AT_decl_column : (data1) 17
     <ec8>   DW_AT_type        : (ref4) <0x5f>, int
     <ecc>   DW_AT_data_member_location: (data1) 16
  <2><ecd>: Abbrev Number: 9 (DW_TAG_member)
     <ece>   DW_AT_name        : (strp) (offset: 0x3400): ml_doc
@@ -1954,29 +1954,29 @@
     <ed5>   DW_AT_type        : (ref4) <0x2bf>, char
     <ed9>   DW_AT_data_member_location: (data1) 24
  <2><eda>: Abbrev Number: 0
  <1><edb>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <edc>   DW_AT_byte_size   : (data1) 8
     <edd>   DW_AT_type        : (ref4) <0xe99>, PyMethodDef
  <1><ee1>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <ee2>   DW_AT_name        : (strp) (offset: 0xcc5): PyMemberDef
+    <ee2>   DW_AT_name        : (strp) (offset: 0xcc8): PyMemberDef
     <ee6>   DW_AT_byte_size   : (data1) 40
     <ee7>   DW_AT_decl_file   : (data1) 14
     <ee8>   DW_AT_decl_line   : (data1) 18
     <ee9>   DW_AT_decl_column : (data1) 16
     <eea>   DW_AT_sibling     : (ref4) <0xf30>
  <2><eee>: Abbrev Number: 9 (DW_TAG_member)
     <eef>   DW_AT_name        : (strp) (offset: 0x3d21): name
     <ef3>   DW_AT_decl_file   : (data1) 14
     <ef4>   DW_AT_decl_line   : (data1) 19
     <ef5>   DW_AT_decl_column : (data1) 17
     <ef6>   DW_AT_type        : (ref4) <0x2bf>, char
     <efa>   DW_AT_data_member_location: (data1) 0
  <2><efb>: Abbrev Number: 9 (DW_TAG_member)
-    <efc>   DW_AT_name        : (strp) (offset: 0xcfc): type
+    <efc>   DW_AT_name        : (strp) (offset: 0xcff): type
     <f00>   DW_AT_decl_file   : (data1) 14
     <f01>   DW_AT_decl_line   : (data1) 20
     <f02>   DW_AT_decl_column : (data1) 9
     <f03>   DW_AT_type        : (ref4) <0x5f>, int
     <f07>   DW_AT_data_member_location: (data1) 8
  <2><f08>: Abbrev Number: 9 (DW_TAG_member)
     <f09>   DW_AT_name        : (strp) (offset: 0x491e): offset
@@ -2000,15 +2000,15 @@
     <f2a>   DW_AT_type        : (ref4) <0x2bf>, char
     <f2e>   DW_AT_data_member_location: (data1) 32
  <2><f2f>: Abbrev Number: 0
  <1><f30>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <f31>   DW_AT_byte_size   : (data1) 8
     <f32>   DW_AT_type        : (ref4) <0xee1>, PyMemberDef
  <1><f36>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <f37>   DW_AT_name        : (strp) (offset: 0x5d4): PyGetSetDef
+    <f37>   DW_AT_name        : (strp) (offset: 0x5ab): PyGetSetDef
     <f3b>   DW_AT_byte_size   : (data1) 40
     <f3c>   DW_AT_decl_file   : (data1) 15
     <f3d>   DW_AT_decl_line   : (data1) 11
     <f3e>   DW_AT_decl_column : (data1) 16
     <f3f>   DW_AT_sibling     : (ref4) <0xf85>
  <2><f43>: Abbrev Number: 9 (DW_TAG_member)
     <f44>   DW_AT_name        : (strp) (offset: 0x3d21): name
@@ -2063,42 +2063,42 @@
  <1><fa4>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <fa5>   DW_AT_byte_size   : (data1) 8
     <fa6>   DW_AT_type        : (ref4) <0xa5>, FILE, _IO_FILE
  <1><faa>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <fab>   DW_AT_byte_size   : (data1) 8
     <fac>   DW_AT_type        : (ref4) <0xf8b>, int
  <1><fb0>: Abbrev Number: 14 (DW_TAG_typedef)
-    <fb1>   DW_AT_name        : (strp) (offset: 0x1161): PyTypeObject
+    <fb1>   DW_AT_name        : (strp) (offset: 0x1164): PyTypeObject
     <fb5>   DW_AT_decl_file   : (data1) 12
     <fb6>   DW_AT_decl_line   : (data2) 270
     <fb8>   DW_AT_decl_column : (data1) 3
     <fb9>   DW_AT_type        : (ref4) <0x3c1>, _typeobject
  <1><fbd>: Abbrev Number: 28 (DW_TAG_structure_type)
-    <fbe>   DW_AT_name        : (strp) (offset: 0x1ac): _dictkeysobject
+    <fbe>   DW_AT_name        : (strp) (offset: 0x183): _dictkeysobject
     <fc2>   DW_AT_declaration : (flag_present) 1
  <1><fc2>: Abbrev Number: 2 (DW_TAG_typedef)
     <fc3>   DW_AT_name        : (strp) (offset: 0x3e29): Py_UCS4
     <fc7>   DW_AT_decl_file   : (data1) 16
     <fc8>   DW_AT_decl_line   : (data1) 102
     <fc9>   DW_AT_decl_column : (data1) 18
     <fca>   DW_AT_type        : (ref4) <0x323>, uint32_t, unsigned int
  <1><fce>: Abbrev Number: 2 (DW_TAG_typedef)
     <fcf>   DW_AT_name        : (strp) (offset: 0x3e21): Py_UCS2
     <fd3>   DW_AT_decl_file   : (data1) 16
     <fd4>   DW_AT_decl_line   : (data1) 103
     <fd5>   DW_AT_decl_column : (data1) 18
     <fd6>   DW_AT_type        : (ref4) <0x317>, uint16_t, short unsigned int
  <1><fda>: Abbrev Number: 2 (DW_TAG_typedef)
-    <fdb>   DW_AT_name        : (strp) (offset: 0x1fbb): Py_UCS1
+    <fdb>   DW_AT_name        : (strp) (offset: 0x1f92): Py_UCS1
     <fdf>   DW_AT_decl_file   : (data1) 16
     <fe0>   DW_AT_decl_line   : (data1) 104
     <fe1>   DW_AT_decl_column : (data1) 17
     <fe2>   DW_AT_type        : (ref4) <0x30b>, uint8_t, unsigned char
  <1><fe6>: Abbrev Number: 24 (DW_TAG_variable)
-    <fe7>   DW_AT_name        : (strp) (offset: 0x1efc): PyUnicode_Type
+    <fe7>   DW_AT_name        : (strp) (offset: 0x1ed3): PyUnicode_Type
     <feb>   DW_AT_decl_file   : (data1) 16
     <fec>   DW_AT_decl_line   : (data1) 111
     <fed>   DW_AT_decl_column : (data1) 26
     <fee>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <ff2>   DW_AT_external    : (flag_present) 1
     <ff2>   DW_AT_declaration : (flag_present) 1
  <1><ff2>: Abbrev Number: 20 (DW_TAG_structure_type)
@@ -2114,15 +2114,15 @@
     <1002>   DW_AT_decl_column : (data1) 22
     <1003>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <1007>   DW_AT_byte_size   : (data1) 4
     <1008>   DW_AT_bit_size    : (data1) 2
     <1009>   DW_AT_bit_offset  : (data1) 30
     <100a>   DW_AT_data_member_location: (data1) 0
  <2><100b>: Abbrev Number: 29 (DW_TAG_member)
-    <100c>   DW_AT_name        : (strp) (offset: 0x1cad): kind
+    <100c>   DW_AT_name        : (strp) (offset: 0x1c84): kind
     <1010>   DW_AT_decl_file   : (data1) 17
     <1011>   DW_AT_decl_line   : (data1) 202
     <1012>   DW_AT_decl_column : (data1) 22
     <1013>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <1017>   DW_AT_byte_size   : (data1) 4
     <1018>   DW_AT_bit_size    : (data1) 3
     <1019>   DW_AT_bit_offset  : (data1) 27
@@ -2134,15 +2134,15 @@
     <1022>   DW_AT_decl_column : (data1) 22
     <1023>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <1027>   DW_AT_byte_size   : (data1) 4
     <1028>   DW_AT_bit_size    : (data1) 1
     <1029>   DW_AT_bit_offset  : (data1) 26
     <102a>   DW_AT_data_member_location: (data1) 0
  <2><102b>: Abbrev Number: 29 (DW_TAG_member)
-    <102c>   DW_AT_name        : (strp) (offset: 0x27d): ascii
+    <102c>   DW_AT_name        : (strp) (offset: 0x254): ascii
     <1030>   DW_AT_decl_file   : (data1) 17
     <1031>   DW_AT_decl_line   : (data1) 211
     <1032>   DW_AT_decl_column : (data1) 22
     <1033>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <1037>   DW_AT_byte_size   : (data1) 4
     <1038>   DW_AT_bit_size    : (data1) 1
     <1039>   DW_AT_bit_offset  : (data1) 25
@@ -2161,43 +2161,43 @@
  <1><104c>: Abbrev Number: 20 (DW_TAG_structure_type)
     <104d>   DW_AT_byte_size   : (data1) 48
     <104e>   DW_AT_decl_file   : (data1) 17
     <104f>   DW_AT_decl_line   : (data1) 88
     <1050>   DW_AT_decl_column : (data1) 9
     <1051>   DW_AT_sibling     : (ref4) <0x1097>
  <2><1055>: Abbrev Number: 9 (DW_TAG_member)
-    <1056>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <1056>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <105a>   DW_AT_decl_file   : (data1) 17
     <105b>   DW_AT_decl_line   : (data1) 162
     <105c>   DW_AT_decl_column : (data1) 5
     <105d>   DW_AT_type        : (ref4) <0x677>, PyObject, _object
     <1061>   DW_AT_data_member_location: (data1) 0
  <2><1062>: Abbrev Number: 9 (DW_TAG_member)
-    <1063>   DW_AT_name        : (strp) (offset: 0xda0): length
+    <1063>   DW_AT_name        : (strp) (offset: 0xda3): length
     <1067>   DW_AT_decl_file   : (data1) 17
     <1068>   DW_AT_decl_line   : (data1) 163
     <1069>   DW_AT_decl_column : (data1) 16
     <106a>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <106e>   DW_AT_data_member_location: (data1) 16
  <2><106f>: Abbrev Number: 9 (DW_TAG_member)
     <1070>   DW_AT_name        : (strp) (offset: 0x3baa): hash
     <1074>   DW_AT_decl_file   : (data1) 17
     <1075>   DW_AT_decl_line   : (data1) 164
     <1076>   DW_AT_decl_column : (data1) 15
     <1077>   DW_AT_type        : (ref4) <0x34c>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <107b>   DW_AT_data_member_location: (data1) 24
  <2><107c>: Abbrev Number: 9 (DW_TAG_member)
-    <107d>   DW_AT_name        : (strp) (offset: 0x1c5f): state
+    <107d>   DW_AT_name        : (strp) (offset: 0x1c36): state
     <1081>   DW_AT_decl_file   : (data1) 17
     <1082>   DW_AT_decl_line   : (data1) 220
     <1083>   DW_AT_decl_column : (data1) 7
     <1084>   DW_AT_type        : (ref4) <0xff2>
     <1088>   DW_AT_data_member_location: (data1) 32
  <2><1089>: Abbrev Number: 9 (DW_TAG_member)
-    <108a>   DW_AT_name        : (strp) (offset: 0xa7b): wstr
+    <108a>   DW_AT_name        : (strp) (offset: 0xa7e): wstr
     <108e>   DW_AT_decl_file   : (data1) 17
     <108f>   DW_AT_decl_line   : (data1) 221
     <1090>   DW_AT_decl_column : (data1) 14
     <1091>   DW_AT_type        : (ref4) <0x1097>, wchar_t, int
     <1095>   DW_AT_data_member_location: (data1) 40
  <2><1096>: Abbrev Number: 0
  <1><1097>: Abbrev Number: 6 (DW_TAG_pointer_type)
@@ -2212,44 +2212,44 @@
  <1><10a9>: Abbrev Number: 20 (DW_TAG_structure_type)
     <10aa>   DW_AT_byte_size   : (data1) 72
     <10ab>   DW_AT_decl_file   : (data1) 17
     <10ac>   DW_AT_decl_line   : (data1) 227
     <10ad>   DW_AT_decl_column : (data1) 9
     <10ae>   DW_AT_sibling     : (ref4) <0x10e7>
  <2><10b2>: Abbrev Number: 9 (DW_TAG_member)
-    <10b3>   DW_AT_name        : (strp) (offset: 0x115b): _base
+    <10b3>   DW_AT_name        : (strp) (offset: 0x115e): _base
     <10b7>   DW_AT_decl_file   : (data1) 17
     <10b8>   DW_AT_decl_line   : (data1) 228
     <10b9>   DW_AT_decl_column : (data1) 19
     <10ba>   DW_AT_type        : (ref4) <0x109d>, PyASCIIObject
     <10be>   DW_AT_data_member_location: (data1) 0
  <2><10bf>: Abbrev Number: 9 (DW_TAG_member)
-    <10c0>   DW_AT_name        : (strp) (offset: 0xd9b): utf8_length
+    <10c0>   DW_AT_name        : (strp) (offset: 0xd9e): utf8_length
     <10c4>   DW_AT_decl_file   : (data1) 17
     <10c5>   DW_AT_decl_line   : (data1) 229
     <10c6>   DW_AT_decl_column : (data1) 16
     <10c7>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <10cb>   DW_AT_data_member_location: (data1) 48
  <2><10cc>: Abbrev Number: 9 (DW_TAG_member)
-    <10cd>   DW_AT_name        : (strp) (offset: 0x255): utf8
+    <10cd>   DW_AT_name        : (strp) (offset: 0x22c): utf8
     <10d1>   DW_AT_decl_file   : (data1) 17
     <10d2>   DW_AT_decl_line   : (data1) 231
     <10d3>   DW_AT_decl_column : (data1) 11
     <10d4>   DW_AT_type        : (ref4) <0x93>, char
     <10d8>   DW_AT_data_member_location: (data1) 56
  <2><10d9>: Abbrev Number: 9 (DW_TAG_member)
     <10da>   DW_AT_name        : (strp) (offset: 0x3b42): wstr_length
     <10de>   DW_AT_decl_file   : (data1) 17
     <10df>   DW_AT_decl_line   : (data1) 232
     <10e0>   DW_AT_decl_column : (data1) 16
     <10e1>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <10e5>   DW_AT_data_member_location: (data1) 64
  <2><10e6>: Abbrev Number: 0
  <1><10e7>: Abbrev Number: 2 (DW_TAG_typedef)
-    <10e8>   DW_AT_name        : (strp) (offset: 0xc6b): PyCompactUnicodeObject
+    <10e8>   DW_AT_name        : (strp) (offset: 0xc6e): PyCompactUnicodeObject
     <10ec>   DW_AT_decl_file   : (data1) 17
     <10ed>   DW_AT_decl_line   : (data1) 234
     <10ee>   DW_AT_decl_column : (data1) 3
     <10ef>   DW_AT_type        : (ref4) <0x10a9>
  <1><10f3>: Abbrev Number: 30 (DW_TAG_union_type)
     <10f4>   DW_AT_byte_size   : (data1) 8
     <10f5>   DW_AT_decl_file   : (data1) 17
@@ -2293,15 +2293,15 @@
  <1><113f>: Abbrev Number: 20 (DW_TAG_structure_type)
     <1140>   DW_AT_byte_size   : (data1) 80
     <1141>   DW_AT_decl_file   : (data1) 17
     <1142>   DW_AT_decl_line   : (data1) 239
     <1143>   DW_AT_decl_column : (data1) 9
     <1144>   DW_AT_sibling     : (ref4) <0x1163>
  <2><1148>: Abbrev Number: 9 (DW_TAG_member)
-    <1149>   DW_AT_name        : (strp) (offset: 0x115b): _base
+    <1149>   DW_AT_name        : (strp) (offset: 0x115e): _base
     <114d>   DW_AT_decl_file   : (data1) 17
     <114e>   DW_AT_decl_line   : (data1) 240
     <114f>   DW_AT_decl_column : (data1) 28
     <1150>   DW_AT_type        : (ref4) <0x10e7>, PyCompactUnicodeObject
     <1154>   DW_AT_data_member_location: (data1) 0
  <2><1155>: Abbrev Number: 9 (DW_TAG_member)
     <1156>   DW_AT_name        : (strp) (offset: 0x3874): data
@@ -2323,41 +2323,41 @@
     <1175>   DW_AT_byte_size   : (data1) 4
     <1176>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <117a>   DW_AT_decl_file   : (data1) 17
     <117b>   DW_AT_decl_line   : (data2) 320
     <117d>   DW_AT_decl_column : (data1) 6
     <117e>   DW_AT_sibling     : (ref4) <0x119b>
  <2><1182>: Abbrev Number: 34 (DW_TAG_enumerator)
-    <1183>   DW_AT_name        : (strp) (offset: 0x2615): PyUnicode_WCHAR_KIND
+    <1183>   DW_AT_name        : (strp) (offset: 0x25ec): PyUnicode_WCHAR_KIND
     <1187>   DW_AT_const_value : (data1) 0
  <2><1188>: Abbrev Number: 34 (DW_TAG_enumerator)
-    <1189>   DW_AT_name        : (strp) (offset: 0x999): PyUnicode_1BYTE_KIND
+    <1189>   DW_AT_name        : (strp) (offset: 0x99c): PyUnicode_1BYTE_KIND
     <118d>   DW_AT_const_value : (data1) 1
  <2><118e>: Abbrev Number: 34 (DW_TAG_enumerator)
-    <118f>   DW_AT_name        : (strp) (offset: 0x187f): PyUnicode_2BYTE_KIND
+    <118f>   DW_AT_name        : (strp) (offset: 0x1856): PyUnicode_2BYTE_KIND
     <1193>   DW_AT_const_value : (data1) 2
  <2><1194>: Abbrev Number: 34 (DW_TAG_enumerator)
     <1195>   DW_AT_name        : (strp) (offset: 0x35cf): PyUnicode_4BYTE_KIND
     <1199>   DW_AT_const_value : (data1) 4
  <2><119a>: Abbrev Number: 0
  <1><119b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <119c>   DW_AT_name        : (strp) (offset: 0x9dc): PyLongObject
+    <119c>   DW_AT_name        : (strp) (offset: 0x9df): PyLongObject
     <11a0>   DW_AT_decl_file   : (data1) 18
     <11a1>   DW_AT_decl_line   : (data1) 10
     <11a2>   DW_AT_decl_column : (data1) 28
     <11a3>   DW_AT_type        : (ref4) <0x11a7>, _longobject
  <1><11a7>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <11a8>   DW_AT_name        : (strp) (offset: 0x23d1): _longobject
+    <11a8>   DW_AT_name        : (strp) (offset: 0x23a8): _longobject
     <11ac>   DW_AT_byte_size   : (data1) 32
     <11ad>   DW_AT_decl_file   : (data1) 19
     <11ae>   DW_AT_decl_line   : (data1) 85
     <11af>   DW_AT_decl_column : (data1) 8
     <11b0>   DW_AT_sibling     : (ref4) <0x11cf>
  <2><11b4>: Abbrev Number: 9 (DW_TAG_member)
-    <11b5>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <11b5>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <11b9>   DW_AT_decl_file   : (data1) 19
     <11ba>   DW_AT_decl_line   : (data1) 86
     <11bb>   DW_AT_decl_column : (data1) 5
     <11bc>   DW_AT_type        : (ref4) <0x6a7>, PyVarObject
     <11c0>   DW_AT_data_member_location: (data1) 0
  <2><11c1>: Abbrev Number: 9 (DW_TAG_member)
     <11c2>   DW_AT_name        : (strp) (offset: 0x4c0e): ob_digit
@@ -2401,86 +2401,86 @@
     <120d>   DW_AT_decl_file   : (data1) 20
     <120e>   DW_AT_decl_line   : (data1) 18
     <120f>   DW_AT_decl_column : (data1) 32
     <1210>   DW_AT_type        : (ref4) <0x11a7>, _longobject
     <1214>   DW_AT_external    : (flag_present) 1
     <1214>   DW_AT_declaration : (flag_present) 1
  <1><1214>: Abbrev Number: 24 (DW_TAG_variable)
-    <1215>   DW_AT_name        : (strp) (offset: 0xbd5): _Py_TrueStruct
+    <1215>   DW_AT_name        : (strp) (offset: 0xbd8): _Py_TrueStruct
     <1219>   DW_AT_decl_file   : (data1) 20
     <121a>   DW_AT_decl_line   : (data1) 18
     <121b>   DW_AT_decl_column : (data1) 49
     <121c>   DW_AT_type        : (ref4) <0x11a7>, _longobject
     <1220>   DW_AT_external    : (flag_present) 1
     <1220>   DW_AT_declaration : (flag_present) 1
  <1><1220>: Abbrev Number: 24 (DW_TAG_variable)
-    <1221>   DW_AT_name        : (strp) (offset: 0x73c): PyFloat_Type
+    <1221>   DW_AT_name        : (strp) (offset: 0x713): PyFloat_Type
     <1225>   DW_AT_decl_file   : (data1) 21
     <1226>   DW_AT_decl_line   : (data1) 21
     <1227>   DW_AT_decl_column : (data1) 26
     <1228>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <122c>   DW_AT_external    : (flag_present) 1
     <122c>   DW_AT_declaration : (flag_present) 1
  <1><122c>: Abbrev Number: 24 (DW_TAG_variable)
-    <122d>   DW_AT_name        : (strp) (offset: 0x2d7): PyTuple_Type
+    <122d>   DW_AT_name        : (strp) (offset: 0x2ae): PyTuple_Type
     <1231>   DW_AT_decl_file   : (data1) 22
     <1232>   DW_AT_decl_line   : (data1) 23
     <1233>   DW_AT_decl_column : (data1) 26
     <1234>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <1238>   DW_AT_external    : (flag_present) 1
     <1238>   DW_AT_declaration : (flag_present) 1
  <1><1238>: Abbrev Number: 20 (DW_TAG_structure_type)
     <1239>   DW_AT_byte_size   : (data1) 32
     <123a>   DW_AT_decl_file   : (data1) 23
     <123b>   DW_AT_decl_line   : (data1) 9
     <123c>   DW_AT_decl_column : (data1) 9
     <123d>   DW_AT_sibling     : (ref4) <0x125c>
  <2><1241>: Abbrev Number: 9 (DW_TAG_member)
-    <1242>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <1242>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <1246>   DW_AT_decl_file   : (data1) 23
     <1247>   DW_AT_decl_line   : (data1) 10
     <1248>   DW_AT_decl_column : (data1) 5
     <1249>   DW_AT_type        : (ref4) <0x6a7>, PyVarObject
     <124d>   DW_AT_data_member_location: (data1) 0
  <2><124e>: Abbrev Number: 9 (DW_TAG_member)
-    <124f>   DW_AT_name        : (strp) (offset: 0x1066): ob_item
+    <124f>   DW_AT_name        : (strp) (offset: 0x1069): ob_item
     <1253>   DW_AT_decl_file   : (data1) 23
     <1254>   DW_AT_decl_line   : (data1) 14
     <1255>   DW_AT_decl_column : (data1) 15
     <1256>   DW_AT_type        : (ref4) <0x125c>, PyObject, _object
     <125a>   DW_AT_data_member_location: (data1) 24
  <2><125b>: Abbrev Number: 0
  <1><125c>: Abbrev Number: 12 (DW_TAG_array_type)
     <125d>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
     <1261>   DW_AT_sibling     : (ref4) <0x126c>
  <2><1265>: Abbrev Number: 13 (DW_TAG_subrange_type)
     <1266>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <126a>   DW_AT_upper_bound : (data1) 0
  <2><126b>: Abbrev Number: 0
  <1><126c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <126d>   DW_AT_name        : (strp) (offset: 0xc1d): PyTupleObject
+    <126d>   DW_AT_name        : (strp) (offset: 0xc20): PyTupleObject
     <1271>   DW_AT_decl_file   : (data1) 23
     <1272>   DW_AT_decl_line   : (data1) 15
     <1273>   DW_AT_decl_column : (data1) 3
     <1274>   DW_AT_type        : (ref4) <0x1238>
  <1><1278>: Abbrev Number: 20 (DW_TAG_structure_type)
     <1279>   DW_AT_byte_size   : (data1) 40
     <127a>   DW_AT_decl_file   : (data1) 24
     <127b>   DW_AT_decl_line   : (data1) 23
     <127c>   DW_AT_decl_column : (data1) 9
     <127d>   DW_AT_sibling     : (ref4) <0x12a9>
  <2><1281>: Abbrev Number: 9 (DW_TAG_member)
-    <1282>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <1282>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <1286>   DW_AT_decl_file   : (data1) 24
     <1287>   DW_AT_decl_line   : (data1) 24
     <1288>   DW_AT_decl_column : (data1) 5
     <1289>   DW_AT_type        : (ref4) <0x6a7>, PyVarObject
     <128d>   DW_AT_data_member_location: (data1) 0
  <2><128e>: Abbrev Number: 9 (DW_TAG_member)
-    <128f>   DW_AT_name        : (strp) (offset: 0x1066): ob_item
+    <128f>   DW_AT_name        : (strp) (offset: 0x1069): ob_item
     <1293>   DW_AT_decl_file   : (data1) 24
     <1294>   DW_AT_decl_line   : (data1) 26
     <1295>   DW_AT_decl_column : (data1) 16
     <1296>   DW_AT_type        : (ref4) <0x12a9>, PyObject, _object
     <129a>   DW_AT_data_member_location: (data1) 24
  <2><129b>: Abbrev Number: 9 (DW_TAG_member)
     <129c>   DW_AT_name        : (strp) (offset: 0x4b0b): allocated
@@ -2496,64 +2496,64 @@
  <1><12af>: Abbrev Number: 2 (DW_TAG_typedef)
     <12b0>   DW_AT_name        : (strp) (offset: 0x46d5): PyListObject
     <12b4>   DW_AT_decl_file   : (data1) 24
     <12b5>   DW_AT_decl_line   : (data1) 40
     <12b6>   DW_AT_decl_column : (data1) 3
     <12b7>   DW_AT_type        : (ref4) <0x1278>
  <1><12bb>: Abbrev Number: 24 (DW_TAG_variable)
-    <12bc>   DW_AT_name        : (strp) (offset: 0x1748): PyList_Type
+    <12bc>   DW_AT_name        : (strp) (offset: 0x171f): PyList_Type
     <12c0>   DW_AT_decl_file   : (data1) 24
     <12c1>   DW_AT_decl_line   : (data1) 43
     <12c2>   DW_AT_decl_column : (data1) 26
     <12c3>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <12c7>   DW_AT_external    : (flag_present) 1
     <12c7>   DW_AT_declaration : (flag_present) 1
  <1><12c7>: Abbrev Number: 24 (DW_TAG_variable)
-    <12c8>   DW_AT_name        : (strp) (offset: 0x20f9): PyDict_Type
+    <12c8>   DW_AT_name        : (strp) (offset: 0x20d0): PyDict_Type
     <12cc>   DW_AT_decl_file   : (data1) 25
     <12cd>   DW_AT_decl_line   : (data1) 15
     <12ce>   DW_AT_decl_column : (data1) 26
     <12cf>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <12d3>   DW_AT_external    : (flag_present) 1
     <12d3>   DW_AT_declaration : (flag_present) 1
  <1><12d3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <12d4>   DW_AT_name        : (strp) (offset: 0x2490): PyDictKeysObject
+    <12d4>   DW_AT_name        : (strp) (offset: 0x2467): PyDictKeysObject
     <12d8>   DW_AT_decl_file   : (data1) 26
     <12d9>   DW_AT_decl_line   : (data1) 9
     <12da>   DW_AT_decl_column : (data1) 32
     <12db>   DW_AT_type        : (ref4) <0xfbd>, _dictkeysobject
  <1><12df>: Abbrev Number: 20 (DW_TAG_structure_type)
     <12e0>   DW_AT_byte_size   : (data1) 48
     <12e1>   DW_AT_decl_file   : (data1) 26
     <12e2>   DW_AT_decl_line   : (data1) 14
     <12e3>   DW_AT_decl_column : (data1) 9
     <12e4>   DW_AT_sibling     : (ref4) <0x132a>
  <2><12e8>: Abbrev Number: 9 (DW_TAG_member)
-    <12e9>   DW_AT_name        : (strp) (offset: 0x1159): ob_base
+    <12e9>   DW_AT_name        : (strp) (offset: 0x115c): ob_base
     <12ed>   DW_AT_decl_file   : (data1) 26
     <12ee>   DW_AT_decl_line   : (data1) 15
     <12ef>   DW_AT_decl_column : (data1) 5
     <12f0>   DW_AT_type        : (ref4) <0x677>, PyObject, _object
     <12f4>   DW_AT_data_member_location: (data1) 0
  <2><12f5>: Abbrev Number: 9 (DW_TAG_member)
-    <12f6>   DW_AT_name        : (strp) (offset: 0x409): ma_used
+    <12f6>   DW_AT_name        : (strp) (offset: 0x3e0): ma_used
     <12fa>   DW_AT_decl_file   : (data1) 26
     <12fb>   DW_AT_decl_line   : (data1) 18
     <12fc>   DW_AT_decl_column : (data1) 16
     <12fd>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1301>   DW_AT_data_member_location: (data1) 16
  <2><1302>: Abbrev Number: 9 (DW_TAG_member)
-    <1303>   DW_AT_name        : (strp) (offset: 0x633): ma_version_tag
+    <1303>   DW_AT_name        : (strp) (offset: 0x60a): ma_version_tag
     <1307>   DW_AT_decl_file   : (data1) 26
     <1308>   DW_AT_decl_line   : (data1) 22
     <1309>   DW_AT_decl_column : (data1) 14
     <130a>   DW_AT_type        : (ref4) <0x32f>, uint64_t, long unsigned int
     <130e>   DW_AT_data_member_location: (data1) 24
  <2><130f>: Abbrev Number: 9 (DW_TAG_member)
-    <1310>   DW_AT_name        : (strp) (offset: 0xf74): ma_keys
+    <1310>   DW_AT_name        : (strp) (offset: 0xf77): ma_keys
     <1314>   DW_AT_decl_file   : (data1) 26
     <1315>   DW_AT_decl_line   : (data1) 24
     <1316>   DW_AT_decl_column : (data1) 23
     <1317>   DW_AT_type        : (ref4) <0x132a>, PyDictKeysObject, _dictkeysobject
     <131b>   DW_AT_data_member_location: (data1) 32
  <2><131c>: Abbrev Number: 9 (DW_TAG_member)
     <131d>   DW_AT_name        : (strp) (offset: 0x3129): ma_values
@@ -2563,41 +2563,41 @@
     <1324>   DW_AT_type        : (ref4) <0x12a9>, PyObject, _object
     <1328>   DW_AT_data_member_location: (data1) 40
  <2><1329>: Abbrev Number: 0
  <1><132a>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <132b>   DW_AT_byte_size   : (data1) 8
     <132c>   DW_AT_type        : (ref4) <0x12d3>, PyDictKeysObject, _dictkeysobject
  <1><1330>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1331>   DW_AT_name        : (strp) (offset: 0xf52): PyDictObject
+    <1331>   DW_AT_name        : (strp) (offset: 0xf55): PyDictObject
     <1335>   DW_AT_decl_file   : (data1) 26
     <1336>   DW_AT_decl_line   : (data1) 32
     <1337>   DW_AT_decl_column : (data1) 3
     <1338>   DW_AT_type        : (ref4) <0x12df>
  <1><133c>: Abbrev Number: 24 (DW_TAG_variable)
     <133d>   DW_AT_name        : (strp) (offset: 0x4afa): PyCFunction_Type
     <1341>   DW_AT_decl_file   : (data1) 13
     <1342>   DW_AT_decl_line   : (data1) 14
     <1343>   DW_AT_decl_column : (data1) 26
     <1344>   DW_AT_type        : (ref4) <0xfb0>, PyTypeObject, _typeobject
     <1348>   DW_AT_external    : (flag_present) 1
     <1348>   DW_AT_declaration : (flag_present) 1
  <1><1348>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1349>   DW_AT_name        : (strp) (offset: 0x279f): PyCFunction
+    <1349>   DW_AT_name        : (strp) (offset: 0x2776): PyCFunction
     <134d>   DW_AT_decl_file   : (data1) 13
     <134e>   DW_AT_decl_line   : (data1) 18
     <134f>   DW_AT_decl_column : (data1) 21
     <1350>   DW_AT_type        : (ref4) <0x6eb>, PyObject, _object
  <1><1354>: Abbrev Number: 2 (DW_TAG_typedef)
     <1355>   DW_AT_name        : (strp) (offset: 0x3182): PyCFunctionWithKeywords
     <1359>   DW_AT_decl_file   : (data1) 13
     <135a>   DW_AT_decl_line   : (data1) 20
     <135b>   DW_AT_decl_column : (data1) 21
     <135c>   DW_AT_type        : (ref4) <0x711>, PyObject, _object
  <1><1360>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1361>   DW_AT_name        : (strp) (offset: 0x1094): _PyCFunctionFastWithKeywords
+    <1361>   DW_AT_name        : (strp) (offset: 0x1097): _PyCFunctionFastWithKeywords
     <1365>   DW_AT_decl_file   : (data1) 13
     <1366>   DW_AT_decl_line   : (data1) 22
     <1367>   DW_AT_decl_column : (data1) 21
     <1368>   DW_AT_type        : (ref4) <0x136c>, PyObject, _object
  <1><136c>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <136d>   DW_AT_byte_size   : (data1) 8
     <136e>   DW_AT_type        : (ref4) <0x1372>, PyObject, _object
@@ -2611,27 +2611,27 @@
     <1381>   DW_AT_type        : (ref4) <0xb44>, PyObject, _object
  <2><1385>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <1386>   DW_AT_type        : (ref4) <0x33b>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><138a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
     <138b>   DW_AT_type        : (ref4) <0x6d4>, PyObject, _object
  <2><138f>: Abbrev Number: 0
  <1><1390>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1391>   DW_AT_name        : (strp) (offset: 0x155f): PyMethodDef
+    <1391>   DW_AT_name        : (strp) (offset: 0x1536): PyMethodDef
