# Comparing `tmp/composabl_dev-0.3.9.dev8-cp38-cp38-musllinux_1_1_x86_64.whl.zip` & `tmp/composabl_dev-0.4.0.dev4-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,11 +1,11 @@
-Zip file size: 35490 bytes, number of entries: 9
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-02 20:20 composabl_dev.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-02 20:20 composabl/
--rw-r--r--  2.0 unx       10 b- defN 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/top_level.txt
--rw-rw-r--  2.0 unx      562 b- defN 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/RECORD
--rw-r--r--  2.0 unx      111 b- defN 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/WHEEL
--rw-r--r--  2.0 unx     1846 b- defN 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/METADATA
--rw-r--r--  2.0 unx       57 b- defN 23-Aug-02 20:20 composabl_dev-0.3.9.dev8.dist-info/entry_points.txt
--rwxr-xr-x  2.0 unx    88304 b- defN 23-Aug-02 20:20 composabl/__init__.cpython-38-x86_64-linux-gnu.so
-9 files, 90890 bytes uncompressed, 34112 bytes compressed:  62.5%
+Zip file size: 32203 bytes, number of entries: 9
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 16:08 composabl_dev-0.4.0.dev4.dist-info/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 16:08 composabl_dev.libs/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 16:08 composabl/

- <1><105>: Abbrev Number: 5 (DW_TAG_typedef)
-    <106>   DW_AT_name        : (strp) (offset: 0x2cc5): wchar_t
-    <10a>   DW_AT_decl_file   : (data1) 3
-    <10b>   DW_AT_decl_line   : (data1) 18
-    <10c>   DW_AT_decl_column : (data1) 13
-    <10d>   DW_AT_type        : (ref4) <0xe6>, int
- <1><111>: Abbrev Number: 8 (DW_TAG_variable)
-    <112>   DW_AT_name        : (strp) (offset: 0x2960): optarg
-    <116>   DW_AT_decl_file   : (data1) 6
-    <117>   DW_AT_decl_line   : (data1) 123
-    <118>   DW_AT_decl_column : (data1) 14
-    <119>   DW_AT_type        : (ref4) <0xda>, char
-    <11d>   DW_AT_external    : (flag_present) 1
-    <11d>   DW_AT_declaration : (flag_present) 1
- <1><11d>: Abbrev Number: 8 (DW_TAG_variable)
-    <11e>   DW_AT_name        : (strp) (offset: 0x124e): optind
-    <122>   DW_AT_decl_file   : (data1) 6
-    <123>   DW_AT_decl_line   : (data1) 124
-    <124>   DW_AT_decl_column : (data1) 12
-    <125>   DW_AT_type        : (ref4) <0xe6>, int
-    <129>   DW_AT_external    : (flag_present) 1
-    <129>   DW_AT_declaration : (flag_present) 1
- <1><129>: Abbrev Number: 8 (DW_TAG_variable)
-    <12a>   DW_AT_name        : (strp) (offset: 0x2040): opterr
+    <c>   DW_AT_producer    : (strp) (offset: 0xa58): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
+    <10>   DW_AT_language    : (data1) 12	(ANSI C99)
+    <11>   DW_AT_name        : (strp) (offset: 0x8b8): dist/build_cython/composabl/__init__.c
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0x13d0): /project/composabl
+    <19>   DW_AT_ranges      : (sec_offset) 0x600
+    <1d>   DW_AT_low_pc      : (addr) 0
+    <25>   DW_AT_stmt_list   : (sec_offset) 0
+ <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2a>   DW_AT_name        : (strp) (offset: 0xe11): size_t
+    <2e>   DW_AT_decl_file   : (data1) 3
+    <2f>   DW_AT_decl_line   : (data1) 209
+    <30>   DW_AT_decl_column : (data1) 23
+    <31>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+ <1><35>: Abbrev Number: 3 (DW_TAG_base_type)
+    <36>   DW_AT_byte_size   : (data1) 8
+    <37>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <38>   DW_AT_name        : (strp) (offset: 0x19cc): long unsigned int
+ <1><3c>: Abbrev Number: 3 (DW_TAG_base_type)
+    <3d>   DW_AT_byte_size   : (data1) 1
+    <3e>   DW_AT_encoding    : (data1) 8	(unsigned char)
+    <3f>   DW_AT_name        : (strp) (offset: 0x7f0): unsigned char
+ <1><43>: Abbrev Number: 3 (DW_TAG_base_type)
+    <44>   DW_AT_byte_size   : (data1) 2
+    <45>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <46>   DW_AT_name        : (strp) (offset: 0x1107): short unsigned int
+ <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
+    <4b>   DW_AT_byte_size   : (data1) 4
+    <4c>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <4d>   DW_AT_name        : (strp) (offset: 0x19d1): unsigned int
+ <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
+    <52>   DW_AT_byte_size   : (data1) 1
+    <53>   DW_AT_encoding    : (data1) 6	(signed char)
+    <54>   DW_AT_name        : (strp) (offset: 0x7f2): signed char
+ <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
+    <59>   DW_AT_byte_size   : (data1) 2
+    <5a>   DW_AT_encoding    : (data1) 5	(signed)
+    <5b>   DW_AT_name        : (strp) (offset: 0x1dff): short int
+ <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
+    <60>   DW_AT_byte_size   : (data1) 4
+    <61>   DW_AT_encoding    : (data1) 5	(signed)
+    <62>   DW_AT_name        : (string) int
+ <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
+    <67>   DW_AT_byte_size   : (data1) 8
+    <68>   DW_AT_encoding    : (data1) 5	(signed)
+    <69>   DW_AT_name        : (strp) (offset: 0x1c04): long int
+ <1><6d>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6e>   DW_AT_name        : (strp) (offset: 0x298): __off_t
+    <72>   DW_AT_decl_file   : (data1) 4
+    <73>   DW_AT_decl_line   : (data1) 140
+    <74>   DW_AT_decl_column : (data1) 25
+    <75>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><79>: Abbrev Number: 2 (DW_TAG_typedef)
+    <7a>   DW_AT_name        : (strp) (offset: 0x1180): __off64_t
+    <7e>   DW_AT_decl_file   : (data1) 4
+    <7f>   DW_AT_decl_line   : (data1) 141
+    <80>   DW_AT_decl_column : (data1) 27
+    <81>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><85>: Abbrev Number: 5 (DW_TAG_pointer_type)
+    <86>   DW_AT_byte_size   : (data1) 8
+ <1><87>: Abbrev Number: 2 (DW_TAG_typedef)
+    <88>   DW_AT_name        : (strp) (offset: 0xe0e): __ssize_t
+    <8c>   DW_AT_decl_file   : (data1) 4
+    <8d>   DW_AT_decl_line   : (data1) 181
+    <8e>   DW_AT_decl_column : (data1) 27
+    <8f>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><93>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <94>   DW_AT_byte_size   : (data1) 8
+    <95>   DW_AT_type        : (ref4) <0x99>, char
+ <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
+    <9a>   DW_AT_byte_size   : (data1) 1
+    <9b>   DW_AT_encoding    : (data1) 6	(signed char)
+    <9c>   DW_AT_name        : (strp) (offset: 0x7f9): char
+ <1><a0>: Abbrev Number: 7 (DW_TAG_const_type)
+    <a1>   DW_AT_type        : (ref4) <0x99>, char
+ <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <a6>   DW_AT_name        : (strp) (offset: 0x160c): FILE
+    <aa>   DW_AT_decl_file   : (data1) 5
+    <ab>   DW_AT_decl_line   : (data1) 48
+    <ac>   DW_AT_decl_column : (data1) 25
+    <ad>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
+ <1><b1>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <b2>   DW_AT_name        : (strp) (offset: 0x1608): _IO_FILE
+    <b6>   DW_AT_byte_size   : (data1) 216
+    <b7>   DW_AT_decl_file   : (data1) 6
+    <b8>   DW_AT_decl_line   : (data1) 246
+    <b9>   DW_AT_decl_column : (data1) 8
+    <ba>   DW_AT_sibling     : (ref4) <0x250>
+ <2><be>: Abbrev Number: 9 (DW_TAG_member)
+    <bf>   DW_AT_name        : (strp) (offset: 0xf36): _flags
+    <c3>   DW_AT_decl_file   : (data1) 6
+    <c4>   DW_AT_decl_line   : (data1) 247
+    <c5>   DW_AT_decl_column : (data1) 7
+    <c6>   DW_AT_type        : (ref4) <0x5f>, int
+    <ca>   DW_AT_data_member_location: (data1) 0
+ <2><cb>: Abbrev Number: 9 (DW_TAG_member)
+    <cc>   DW_AT_name        : (strp) (offset: 0x1a90): _IO_read_ptr
+    <d0>   DW_AT_decl_file   : (data1) 6
+    <d1>   DW_AT_decl_line   : (data1) 252
+    <d2>   DW_AT_decl_column : (data1) 9
+    <d3>   DW_AT_type        : (ref4) <0x93>, char
+    <d7>   DW_AT_data_member_location: (data1) 8
+ <2><d8>: Abbrev Number: 9 (DW_TAG_member)
+    <d9>   DW_AT_name        : (strp) (offset: 0x15d3): _IO_read_end
+    <dd>   DW_AT_decl_file   : (data1) 6
+    <de>   DW_AT_decl_line   : (data1) 253
+    <df>   DW_AT_decl_column : (data1) 9
+    <e0>   DW_AT_type        : (ref4) <0x93>, char
+    <e4>   DW_AT_data_member_location: (data1) 16
+ <2><e5>: Abbrev Number: 9 (DW_TAG_member)
+    <e6>   DW_AT_name        : (strp) (offset: 0x1192): _IO_read_base
+    <ea>   DW_AT_decl_file   : (data1) 6
+    <eb>   DW_AT_decl_line   : (data1) 254
+    <ec>   DW_AT_decl_column : (data1) 9
+    <ed>   DW_AT_type        : (ref4) <0x93>, char
+    <f1>   DW_AT_data_member_location: (data1) 24
+ <2><f2>: Abbrev Number: 9 (DW_TAG_member)
+    <f3>   DW_AT_name        : (strp) (offset: 0x1231): _IO_write_base
+    <f7>   DW_AT_decl_file   : (data1) 6
+    <f8>   DW_AT_decl_line   : (data1) 255
+    <f9>   DW_AT_decl_column : (data1) 9
+    <fa>   DW_AT_type        : (ref4) <0x93>, char
+    <fe>   DW_AT_data_member_location: (data1) 32
+ <2><ff>: Abbrev Number: 10 (DW_TAG_member)
+    <100>   DW_AT_name        : (strp) (offset: 0xa30): _IO_write_ptr
+    <104>   DW_AT_decl_file   : (data1) 6
+    <105>   DW_AT_decl_line   : (data2) 256
+    <107>   DW_AT_decl_column : (data1) 9
+    <108>   DW_AT_type        : (ref4) <0x93>, char
+    <10c>   DW_AT_data_member_location: (data1) 40
+ <2><10d>: Abbrev Number: 10 (DW_TAG_member)
+    <10e>   DW_AT_name        : (strp) (offset: 0x41f): _IO_write_end
+    <112>   DW_AT_decl_file   : (data1) 6
+    <113>   DW_AT_decl_line   : (data2) 257
+    <115>   DW_AT_decl_column : (data1) 9
+    <116>   DW_AT_type        : (ref4) <0x93>, char
+    <11a>   DW_AT_data_member_location: (data1) 48
+ <2><11b>: Abbrev Number: 10 (DW_TAG_member)
+    <11c>   DW_AT_name        : (strp) (offset: 0x155c): _IO_buf_base
+    <120>   DW_AT_decl_file   : (data1) 6
+    <121>   DW_AT_decl_line   : (data2) 258
+    <123>   DW_AT_decl_column : (data1) 9
+    <124>   DW_AT_type        : (ref4) <0x93>, char
+    <128>   DW_AT_data_member_location: (data1) 56
+ <2><129>: Abbrev Number: 10 (DW_TAG_member)
+    <12a>   DW_AT_name        : (strp) (offset: 0x11e2): _IO_buf_end
     <12e>   DW_AT_decl_file   : (data1) 6
-    <12f>   DW_AT_decl_line   : (data1) 124
-    <130>   DW_AT_decl_column : (data1) 20
-    <131>   DW_AT_type        : (ref4) <0xe6>, int
-    <135>   DW_AT_external    : (flag_present) 1
-    <135>   DW_AT_declaration : (flag_present) 1
- <1><135>: Abbrev Number: 8 (DW_TAG_variable)
-    <136>   DW_AT_name        : (strp) (offset: 0x1ea2): optopt
-    <13a>   DW_AT_decl_file   : (data1) 6
-    <13b>   DW_AT_decl_line   : (data1) 124
-    <13c>   DW_AT_decl_column : (data1) 28
-    <13d>   DW_AT_type        : (ref4) <0xe6>, int
-    <141>   DW_AT_external    : (flag_present) 1
-    <141>   DW_AT_declaration : (flag_present) 1
- <1><141>: Abbrev Number: 8 (DW_TAG_variable)
-    <142>   DW_AT_name        : (strp) (offset: 0xda1): optreset
-    <146>   DW_AT_decl_file   : (data1) 6
-    <147>   DW_AT_decl_line   : (data1) 179
-    <148>   DW_AT_decl_column : (data1) 12
-    <149>   DW_AT_type        : (ref4) <0xe6>, int
-    <14d>   DW_AT_external    : (flag_present) 1
-    <14d>   DW_AT_declaration : (flag_present) 1
- <1><14d>: Abbrev Number: 8 (DW_TAG_variable)
-    <14e>   DW_AT_name        : (strp) (offset: 0x9c1): environ
-    <152>   DW_AT_decl_file   : (data1) 6
-    <153>   DW_AT_decl_line   : (data1) 183
-    <154>   DW_AT_decl_column : (data1) 15
-    <155>   DW_AT_type        : (ref4) <0x159>, char
-    <159>   DW_AT_external    : (flag_present) 1
-    <159>   DW_AT_declaration : (flag_present) 1
- <1><159>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <15a>   DW_AT_byte_size   : (data1) 8
-    <15b>   DW_AT_type        : (ref4) <0xda>, char
- <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
-    <160>   DW_AT_byte_size   : (data1) 1
-    <161>   DW_AT_encoding    : (data1) 6	(signed char)
-    <162>   DW_AT_name        : (strp) (offset: 0x9cb): signed char
- <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
-    <167>   DW_AT_byte_size   : (data1) 2
-    <168>   DW_AT_encoding    : (data1) 5	(signed)
-    <169>   DW_AT_name        : (strp) (offset: 0x2468): short int
- <1><16d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <16e>   DW_AT_name        : (strp) (offset: 0x24c1): int64_t
-    <172>   DW_AT_decl_file   : (data1) 3
-    <173>   DW_AT_decl_line   : (data1) 152
-    <174>   DW_AT_decl_column : (data1) 25
-    <175>   DW_AT_type        : (ref4) <0x78>, long int
- <1><179>: Abbrev Number: 2 (DW_TAG_base_type)
-    <17a>   DW_AT_byte_size   : (data1) 1
-    <17b>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <17c>   DW_AT_name        : (strp) (offset: 0x9c9): unsigned char
- <1><180>: Abbrev Number: 3 (DW_TAG_const_type)
-    <181>   DW_AT_type        : (ref4) <0x179>, unsigned char
- <1><185>: Abbrev Number: 2 (DW_TAG_base_type)
-    <186>   DW_AT_byte_size   : (data1) 2
-    <187>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <188>   DW_AT_name        : (strp) (offset: 0x29da): short unsigned int
- <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
-    <18d>   DW_AT_name        : (strp) (offset: 0x28b0): uint32_t
-    <191>   DW_AT_decl_file   : (data1) 3
-    <192>   DW_AT_decl_line   : (data1) 172
-    <193>   DW_AT_decl_column : (data1) 25
-    <194>   DW_AT_type        : (ref4) <0x52>, unsigned int
- <1><198>: Abbrev Number: 5 (DW_TAG_typedef)
-    <199>   DW_AT_name        : (strp) (offset: 0x24c0): uint64_t
-    <19d>   DW_AT_decl_file   : (data1) 3
-    <19e>   DW_AT_decl_line   : (data1) 177
-    <19f>   DW_AT_decl_column : (data1) 25
-    <1a0>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
- <1><1a4>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1a5>   DW_AT_name        : (strp) (offset: 0x1f30): Py_ssize_t
-    <1a9>   DW_AT_decl_file   : (data1) 7
-    <1aa>   DW_AT_decl_line   : (data1) 105
-    <1ab>   DW_AT_decl_column : (data1) 25
-    <1ac>   DW_AT_type        : (ref4) <0x6c>, ssize_t, long int
- <1><1b0>: Abbrev Number: 3 (DW_TAG_const_type)
-    <1b1>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <1><1b5>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1b6>   DW_AT_name        : (strp) (offset: 0x654): Py_hash_t
-    <1ba>   DW_AT_decl_file   : (data1) 7
-    <1bb>   DW_AT_decl_line   : (data1) 114
-    <1bc>   DW_AT_decl_column : (data1) 20
-    <1bd>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <1><1c1>: Abbrev Number: 2 (DW_TAG_base_type)
-    <1c2>   DW_AT_byte_size   : (data1) 4
-    <1c3>   DW_AT_encoding    : (data1) 4	(float)
-    <1c4>   DW_AT_name        : (strp) (offset: 0xac2): float
- <1><1c8>: Abbrev Number: 11 (DW_TAG_variable)
-    <1c9>   DW_AT_name        : (strp) (offset: 0x1f14): signgam
-    <1cd>   DW_AT_decl_file   : (data1) 8
-    <1ce>   DW_AT_decl_line   : (data2) 384
-    <1d0>   DW_AT_decl_column : (data1) 12
-    <1d1>   DW_AT_type        : (ref4) <0xe6>, int
-    <1d5>   DW_AT_external    : (flag_present) 1
-    <1d5>   DW_AT_declaration : (flag_present) 1
- <1><1d5>: Abbrev Number: 12 (DW_TAG_array_type)
-    <1d6>   DW_AT_type        : (ref4) <0xda>, char
-    <1da>   DW_AT_sibling     : (ref4) <0x1e5>
- <2><1de>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <1df>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
-    <1e3>   DW_AT_upper_bound : (data1) 1
- <2><1e4>: Abbrev Number: 0
- <1><1e5>: Abbrev Number: 8 (DW_TAG_variable)
-    <1e6>   DW_AT_name        : (strp) (offset: 0x19ff): tzname
-    <1ea>   DW_AT_decl_file   : (data1) 9
-    <1eb>   DW_AT_decl_line   : (data1) 114
-    <1ec>   DW_AT_decl_column : (data1) 14
-    <1ed>   DW_AT_type        : (ref4) <0x1d5>, char
-    <1f1>   DW_AT_external    : (flag_present) 1
-    <1f1>   DW_AT_declaration : (flag_present) 1
- <1><1f1>: Abbrev Number: 8 (DW_TAG_variable)
-    <1f2>   DW_AT_name        : (strp) (offset: 0x2b23): daylight
-    <1f6>   DW_AT_decl_file   : (data1) 9
-    <1f7>   DW_AT_decl_line   : (data1) 121
-    <1f8>   DW_AT_decl_column : (data1) 12
-    <1f9>   DW_AT_type        : (ref4) <0xe6>, int
-    <1fd>   DW_AT_external    : (flag_present) 1
-    <1fd>   DW_AT_declaration : (flag_present) 1
- <1><1fd>: Abbrev Number: 8 (DW_TAG_variable)
-    <1fe>   DW_AT_name        : (strp) (offset: 0xce3): timezone
-    <202>   DW_AT_decl_file   : (data1) 9
-    <203>   DW_AT_decl_line   : (data1) 122
-    <204>   DW_AT_decl_column : (data1) 13
-    <205>   DW_AT_type        : (ref4) <0x78>, long int
-    <209>   DW_AT_external    : (flag_present) 1
-    <209>   DW_AT_declaration : (flag_present) 1
- <1><209>: Abbrev Number: 8 (DW_TAG_variable)
-    <20a>   DW_AT_name        : (strp) (offset: 0x288d): getdate_err
-    <20e>   DW_AT_decl_file   : (data1) 9
-    <20f>   DW_AT_decl_line   : (data1) 123
-    <210>   DW_AT_decl_column : (data1) 12
-    <211>   DW_AT_type        : (ref4) <0xe6>, int
-    <215>   DW_AT_external    : (flag_present) 1
-    <215>   DW_AT_declaration : (flag_present) 1
- <1><215>: Abbrev Number: 14 (DW_TAG_enumeration_type)
-    <216>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <217>   DW_AT_byte_size   : (data1) 4
-    <218>   DW_AT_type        : (ref4) <0x52>, unsigned int
-    <21c>   DW_AT_decl_file   : (data1) 10
-    <21d>   DW_AT_decl_line   : (data1) 112
-    <21e>   DW_AT_decl_column : (data1) 10
-    <21f>   DW_AT_sibling     : (ref4) <0x236>
- <2><223>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <224>   DW_AT_name        : (strp) (offset: 0x1dd1): TRACEMALLOC_NOT_INITIALIZED
-    <228>   DW_AT_const_value : (data1) 0
- <2><229>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <22a>   DW_AT_name        : (strp) (offset: 0x2ab): TRACEMALLOC_INITIALIZED
-    <22e>   DW_AT_const_value : (data1) 1
- <2><22f>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <230>   DW_AT_name        : (strp) (offset: 0x17fc): TRACEMALLOC_FINALIZED
-    <234>   DW_AT_const_value : (data1) 2
- <2><235>: Abbrev Number: 0
- <1><236>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <237>   DW_AT_name        : (strp) (offset: 0x2527): _PyTraceMalloc_Config
-    <23b>   DW_AT_byte_size   : (data1) 16
-    <23c>   DW_AT_decl_file   : (data1) 10
-    <23d>   DW_AT_decl_line   : (data1) 109
-    <23e>   DW_AT_decl_column : (data1) 8
-    <23f>   DW_AT_sibling     : (ref4) <0x278>
- <2><243>: Abbrev Number: 17 (DW_TAG_member)
-    <244>   DW_AT_name        : (strp) (offset: 0x1557): initialized
-    <248>   DW_AT_decl_file   : (data1) 10
-    <249>   DW_AT_decl_line   : (data1) 116
-    <24a>   DW_AT_decl_column : (data1) 7
-    <24b>   DW_AT_type        : (ref4) <0x215>, unsigned int
-    <24f>   DW_AT_data_member_location: (data1) 0
- <2><250>: Abbrev Number: 17 (DW_TAG_member)
-    <251>   DW_AT_name        : (strp) (offset: 0x1a3a): tracing
-    <255>   DW_AT_decl_file   : (data1) 10
-    <256>   DW_AT_decl_line   : (data1) 120
-    <257>   DW_AT_decl_column : (data1) 9
-    <258>   DW_AT_type        : (ref4) <0xe6>, int
-    <25c>   DW_AT_data_member_location: (data1) 4
- <2><25d>: Abbrev Number: 17 (DW_TAG_member)
-    <25e>   DW_AT_name        : (strp) (offset: 0x12e3): max_nframe
-    <262>   DW_AT_decl_file   : (data1) 10
-    <263>   DW_AT_decl_line   : (data1) 124
-    <264>   DW_AT_decl_column : (data1) 9
-    <265>   DW_AT_type        : (ref4) <0xe6>, int
-    <269>   DW_AT_data_member_location: (data1) 8
- <2><26a>: Abbrev Number: 17 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x1fea): use_domain
-    <26f>   DW_AT_decl_file   : (data1) 10
-    <270>   DW_AT_decl_line   : (data1) 128
-    <271>   DW_AT_decl_column : (data1) 9
-    <272>   DW_AT_type        : (ref4) <0xe6>, int
-    <276>   DW_AT_data_member_location: (data1) 12
- <2><277>: Abbrev Number: 0
- <1><278>: Abbrev Number: 8 (DW_TAG_variable)
-    <279>   DW_AT_name        : (strp) (offset: 0x220b): _Py_tracemalloc_config
-    <27d>   DW_AT_decl_file   : (data1) 10
-    <27e>   DW_AT_decl_line   : (data1) 131
-    <27f>   DW_AT_decl_column : (data1) 42
-    <280>   DW_AT_type        : (ref4) <0x236>, _PyTraceMalloc_Config
-    <284>   DW_AT_external    : (flag_present) 1
-    <284>   DW_AT_declaration : (flag_present) 1
- <1><284>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <285>   DW_AT_name        : (strp) (offset: 0x2c4e): _object
-    <289>   DW_AT_byte_size   : (data1) 16
-    <28a>   DW_AT_decl_file   : (data1) 2
-    <28b>   DW_AT_decl_line   : (data1) 104
-    <28c>   DW_AT_decl_column : (data1) 16
-    <28d>   DW_AT_sibling     : (ref4) <0x2ac>
- <2><291>: Abbrev Number: 17 (DW_TAG_member)
-    <292>   DW_AT_name        : (strp) (offset: 0x64a): ob_refcnt
-    <296>   DW_AT_decl_file   : (data1) 2
-    <297>   DW_AT_decl_line   : (data1) 106
-    <298>   DW_AT_decl_column : (data1) 16
-    <299>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <29d>   DW_AT_data_member_location: (data1) 0
- <2><29e>: Abbrev Number: 17 (DW_TAG_member)
-    <29f>   DW_AT_name        : (strp) (offset: 0x2991): ob_type
-    <2a3>   DW_AT_decl_file   : (data1) 2
-    <2a4>   DW_AT_decl_line   : (data1) 107
-    <2a5>   DW_AT_decl_column : (data1) 25
-    <2a6>   DW_AT_type        : (ref4) <0x55c>, _typeobject
-    <2aa>   DW_AT_data_member_location: (data1) 8
- <2><2ab>: Abbrev Number: 0
- <1><2ac>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <2ad>   DW_AT_name        : (strp) (offset: 0x149a): _typeobject
-    <2b1>   DW_AT_byte_size   : (data2) 416
-    <2b3>   DW_AT_decl_file   : (data1) 11
-    <2b4>   DW_AT_decl_line   : (data1) 177
-    <2b5>   DW_AT_decl_column : (data1) 16
-    <2b6>   DW_AT_sibling     : (ref4) <0x55c>
- <2><2ba>: Abbrev Number: 17 (DW_TAG_member)
-    <2bb>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
-    <2bf>   DW_AT_decl_file   : (data1) 11
-    <2c0>   DW_AT_decl_line   : (data1) 178
-    <2c1>   DW_AT_decl_column : (data1) 5
-    <2c2>   DW_AT_type        : (ref4) <0x592>, PyVarObject
-    <2c6>   DW_AT_data_member_location: (data1) 0
- <2><2c7>: Abbrev Number: 17 (DW_TAG_member)
-    <2c8>   DW_AT_name        : (strp) (offset: 0x55d): tp_name
-    <2cc>   DW_AT_decl_file   : (data1) 11
-    <2cd>   DW_AT_decl_line   : (data1) 179
-    <2ce>   DW_AT_decl_column : (data1) 17
-    <2cf>   DW_AT_type        : (ref4) <0xe0>, char
-    <2d3>   DW_AT_data_member_location: (data1) 24
- <2><2d4>: Abbrev Number: 17 (DW_TAG_member)
-    <2d5>   DW_AT_name        : (strp) (offset: 0x2398): tp_basicsize
-    <2d9>   DW_AT_decl_file   : (data1) 11
-    <2da>   DW_AT_decl_line   : (data1) 180
-    <2db>   DW_AT_decl_column : (data1) 16
-    <2dc>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <2e0>   DW_AT_data_member_location: (data1) 32
- <2><2e1>: Abbrev Number: 17 (DW_TAG_member)
-    <2e2>   DW_AT_name        : (strp) (offset: 0x24d1): tp_itemsize
-    <2e6>   DW_AT_decl_file   : (data1) 11
-    <2e7>   DW_AT_decl_line   : (data1) 180
-    <2e8>   DW_AT_decl_column : (data1) 30
-    <2e9>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <2ed>   DW_AT_data_member_location: (data1) 40
- <2><2ee>: Abbrev Number: 17 (DW_TAG_member)
-    <2ef>   DW_AT_name        : (strp) (offset: 0x1c1): tp_dealloc
-    <2f3>   DW_AT_decl_file   : (data1) 11
-    <2f4>   DW_AT_decl_line   : (data1) 184
-    <2f5>   DW_AT_decl_column : (data1) 16
-    <2f6>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <2fa>   DW_AT_data_member_location: (data1) 48
- <2><2fb>: Abbrev Number: 17 (DW_TAG_member)
-    <2fc>   DW_AT_name        : (strp) (offset: 0xb62): tp_vectorcall_offset
-    <300>   DW_AT_decl_file   : (data1) 11
-    <301>   DW_AT_decl_line   : (data1) 185
-    <302>   DW_AT_decl_column : (data1) 16
-    <303>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <307>   DW_AT_data_member_location: (data1) 56
- <2><308>: Abbrev Number: 17 (DW_TAG_member)
-    <309>   DW_AT_name        : (strp) (offset: 0x2332): tp_getattr
-    <30d>   DW_AT_decl_file   : (data1) 11
-    <30e>   DW_AT_decl_line   : (data1) 186
-    <30f>   DW_AT_decl_column : (data1) 17
-    <310>   DW_AT_type        : (ref4) <0x78a>, getattrfunc, PyObject, _object
-    <314>   DW_AT_data_member_location: (data1) 64
- <2><315>: Abbrev Number: 17 (DW_TAG_member)
-    <316>   DW_AT_name        : (strp) (offset: 0x11ae): tp_setattr
-    <31a>   DW_AT_decl_file   : (data1) 11
-    <31b>   DW_AT_decl_line   : (data1) 187
-    <31c>   DW_AT_decl_column : (data1) 17
-    <31d>   DW_AT_type        : (ref4) <0x7bc>, setattrfunc, int
-    <321>   DW_AT_data_member_location: (data1) 72
- <2><322>: Abbrev Number: 17 (DW_TAG_member)
-    <323>   DW_AT_name        : (strp) (offset: 0x1f5f): tp_as_async
-    <327>   DW_AT_decl_file   : (data1) 11
-    <328>   DW_AT_decl_line   : (data1) 188
-    <329>   DW_AT_decl_column : (data1) 21
-    <32a>   DW_AT_type        : (ref4) <0xd7f>, PyAsyncMethods
-    <32e>   DW_AT_data_member_location: (data1) 80
- <2><32f>: Abbrev Number: 17 (DW_TAG_member)
-    <330>   DW_AT_name        : (strp) (offset: 0x263): tp_repr
-    <334>   DW_AT_decl_file   : (data1) 11
-    <335>   DW_AT_decl_line   : (data1) 190
-    <336>   DW_AT_decl_column : (data1) 14
-    <337>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
-    <33b>   DW_AT_data_member_location: (data1) 88
- <2><33c>: Abbrev Number: 17 (DW_TAG_member)
-    <33d>   DW_AT_name        : (strp) (offset: 0x2604): tp_as_number
-    <341>   DW_AT_decl_file   : (data1) 11
-    <342>   DW_AT_decl_line   : (data1) 194
-    <343>   DW_AT_decl_column : (data1) 22
-    <344>   DW_AT_type        : (ref4) <0xd85>, PyNumberMethods
-    <348>   DW_AT_data_member_location: (data1) 96
- <2><349>: Abbrev Number: 17 (DW_TAG_member)
-    <34a>   DW_AT_name        : (strp) (offset: 0x254): tp_as_sequence
-    <34e>   DW_AT_decl_file   : (data1) 11
-    <34f>   DW_AT_decl_line   : (data1) 195
-    <350>   DW_AT_decl_column : (data1) 24
-    <351>   DW_AT_type        : (ref4) <0xd8b>, PySequenceMethods
-    <355>   DW_AT_data_member_location: (data1) 104
- <2><356>: Abbrev Number: 17 (DW_TAG_member)
-    <357>   DW_AT_name        : (strp) (offset: 0x1178): tp_as_mapping
-    <35b>   DW_AT_decl_file   : (data1) 11
-    <35c>   DW_AT_decl_line   : (data1) 196
-    <35d>   DW_AT_decl_column : (data1) 23
-    <35e>   DW_AT_type        : (ref4) <0xd91>, PyMappingMethods
-    <362>   DW_AT_data_member_location: (data1) 112
- <2><363>: Abbrev Number: 17 (DW_TAG_member)
-    <364>   DW_AT_name        : (strp) (offset: 0xcc2): tp_hash
-    <368>   DW_AT_decl_file   : (data1) 11
-    <369>   DW_AT_decl_line   : (data1) 200
-    <36a>   DW_AT_decl_column : (data1) 14
-    <36b>   DW_AT_type        : (ref4) <0x7ff>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
-    <36f>   DW_AT_data_member_location: (data1) 120
- <2><370>: Abbrev Number: 17 (DW_TAG_member)
-    <371>   DW_AT_name        : (strp) (offset: 0x18aa): tp_call
-    <375>   DW_AT_decl_file   : (data1) 11
-    <376>   DW_AT_decl_line   : (data1) 201
-    <377>   DW_AT_decl_column : (data1) 17
-    <378>   DW_AT_type        : (ref4) <0x5f0>, ternaryfunc, PyObject, _object
-    <37c>   DW_AT_data_member_location: (data1) 128
- <2><37d>: Abbrev Number: 17 (DW_TAG_member)
-    <37e>   DW_AT_name        : (strp) (offset: 0x12ca): tp_str
-    <382>   DW_AT_decl_file   : (data1) 11
-    <383>   DW_AT_decl_line   : (data1) 202
-    <384>   DW_AT_decl_column : (data1) 14
-    <385>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
-    <389>   DW_AT_data_member_location: (data1) 136
- <2><38a>: Abbrev Number: 17 (DW_TAG_member)
-    <38b>   DW_AT_name        : (strp) (offset: 0xe47): tp_getattro
-    <38f>   DW_AT_decl_file   : (data1) 11
-    <390>   DW_AT_decl_line   : (data1) 203
-    <391>   DW_AT_decl_column : (data1) 18
-    <392>   DW_AT_type        : (ref4) <0x7b0>, getattrofunc, PyObject, _object
-    <396>   DW_AT_data_member_location: (data1) 144
- <2><397>: Abbrev Number: 17 (DW_TAG_member)
-    <398>   DW_AT_name        : (strp) (offset: 0x1bd2): tp_setattro
-    <39c>   DW_AT_decl_file   : (data1) 11
-    <39d>   DW_AT_decl_line   : (data1) 204
-    <39e>   DW_AT_decl_column : (data1) 18
-    <39f>   DW_AT_type        : (ref4) <0x7e7>, setattrofunc, int
-    <3a3>   DW_AT_data_member_location: (data1) 152
- <2><3a4>: Abbrev Number: 17 (DW_TAG_member)
-    <3a5>   DW_AT_name        : (strp) (offset: 0x2175): tp_as_buffer
+    <12f>   DW_AT_decl_line   : (data2) 259
+    <131>   DW_AT_decl_column : (data1) 9
+    <132>   DW_AT_type        : (ref4) <0x93>, char
+    <136>   DW_AT_data_member_location: (data1) 64
+ <2><137>: Abbrev Number: 10 (DW_TAG_member)
+    <138>   DW_AT_name        : (strp) (offset: 0xc66): _IO_save_base
+    <13c>   DW_AT_decl_file   : (data1) 6
+    <13d>   DW_AT_decl_line   : (data2) 261
+    <13f>   DW_AT_decl_column : (data1) 9
+    <140>   DW_AT_type        : (ref4) <0x93>, char
+    <144>   DW_AT_data_member_location: (data1) 72
+ <2><145>: Abbrev Number: 10 (DW_TAG_member)
+    <146>   DW_AT_name        : (strp) (offset: 0x1a80): _IO_backup_base
+    <14a>   DW_AT_decl_file   : (data1) 6
+    <14b>   DW_AT_decl_line   : (data2) 262
+    <14d>   DW_AT_decl_column : (data1) 9
+    <14e>   DW_AT_type        : (ref4) <0x93>, char
+    <152>   DW_AT_data_member_location: (data1) 80
+ <2><153>: Abbrev Number: 10 (DW_TAG_member)
+    <154>   DW_AT_name        : (strp) (offset: 0x1003): _IO_save_end
+    <158>   DW_AT_decl_file   : (data1) 6
+    <159>   DW_AT_decl_line   : (data2) 263
+    <15b>   DW_AT_decl_column : (data1) 9
+    <15c>   DW_AT_type        : (ref4) <0x93>, char
+    <160>   DW_AT_data_member_location: (data1) 88
+ <2><161>: Abbrev Number: 10 (DW_TAG_member)
+    <162>   DW_AT_name        : (strp) (offset: 0x171d): _markers
+    <166>   DW_AT_decl_file   : (data1) 6
+    <167>   DW_AT_decl_line   : (data2) 265
+    <169>   DW_AT_decl_column : (data1) 22
+    <16a>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
+    <16e>   DW_AT_data_member_location: (data1) 96
+ <2><16f>: Abbrev Number: 10 (DW_TAG_member)
+    <170>   DW_AT_name        : (strp) (offset: 0x77a): _chain
+    <174>   DW_AT_decl_file   : (data1) 6
+    <175>   DW_AT_decl_line   : (data2) 267
+    <177>   DW_AT_decl_column : (data1) 20
+    <178>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
+    <17c>   DW_AT_data_member_location: (data1) 104
+ <2><17d>: Abbrev Number: 10 (DW_TAG_member)
+    <17e>   DW_AT_name        : (strp) (offset: 0x27): _fileno
+    <182>   DW_AT_decl_file   : (data1) 6
+    <183>   DW_AT_decl_line   : (data2) 269
+    <185>   DW_AT_decl_column : (data1) 7
+    <186>   DW_AT_type        : (ref4) <0x5f>, int
+    <18a>   DW_AT_data_member_location: (data1) 112
+ <2><18b>: Abbrev Number: 10 (DW_TAG_member)
+    <18c>   DW_AT_name        : (strp) (offset: 0x1c2f): _flags2
+    <190>   DW_AT_decl_file   : (data1) 6
+    <191>   DW_AT_decl_line   : (data2) 273
+    <193>   DW_AT_decl_column : (data1) 7
+    <194>   DW_AT_type        : (ref4) <0x5f>, int
+    <198>   DW_AT_data_member_location: (data1) 116
+ <2><199>: Abbrev Number: 10 (DW_TAG_member)
+    <19a>   DW_AT_name        : (strp) (offset: 0x1bb3): _old_offset
+    <19e>   DW_AT_decl_file   : (data1) 6
+    <19f>   DW_AT_decl_line   : (data2) 275
+    <1a1>   DW_AT_decl_column : (data1) 13
+    <1a2>   DW_AT_type        : (ref4) <0x6d>, __off_t, long int
+    <1a6>   DW_AT_data_member_location: (data1) 120
+ <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
+    <1a8>   DW_AT_name        : (strp) (offset: 0x19ee): _cur_column
+    <1ac>   DW_AT_decl_file   : (data1) 6
+    <1ad>   DW_AT_decl_line   : (data2) 279
+    <1af>   DW_AT_decl_column : (data1) 18
+    <1b0>   DW_AT_type        : (ref4) <0x43>, short unsigned int
+    <1b4>   DW_AT_data_member_location: (data1) 128
+ <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
+    <1b6>   DW_AT_name        : (strp) (offset: 0x1e0e): _vtable_offset
+    <1ba>   DW_AT_decl_file   : (data1) 6
+    <1bb>   DW_AT_decl_line   : (data2) 280
+    <1bd>   DW_AT_decl_column : (data1) 15
+    <1be>   DW_AT_type        : (ref4) <0x51>, signed char
+    <1c2>   DW_AT_data_member_location: (data1) 130
+ <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
+    <1c4>   DW_AT_name        : (strp) (offset: 0x1b7): _shortbuf
+    <1c8>   DW_AT_decl_file   : (data1) 6
+    <1c9>   DW_AT_decl_line   : (data2) 281
+    <1cb>   DW_AT_decl_column : (data1) 8
+    <1cc>   DW_AT_type        : (ref4) <0x299>, char
+    <1d0>   DW_AT_data_member_location: (data1) 131
+ <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
+    <1d2>   DW_AT_name        : (strp) (offset: 0x2d0): _lock
+    <1d6>   DW_AT_decl_file   : (data1) 6
+    <1d7>   DW_AT_decl_line   : (data2) 285
+    <1d9>   DW_AT_decl_column : (data1) 15
+    <1da>   DW_AT_type        : (ref4) <0x2a9>, _IO_lock_t
+    <1de>   DW_AT_data_member_location: (data1) 136
+ <2><1df>: Abbrev Number: 10 (DW_TAG_member)
+    <1e0>   DW_AT_name        : (strp) (offset: 0x1bb7): _offset
+    <1e4>   DW_AT_decl_file   : (data1) 6
+    <1e5>   DW_AT_decl_line   : (data2) 294
+    <1e7>   DW_AT_decl_column : (data1) 15
+    <1e8>   DW_AT_type        : (ref4) <0x79>, __off64_t, long int
+    <1ec>   DW_AT_data_member_location: (data1) 144
+ <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
+    <1ee>   DW_AT_name        : (strp) (offset: 0x16d6): __pad1
+    <1f2>   DW_AT_decl_file   : (data1) 6
+    <1f3>   DW_AT_decl_line   : (data2) 303
+    <1f5>   DW_AT_decl_column : (data1) 9
+    <1f6>   DW_AT_type        : (ref4) <0x85>
+    <1fa>   DW_AT_data_member_location: (data1) 152
+ <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
+    <1fc>   DW_AT_name        : (strp) (offset: 0xd18): __pad2
+    <200>   DW_AT_decl_file   : (data1) 6
+    <201>   DW_AT_decl_line   : (data2) 304
+    <203>   DW_AT_decl_column : (data1) 9
+    <204>   DW_AT_type        : (ref4) <0x85>
+    <208>   DW_AT_data_member_location: (data1) 160
+ <2><209>: Abbrev Number: 10 (DW_TAG_member)
+    <20a>   DW_AT_name        : (strp) (offset: 0x16dd): __pad3
+    <20e>   DW_AT_decl_file   : (data1) 6
+    <20f>   DW_AT_decl_line   : (data2) 305
+    <211>   DW_AT_decl_column : (data1) 9
+    <212>   DW_AT_type        : (ref4) <0x85>
+    <216>   DW_AT_data_member_location: (data1) 168
+ <2><217>: Abbrev Number: 10 (DW_TAG_member)
+    <218>   DW_AT_name        : (strp) (offset: 0x16e4): __pad4
+    <21c>   DW_AT_decl_file   : (data1) 6
+    <21d>   DW_AT_decl_line   : (data2) 306
+    <21f>   DW_AT_decl_column : (data1) 9
+    <220>   DW_AT_type        : (ref4) <0x85>
+    <224>   DW_AT_data_member_location: (data1) 176
+ <2><225>: Abbrev Number: 10 (DW_TAG_member)
+    <226>   DW_AT_name        : (strp) (offset: 0x16eb): __pad5
+    <22a>   DW_AT_decl_file   : (data1) 6
+    <22b>   DW_AT_decl_line   : (data2) 307
+    <22d>   DW_AT_decl_column : (data1) 10
+    <22e>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
+    <232>   DW_AT_data_member_location: (data1) 184
+ <2><233>: Abbrev Number: 10 (DW_TAG_member)
+    <234>   DW_AT_name        : (strp) (offset: 0x1220): _mode
+    <238>   DW_AT_decl_file   : (data1) 6
+    <239>   DW_AT_decl_line   : (data2) 309
+    <23b>   DW_AT_decl_column : (data1) 7
+    <23c>   DW_AT_type        : (ref4) <0x5f>, int
+    <240>   DW_AT_data_member_location: (data1) 192
+ <2><241>: Abbrev Number: 10 (DW_TAG_member)
+    <242>   DW_AT_name        : (strp) (offset: 0x1e): _unused2
+    <246>   DW_AT_decl_file   : (data1) 6
+    <247>   DW_AT_decl_line   : (data2) 311
+    <249>   DW_AT_decl_column : (data1) 8
+    <24a>   DW_AT_type        : (ref4) <0x2af>, char
+    <24e>   DW_AT_data_member_location: (data1) 196
+ <2><24f>: Abbrev Number: 0
+ <1><250>: Abbrev Number: 11 (DW_TAG_typedef)
+    <251>   DW_AT_name        : (strp) (offset: 0x81a): _IO_lock_t
+    <255>   DW_AT_decl_file   : (data1) 6
+    <256>   DW_AT_decl_line   : (data1) 155
+    <257>   DW_AT_decl_column : (data1) 14
+ <1><258>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <259>   DW_AT_name        : (strp) (offset: 0x12b5): _IO_marker
+    <25d>   DW_AT_byte_size   : (data1) 24
+    <25e>   DW_AT_decl_file   : (data1) 6
+    <25f>   DW_AT_decl_line   : (data1) 161
+    <260>   DW_AT_decl_column : (data1) 8
+    <261>   DW_AT_sibling     : (ref4) <0x28d>
+ <2><265>: Abbrev Number: 9 (DW_TAG_member)
+    <266>   DW_AT_name        : (strp) (offset: 0xd7b): _next
+    <26a>   DW_AT_decl_file   : (data1) 6
+    <26b>   DW_AT_decl_line   : (data1) 162
+    <26c>   DW_AT_decl_column : (data1) 22
+    <26d>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
+    <271>   DW_AT_data_member_location: (data1) 0
+ <2><272>: Abbrev Number: 9 (DW_TAG_member)
+    <273>   DW_AT_name        : (strp) (offset: 0xffd): _sbuf
+    <277>   DW_AT_decl_file   : (data1) 6
+    <278>   DW_AT_decl_line   : (data1) 163
+    <279>   DW_AT_decl_column : (data1) 20
+    <27a>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
+    <27e>   DW_AT_data_member_location: (data1) 8
+ <2><27f>: Abbrev Number: 9 (DW_TAG_member)
+    <280>   DW_AT_name        : (strp) (offset: 0x1726): _pos
+    <284>   DW_AT_decl_file   : (data1) 6
+    <285>   DW_AT_decl_line   : (data1) 167
+    <286>   DW_AT_decl_column : (data1) 7
+    <287>   DW_AT_type        : (ref4) <0x5f>, int
+    <28b>   DW_AT_data_member_location: (data1) 16
+ <2><28c>: Abbrev Number: 0
+ <1><28d>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <28e>   DW_AT_byte_size   : (data1) 8
+    <28f>   DW_AT_type        : (ref4) <0x258>, _IO_marker
+ <1><293>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <294>   DW_AT_byte_size   : (data1) 8
+    <295>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
+ <1><299>: Abbrev Number: 12 (DW_TAG_array_type)
+    <29a>   DW_AT_type        : (ref4) <0x99>, char
+    <29e>   DW_AT_sibling     : (ref4) <0x2a9>
+ <2><2a2>: Abbrev Number: 13 (DW_TAG_subrange_type)
+    <2a3>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <2a7>   DW_AT_upper_bound : (data1) 0
+ <2><2a8>: Abbrev Number: 0
+ <1><2a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <2aa>   DW_AT_byte_size   : (data1) 8
+    <2ab>   DW_AT_type        : (ref4) <0x250>, _IO_lock_t
+ <1><2af>: Abbrev Number: 12 (DW_TAG_array_type)
+    <2b0>   DW_AT_type        : (ref4) <0x99>, char
+    <2b4>   DW_AT_sibling     : (ref4) <0x2bf>
+ <2><2b8>: Abbrev Number: 13 (DW_TAG_subrange_type)
+    <2b9>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <2bd>   DW_AT_upper_bound : (data1) 19
+ <2><2be>: Abbrev Number: 0
+ <1><2bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <2c0>   DW_AT_byte_size   : (data1) 8
+    <2c1>   DW_AT_type        : (ref4) <0xa0>, char
+ <1><2c5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2c6>   DW_AT_name        : (strp) (offset: 0xe10): ssize_t
+    <2ca>   DW_AT_decl_file   : (data1) 5
+    <2cb>   DW_AT_decl_line   : (data1) 102
+    <2cc>   DW_AT_decl_column : (data1) 19
+    <2cd>   DW_AT_type        : (ref4) <0x87>, __ssize_t, long int
+ <1><2d1>: Abbrev Number: 14 (DW_TAG_typedef)
+    <2d2>   DW_AT_name        : (strp) (offset: 0x118a): wchar_t
+    <2d6>   DW_AT_decl_file   : (data1) 3
+    <2d7>   DW_AT_decl_line   : (data2) 321
+    <2d9>   DW_AT_decl_column : (data1) 24
+    <2da>   DW_AT_type        : (ref4) <0x5f>, int
+ <1><2de>: Abbrev Number: 3 (DW_TAG_base_type)
+    <2df>   DW_AT_byte_size   : (data1) 8
+    <2e0>   DW_AT_encoding    : (data1) 5	(signed)
+    <2e1>   DW_AT_name        : (strp) (offset: 0x1bff): long long int
+ <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2e6>   DW_AT_name        : (strp) (offset: 0x908): int64_t
+    <2ea>   DW_AT_decl_file   : (data1) 7
+    <2eb>   DW_AT_decl_line   : (data1) 197
+    <2ec>   DW_AT_decl_column : (data1) 1
+    <2ed>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><2f1>: Abbrev Number: 3 (DW_TAG_base_type)
+    <2f2>   DW_AT_byte_size   : (data1) 8
+    <2f3>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <2f4>   DW_AT_name        : (strp) (offset: 0x19c7): long long unsigned int
+ <1><2f8>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2f9>   DW_AT_name        : (strp) (offset: 0x1382): uint32_t
+    <2fd>   DW_AT_decl_file   : (data1) 8
+    <2fe>   DW_AT_decl_line   : (data1) 51
+    <2ff>   DW_AT_decl_column : (data1) 23
+    <300>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+ <1><304>: Abbrev Number: 2 (DW_TAG_typedef)
+    <305>   DW_AT_name        : (strp) (offset: 0x907): uint64_t
+    <309>   DW_AT_decl_file   : (data1) 8
+    <30a>   DW_AT_decl_line   : (data1) 55
+    <30b>   DW_AT_decl_column : (data1) 27
+    <30c>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+ <1><310>: Abbrev Number: 2 (DW_TAG_typedef)
+    <311>   DW_AT_name        : (strp) (offset: 0x1ba8): Py_ssize_t
+    <315>   DW_AT_decl_file   : (data1) 9
+    <316>   DW_AT_decl_line   : (data1) 105
+    <317>   DW_AT_decl_column : (data1) 25
+    <318>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
+ <1><31c>: Abbrev Number: 7 (DW_TAG_const_type)
+    <31d>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><321>: Abbrev Number: 2 (DW_TAG_typedef)
+    <322>   DW_AT_name        : (strp) (offset: 0xd64): Py_hash_t
+    <326>   DW_AT_decl_file   : (data1) 9
+    <327>   DW_AT_decl_line   : (data1) 114
+    <328>   DW_AT_decl_column : (data1) 20
+    <329>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><32d>: Abbrev Number: 3 (DW_TAG_base_type)
+    <32e>   DW_AT_byte_size   : (data1) 4
+    <32f>   DW_AT_encoding    : (data1) 4	(float)
+    <330>   DW_AT_name        : (strp) (offset: 0x1319): float
+ <1><334>: Abbrev Number: 3 (DW_TAG_base_type)
+    <335>   DW_AT_byte_size   : (data1) 8
+    <336>   DW_AT_encoding    : (data1) 4	(float)
+    <337>   DW_AT_name        : (strp) (offset: 0x3a0): double
+ <1><33b>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <33c>   DW_AT_name        : (strp) (offset: 0x1b68): timezone
+    <340>   DW_AT_byte_size   : (data1) 8
+    <341>   DW_AT_decl_file   : (data1) 10
+    <342>   DW_AT_decl_line   : (data1) 56
+    <343>   DW_AT_decl_column : (data1) 8
+    <344>   DW_AT_sibling     : (ref4) <0x363>
+ <2><348>: Abbrev Number: 9 (DW_TAG_member)
+    <349>   DW_AT_name        : (strp) (offset: 0x1e9f): tz_minuteswest
+    <34d>   DW_AT_decl_file   : (data1) 10
+    <34e>   DW_AT_decl_line   : (data1) 58
+    <34f>   DW_AT_decl_column : (data1) 9
+    <350>   DW_AT_type        : (ref4) <0x5f>, int
+    <354>   DW_AT_data_member_location: (data1) 0
+ <2><355>: Abbrev Number: 9 (DW_TAG_member)
+    <356>   DW_AT_name        : (strp) (offset: 0x1247): tz_dsttime
+    <35a>   DW_AT_decl_file   : (data1) 10
+    <35b>   DW_AT_decl_line   : (data1) 59
+    <35c>   DW_AT_decl_column : (data1) 9
+    <35d>   DW_AT_type        : (ref4) <0x5f>, int
+    <361>   DW_AT_data_member_location: (data1) 4
+ <2><362>: Abbrev Number: 0
+ <1><363>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <364>   DW_AT_byte_size   : (data1) 8
+    <365>   DW_AT_type        : (ref4) <0x33b>, timezone
+ <1><369>: Abbrev Number: 15 (DW_TAG_restrict_type)
+    <36a>   DW_AT_type        : (ref4) <0x363>, timezone
+ <1><36e>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <36f>   DW_AT_name        : (strp) (offset: 0x49f): _object
+    <373>   DW_AT_byte_size   : (data1) 16
+    <374>   DW_AT_decl_file   : (data1) 2
+    <375>   DW_AT_decl_line   : (data1) 104
+    <376>   DW_AT_decl_column : (data1) 16
+    <377>   DW_AT_sibling     : (ref4) <0x396>
+ <2><37b>: Abbrev Number: 9 (DW_TAG_member)
+    <37c>   DW_AT_name        : (strp) (offset: 0xf5): ob_refcnt
+    <380>   DW_AT_decl_file   : (data1) 2
+    <381>   DW_AT_decl_line   : (data1) 106
+    <382>   DW_AT_decl_column : (data1) 16
+    <383>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <387>   DW_AT_data_member_location: (data1) 0
+ <2><388>: Abbrev Number: 9 (DW_TAG_member)
+    <389>   DW_AT_name        : (strp) (offset: 0x4dd): ob_type
+    <38d>   DW_AT_decl_file   : (data1) 2
+    <38e>   DW_AT_decl_line   : (data1) 107
+    <38f>   DW_AT_decl_column : (data1) 25
+    <390>   DW_AT_type        : (ref4) <0x646>, _typeobject
+    <394>   DW_AT_data_member_location: (data1) 8
+ <2><395>: Abbrev Number: 0
+ <1><396>: Abbrev Number: 16 (DW_TAG_structure_type)
+    <397>   DW_AT_name        : (strp) (offset: 0x326): _typeobject
+    <39b>   DW_AT_byte_size   : (data2) 416
+    <39d>   DW_AT_decl_file   : (data1) 11
+    <39e>   DW_AT_decl_line   : (data1) 177
+    <39f>   DW_AT_decl_column : (data1) 16
+    <3a0>   DW_AT_sibling     : (ref4) <0x646>
+ <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
+    <3a5>   DW_AT_name        : (strp) (offset: 0x699): ob_base
     <3a9>   DW_AT_decl_file   : (data1) 11
-    <3aa>   DW_AT_decl_line   : (data1) 207
-    <3ab>   DW_AT_decl_column : (data1) 20
-    <3ac>   DW_AT_type        : (ref4) <0xd97>, PyBufferProcs
-    <3b0>   DW_AT_data_member_location: (data1) 160
- <2><3b1>: Abbrev Number: 17 (DW_TAG_member)
-    <3b2>   DW_AT_name        : (strp) (offset: 0x1523): tp_flags
+    <3aa>   DW_AT_decl_line   : (data1) 178
+    <3ab>   DW_AT_decl_column : (data1) 5
+    <3ac>   DW_AT_type        : (ref4) <0x67c>, PyVarObject
+    <3b0>   DW_AT_data_member_location: (data1) 0
+ <2><3b1>: Abbrev Number: 9 (DW_TAG_member)
+    <3b2>   DW_AT_name        : (strp) (offset: 0x103a): tp_name
     <3b6>   DW_AT_decl_file   : (data1) 11
-    <3b7>   DW_AT_decl_line   : (data1) 210
-    <3b8>   DW_AT_decl_column : (data1) 19
-    <3b9>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
-    <3bd>   DW_AT_data_member_location: (data1) 168
- <2><3be>: Abbrev Number: 17 (DW_TAG_member)
-    <3bf>   DW_AT_name        : (strp) (offset: 0x988): tp_doc
+    <3b7>   DW_AT_decl_line   : (data1) 179
+    <3b8>   DW_AT_decl_column : (data1) 17
+    <3b9>   DW_AT_type        : (ref4) <0x2bf>, char
+    <3bd>   DW_AT_data_member_location: (data1) 24
+ <2><3be>: Abbrev Number: 9 (DW_TAG_member)
+    <3bf>   DW_AT_name        : (strp) (offset: 0x1e47): tp_basicsize
     <3c3>   DW_AT_decl_file   : (data1) 11
-    <3c4>   DW_AT_decl_line   : (data1) 212
-    <3c5>   DW_AT_decl_column : (data1) 17
-    <3c6>   DW_AT_type        : (ref4) <0xe0>, char
-    <3ca>   DW_AT_data_member_location: (data1) 176
- <2><3cb>: Abbrev Number: 17 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0x10c2): tp_traverse
+    <3c4>   DW_AT_decl_line   : (data1) 180
+    <3c5>   DW_AT_decl_column : (data1) 16
+    <3c6>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3ca>   DW_AT_data_member_location: (data1) 32
+ <2><3cb>: Abbrev Number: 9 (DW_TAG_member)
+    <3cc>   DW_AT_name        : (strp) (offset: 0x249): tp_itemsize
     <3d0>   DW_AT_decl_file   : (data1) 11
-    <3d1>   DW_AT_decl_line   : (data1) 216
-    <3d2>   DW_AT_decl_column : (data1) 18
-    <3d3>   DW_AT_type        : (ref4) <0x725>, traverseproc, int
-    <3d7>   DW_AT_data_member_location: (data1) 184
- <2><3d8>: Abbrev Number: 17 (DW_TAG_member)
-    <3d9>   DW_AT_name        : (strp) (offset: 0x1893): tp_clear
+    <3d1>   DW_AT_decl_line   : (data1) 180
+    <3d2>   DW_AT_decl_column : (data1) 30
+    <3d3>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3d7>   DW_AT_data_member_location: (data1) 40
+ <2><3d8>: Abbrev Number: 9 (DW_TAG_member)
+    <3d9>   DW_AT_name        : (strp) (offset: 0x31b): tp_dealloc
     <3dd>   DW_AT_decl_file   : (data1) 11
-    <3de>   DW_AT_decl_line   : (data1) 219
-    <3df>   DW_AT_decl_column : (data1) 13
-    <3e0>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
-    <3e4>   DW_AT_data_member_location: (data1) 192
- <2><3e5>: Abbrev Number: 17 (DW_TAG_member)
-    <3e6>   DW_AT_name        : (strp) (offset: 0x187): tp_richcompare
+    <3de>   DW_AT_decl_line   : (data1) 184
+    <3df>   DW_AT_decl_column : (data1) 16
+    <3e0>   DW_AT_type        : (ref4) <0x857>, destructor
+    <3e4>   DW_AT_data_member_location: (data1) 48
+ <2><3e5>: Abbrev Number: 9 (DW_TAG_member)
+    <3e6>   DW_AT_name        : (strp) (offset: 0x1357): tp_vectorcall_offset
     <3ea>   DW_AT_decl_file   : (data1) 11
-    <3eb>   DW_AT_decl_line   : (data1) 223
-    <3ec>   DW_AT_decl_column : (data1) 17
-    <3ed>   DW_AT_type        : (ref4) <0x820>, richcmpfunc, PyObject, _object
-    <3f1>   DW_AT_data_member_location: (data1) 200
- <2><3f2>: Abbrev Number: 17 (DW_TAG_member)
-    <3f3>   DW_AT_name        : (strp) (offset: 0x523): tp_weaklistoffset
+    <3eb>   DW_AT_decl_line   : (data1) 185
+    <3ec>   DW_AT_decl_column : (data1) 16
+    <3ed>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3f1>   DW_AT_data_member_location: (data1) 56
+ <2><3f2>: Abbrev Number: 9 (DW_TAG_member)
+    <3f3>   DW_AT_name        : (strp) (offset: 0xbe): tp_getattr
     <3f7>   DW_AT_decl_file   : (data1) 11
-    <3f8>   DW_AT_decl_line   : (data1) 226
-    <3f9>   DW_AT_decl_column : (data1) 16
-    <3fa>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <3fe>   DW_AT_data_member_location: (data1) 208
- <2><3ff>: Abbrev Number: 17 (DW_TAG_member)
-    <400>   DW_AT_name        : (strp) (offset: 0x797): tp_iter
+    <3f8>   DW_AT_decl_line   : (data1) 186
+    <3f9>   DW_AT_decl_column : (data1) 17
+    <3fa>   DW_AT_type        : (ref4) <0x874>, getattrfunc, PyObject, _object
+    <3fe>   DW_AT_data_member_location: (data1) 64
+ <2><3ff>: Abbrev Number: 9 (DW_TAG_member)
+    <400>   DW_AT_name        : (strp) (offset: 0x799): tp_setattr
     <404>   DW_AT_decl_file   : (data1) 11
-    <405>   DW_AT_decl_line   : (data1) 229
+    <405>   DW_AT_decl_line   : (data1) 187
     <406>   DW_AT_decl_column : (data1) 17
-    <407>   DW_AT_type        : (ref4) <0x84b>, getiterfunc, PyObject, _object
-    <40b>   DW_AT_data_member_location: (data1) 216
- <2><40c>: Abbrev Number: 17 (DW_TAG_member)
-    <40d>   DW_AT_name        : (strp) (offset: 0x1887): tp_iternext
+    <407>   DW_AT_type        : (ref4) <0x8a6>, setattrfunc, int
+    <40b>   DW_AT_data_member_location: (data1) 72
+ <2><40c>: Abbrev Number: 9 (DW_TAG_member)
+    <40d>   DW_AT_name        : (strp) (offset: 0x13b): tp_as_async
     <411>   DW_AT_decl_file   : (data1) 11
-    <412>   DW_AT_decl_line   : (data1) 230
-    <413>   DW_AT_decl_column : (data1) 18
-    <414>   DW_AT_type        : (ref4) <0x857>, iternextfunc, PyObject, _object
-    <418>   DW_AT_data_member_location: (data1) 224
- <2><419>: Abbrev Number: 17 (DW_TAG_member)
-    <41a>   DW_AT_name        : (strp) (offset: 0x401): tp_methods
+    <412>   DW_AT_decl_line   : (data1) 188
+    <413>   DW_AT_decl_column : (data1) 21
+    <414>   DW_AT_type        : (ref4) <0xe44>, PyAsyncMethods
+    <418>   DW_AT_data_member_location: (data1) 80
+ <2><419>: Abbrev Number: 9 (DW_TAG_member)
+    <41a>   DW_AT_name        : (strp) (offset: 0x1b71): tp_repr
     <41e>   DW_AT_decl_file   : (data1) 11
-    <41f>   DW_AT_decl_line   : (data1) 233
-    <420>   DW_AT_decl_column : (data1) 25
-    <421>   DW_AT_type        : (ref4) <0xddf>, PyMethodDef
-    <425>   DW_AT_data_member_location: (data1) 232
- <2><426>: Abbrev Number: 17 (DW_TAG_member)
-    <427>   DW_AT_name        : (strp) (offset: 0x1a7a): tp_members
+    <41f>   DW_AT_decl_line   : (data1) 190
+    <420>   DW_AT_decl_column : (data1) 14
+    <421>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
+    <425>   DW_AT_data_member_location: (data1) 88
+ <2><426>: Abbrev Number: 9 (DW_TAG_member)
+    <427>   DW_AT_name        : (strp) (offset: 0x13e3): tp_as_number
     <42b>   DW_AT_decl_file   : (data1) 11
-    <42c>   DW_AT_decl_line   : (data1) 234
-    <42d>   DW_AT_decl_column : (data1) 25
-    <42e>   DW_AT_type        : (ref4) <0xdea>, PyMemberDef
-    <432>   DW_AT_data_member_location: (data1) 240
- <2><433>: Abbrev Number: 17 (DW_TAG_member)
-    <434>   DW_AT_name        : (strp) (offset: 0x20c9): tp_getset
+    <42c>   DW_AT_decl_line   : (data1) 194
+    <42d>   DW_AT_decl_column : (data1) 22
+    <42e>   DW_AT_type        : (ref4) <0xe4a>, PyNumberMethods
+    <432>   DW_AT_data_member_location: (data1) 96
+ <2><433>: Abbrev Number: 9 (DW_TAG_member)
+    <434>   DW_AT_name        : (strp) (offset: 0x1094): tp_as_sequence
     <438>   DW_AT_decl_file   : (data1) 11
-    <439>   DW_AT_decl_line   : (data1) 235
-    <43a>   DW_AT_decl_column : (data1) 25
-    <43b>   DW_AT_type        : (ref4) <0xe3f>, PyGetSetDef
-    <43f>   DW_AT_data_member_location: (data1) 248
- <2><440>: Abbrev Number: 19 (DW_TAG_member)
-    <441>   DW_AT_name        : (strp) (offset: 0xb32): tp_base
+    <439>   DW_AT_decl_line   : (data1) 195
+    <43a>   DW_AT_decl_column : (data1) 24
+    <43b>   DW_AT_type        : (ref4) <0xe50>, PySequenceMethods
+    <43f>   DW_AT_data_member_location: (data1) 104
+ <2><440>: Abbrev Number: 9 (DW_TAG_member)
+    <441>   DW_AT_name        : (strp) (offset: 0xa3e): tp_as_mapping
     <445>   DW_AT_decl_file   : (data1) 11
-    <446>   DW_AT_decl_line   : (data1) 236
-    <447>   DW_AT_decl_column : (data1) 25
-    <448>   DW_AT_type        : (ref4) <0x55c>, _typeobject
-    <44c>   DW_AT_data_member_location: (data2) 256
- <2><44e>: Abbrev Number: 19 (DW_TAG_member)
-    <44f>   DW_AT_name        : (strp) (offset: 0x101e): tp_dict
-    <453>   DW_AT_decl_file   : (data1) 11
-    <454>   DW_AT_decl_line   : (data1) 237
-    <455>   DW_AT_decl_column : (data1) 15
-    <456>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <45a>   DW_AT_data_member_location: (data2) 264
- <2><45c>: Abbrev Number: 19 (DW_TAG_member)
-    <45d>   DW_AT_name        : (strp) (offset: 0x2a0a): tp_descr_get
-    <461>   DW_AT_decl_file   : (data1) 11
-    <462>   DW_AT_decl_line   : (data1) 238
-    <463>   DW_AT_decl_column : (data1) 18
-    <464>   DW_AT_type        : (ref4) <0x863>, descrgetfunc, PyObject, _object
-    <468>   DW_AT_data_member_location: (data2) 272
- <2><46a>: Abbrev Number: 19 (DW_TAG_member)
-    <46b>   DW_AT_name        : (strp) (offset: 0xf7f): tp_descr_set
-    <46f>   DW_AT_decl_file   : (data1) 11
-    <470>   DW_AT_decl_line   : (data1) 239
-    <471>   DW_AT_decl_column : (data1) 18
-    <472>   DW_AT_type        : (ref4) <0x86f>, descrsetfunc, int
-    <476>   DW_AT_data_member_location: (data2) 280
- <2><478>: Abbrev Number: 19 (DW_TAG_member)
-    <479>   DW_AT_name        : (strp) (offset: 0x2cd9): tp_dictoffset
-    <47d>   DW_AT_decl_file   : (data1) 11
-    <47e>   DW_AT_decl_line   : (data1) 240
-    <47f>   DW_AT_decl_column : (data1) 16
-    <480>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <484>   DW_AT_data_member_location: (data2) 288
- <2><486>: Abbrev Number: 19 (DW_TAG_member)
-    <487>   DW_AT_name        : (strp) (offset: 0x424): tp_init
-    <48b>   DW_AT_decl_file   : (data1) 11
-    <48c>   DW_AT_decl_line   : (data1) 241
-    <48d>   DW_AT_decl_column : (data1) 14
-    <48e>   DW_AT_type        : (ref4) <0x87b>, initproc, int
-    <492>   DW_AT_data_member_location: (data2) 296
- <2><494>: Abbrev Number: 19 (DW_TAG_member)
-    <495>   DW_AT_name        : (strp) (offset: 0x1f92): tp_alloc
-    <499>   DW_AT_decl_file   : (data1) 11
-    <49a>   DW_AT_decl_line   : (data1) 242
-    <49b>   DW_AT_decl_column : (data1) 15
-    <49c>   DW_AT_type        : (ref4) <0x8b2>, allocfunc, PyObject, _object
-    <4a0>   DW_AT_data_member_location: (data2) 304
- <2><4a2>: Abbrev Number: 19 (DW_TAG_member)
-    <4a3>   DW_AT_name        : (strp) (offset: 0x2939): tp_new
-    <4a7>   DW_AT_decl_file   : (data1) 11
-    <4a8>   DW_AT_decl_line   : (data1) 243
-    <4a9>   DW_AT_decl_column : (data1) 13
-    <4aa>   DW_AT_type        : (ref4) <0x887>, newfunc, PyObject, _object
-    <4ae>   DW_AT_data_member_location: (data2) 312
- <2><4b0>: Abbrev Number: 19 (DW_TAG_member)
-    <4b1>   DW_AT_name        : (strp) (offset: 0xac8): tp_free
-    <4b5>   DW_AT_decl_file   : (data1) 11
-    <4b6>   DW_AT_decl_line   : (data1) 244
-    <4b7>   DW_AT_decl_column : (data1) 14
-    <4b8>   DW_AT_type        : (ref4) <0x750>, freefunc
-    <4bc>   DW_AT_data_member_location: (data2) 320
- <2><4be>: Abbrev Number: 19 (DW_TAG_member)
-    <4bf>   DW_AT_name        : (strp) (offset: 0x535): tp_is_gc
-    <4c3>   DW_AT_decl_file   : (data1) 11
-    <4c4>   DW_AT_decl_line   : (data1) 245
-    <4c5>   DW_AT_decl_column : (data1) 13
-    <4c6>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
-    <4ca>   DW_AT_data_member_location: (data2) 328
- <2><4cc>: Abbrev Number: 19 (DW_TAG_member)
-    <4cd>   DW_AT_name        : (strp) (offset: 0x3c8): tp_bases
-    <4d1>   DW_AT_decl_file   : (data1) 11
-    <4d2>   DW_AT_decl_line   : (data1) 246
-    <4d3>   DW_AT_decl_column : (data1) 15
-    <4d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4d8>   DW_AT_data_member_location: (data2) 336
- <2><4da>: Abbrev Number: 19 (DW_TAG_member)
-    <4db>   DW_AT_name        : (strp) (offset: 0x5fe): tp_mro
-    <4df>   DW_AT_decl_file   : (data1) 11
-    <4e0>   DW_AT_decl_line   : (data1) 247
-    <4e1>   DW_AT_decl_column : (data1) 15
-    <4e2>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4e6>   DW_AT_data_member_location: (data2) 344
- <2><4e8>: Abbrev Number: 19 (DW_TAG_member)
-    <4e9>   DW_AT_name        : (strp) (offset: 0x238f): tp_cache
-    <4ed>   DW_AT_decl_file   : (data1) 11
-    <4ee>   DW_AT_decl_line   : (data1) 248
-    <4ef>   DW_AT_decl_column : (data1) 15
-    <4f0>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4f4>   DW_AT_data_member_location: (data2) 352
- <2><4f6>: Abbrev Number: 19 (DW_TAG_member)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x2c62): tp_subclasses
+    <446>   DW_AT_decl_line   : (data1) 196
+    <447>   DW_AT_decl_column : (data1) 23
+    <448>   DW_AT_type        : (ref4) <0xe56>, PyMappingMethods
+    <44c>   DW_AT_data_member_location: (data1) 112
+ <2><44d>: Abbrev Number: 9 (DW_TAG_member)
+    <44e>   DW_AT_name        : (strp) (offset: 0x165a): tp_hash
+    <452>   DW_AT_decl_file   : (data1) 11
+    <453>   DW_AT_decl_line   : (data1) 200
+    <454>   DW_AT_decl_column : (data1) 14
+    <455>   DW_AT_type        : (ref4) <0x8e9>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
+    <459>   DW_AT_data_member_location: (data1) 120
+ <2><45a>: Abbrev Number: 9 (DW_TAG_member)
+    <45b>   DW_AT_name        : (strp) (offset: 0x5e0): tp_call
+    <45f>   DW_AT_decl_file   : (data1) 11
+    <460>   DW_AT_decl_line   : (data1) 201
+    <461>   DW_AT_decl_column : (data1) 17
+    <462>   DW_AT_type        : (ref4) <0x6da>, ternaryfunc, PyObject, _object
+    <466>   DW_AT_data_member_location: (data1) 128
+ <2><467>: Abbrev Number: 9 (DW_TAG_member)
+    <468>   DW_AT_name        : (strp) (offset: 0x625): tp_str
+    <46c>   DW_AT_decl_file   : (data1) 11
+    <46d>   DW_AT_decl_line   : (data1) 202
+    <46e>   DW_AT_decl_column : (data1) 14
+    <46f>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
+    <473>   DW_AT_data_member_location: (data1) 136
+ <2><474>: Abbrev Number: 9 (DW_TAG_member)
+    <475>   DW_AT_name        : (strp) (offset: 0x11ee): tp_getattro
+    <479>   DW_AT_decl_file   : (data1) 11
+    <47a>   DW_AT_decl_line   : (data1) 203
+    <47b>   DW_AT_decl_column : (data1) 18
+    <47c>   DW_AT_type        : (ref4) <0x89a>, getattrofunc, PyObject, _object
+    <480>   DW_AT_data_member_location: (data1) 144
+ <2><481>: Abbrev Number: 9 (DW_TAG_member)
+    <482>   DW_AT_name        : (strp) (offset: 0x1843): tp_setattro
+    <486>   DW_AT_decl_file   : (data1) 11
+    <487>   DW_AT_decl_line   : (data1) 204
+    <488>   DW_AT_decl_column : (data1) 18
+    <489>   DW_AT_type        : (ref4) <0x8d1>, setattrofunc, int
+    <48d>   DW_AT_data_member_location: (data1) 152
+ <2><48e>: Abbrev Number: 9 (DW_TAG_member)
+    <48f>   DW_AT_name        : (strp) (offset: 0x10bb): tp_as_buffer
+    <493>   DW_AT_decl_file   : (data1) 11
+    <494>   DW_AT_decl_line   : (data1) 207
+    <495>   DW_AT_decl_column : (data1) 20
+    <496>   DW_AT_type        : (ref4) <0xe5c>, PyBufferProcs
+    <49a>   DW_AT_data_member_location: (data1) 160
+ <2><49b>: Abbrev Number: 9 (DW_TAG_member)
+    <49c>   DW_AT_name        : (strp) (offset: 0x1cb0): tp_flags
+    <4a0>   DW_AT_decl_file   : (data1) 11
+    <4a1>   DW_AT_decl_line   : (data1) 210
+    <4a2>   DW_AT_decl_column : (data1) 19
+    <4a3>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <4a7>   DW_AT_data_member_location: (data1) 168
+ <2><4a8>: Abbrev Number: 9 (DW_TAG_member)
+    <4a9>   DW_AT_name        : (strp) (offset: 0x149d): tp_doc
+    <4ad>   DW_AT_decl_file   : (data1) 11
+    <4ae>   DW_AT_decl_line   : (data1) 212
+    <4af>   DW_AT_decl_column : (data1) 17
+    <4b0>   DW_AT_type        : (ref4) <0x2bf>, char
+    <4b4>   DW_AT_data_member_location: (data1) 176
+ <2><4b5>: Abbrev Number: 9 (DW_TAG_member)
+    <4b6>   DW_AT_name        : (strp) (offset: 0x17a5): tp_traverse
+    <4ba>   DW_AT_decl_file   : (data1) 11
+    <4bb>   DW_AT_decl_line   : (data1) 216
+    <4bc>   DW_AT_decl_column : (data1) 18
+    <4bd>   DW_AT_type        : (ref4) <0x80f>, traverseproc, int
+    <4c1>   DW_AT_data_member_location: (data1) 184
+ <2><4c2>: Abbrev Number: 9 (DW_TAG_member)
+    <4c3>   DW_AT_name        : (strp) (offset: 0x8f2): tp_clear
+    <4c7>   DW_AT_decl_file   : (data1) 11
+    <4c8>   DW_AT_decl_line   : (data1) 219
+    <4c9>   DW_AT_decl_column : (data1) 13
+    <4ca>   DW_AT_type        : (ref4) <0x705>, inquiry, int
+    <4ce>   DW_AT_data_member_location: (data1) 192
+ <2><4cf>: Abbrev Number: 9 (DW_TAG_member)
+    <4d0>   DW_AT_name        : (strp) (offset: 0x3fd): tp_richcompare
+    <4d4>   DW_AT_decl_file   : (data1) 11
+    <4d5>   DW_AT_decl_line   : (data1) 223
+    <4d6>   DW_AT_decl_column : (data1) 17
+    <4d7>   DW_AT_type        : (ref4) <0x90a>, richcmpfunc, PyObject, _object
+    <4db>   DW_AT_data_member_location: (data1) 200
+ <2><4dc>: Abbrev Number: 9 (DW_TAG_member)
+    <4dd>   DW_AT_name        : (strp) (offset: 0x141b): tp_weaklistoffset
+    <4e1>   DW_AT_decl_file   : (data1) 11
+    <4e2>   DW_AT_decl_line   : (data1) 226
+    <4e3>   DW_AT_decl_column : (data1) 16
+    <4e4>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <4e8>   DW_AT_data_member_location: (data1) 208
+ <2><4e9>: Abbrev Number: 9 (DW_TAG_member)
+    <4ea>   DW_AT_name        : (strp) (offset: 0x18d0): tp_iter
+    <4ee>   DW_AT_decl_file   : (data1) 11
+    <4ef>   DW_AT_decl_line   : (data1) 229
+    <4f0>   DW_AT_decl_column : (data1) 17
+    <4f1>   DW_AT_type        : (ref4) <0x935>, getiterfunc, PyObject, _object
+    <4f5>   DW_AT_data_member_location: (data1) 216
+ <2><4f6>: Abbrev Number: 9 (DW_TAG_member)
+    <4f7>   DW_AT_name        : (strp) (offset: 0x189d): tp_iternext
     <4fb>   DW_AT_decl_file   : (data1) 11
-    <4fc>   DW_AT_decl_line   : (data1) 249
-    <4fd>   DW_AT_decl_column : (data1) 15
-    <4fe>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <502>   DW_AT_data_member_location: (data2) 360
- <2><504>: Abbrev Number: 19 (DW_TAG_member)
-    <505>   DW_AT_name        : (strp) (offset: 0x2114): tp_weaklist
-    <509>   DW_AT_decl_file   : (data1) 11
-    <50a>   DW_AT_decl_line   : (data1) 250
-    <50b>   DW_AT_decl_column : (data1) 15
-    <50c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <510>   DW_AT_data_member_location: (data2) 368
- <2><512>: Abbrev Number: 19 (DW_TAG_member)
-    <513>   DW_AT_name        : (strp) (offset: 0x2886): tp_del
-    <517>   DW_AT_decl_file   : (data1) 11
-    <518>   DW_AT_decl_line   : (data1) 251
-    <519>   DW_AT_decl_column : (data1) 16
-    <51a>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <51e>   DW_AT_data_member_location: (data2) 376
- <2><520>: Abbrev Number: 19 (DW_TAG_member)
-    <521>   DW_AT_name        : (strp) (offset: 0x2323): tp_version_tag
-    <525>   DW_AT_decl_file   : (data1) 11
-    <526>   DW_AT_decl_line   : (data1) 254
-    <527>   DW_AT_decl_column : (data1) 18
-    <528>   DW_AT_type        : (ref4) <0x52>, unsigned int
-    <52c>   DW_AT_data_member_location: (data2) 384
- <2><52e>: Abbrev Number: 20 (DW_TAG_member)
-    <52f>   DW_AT_name        : (strp) (offset: 0x2778): tp_finalize
-    <533>   DW_AT_decl_file   : (data1) 11
-    <534>   DW_AT_decl_line   : (data2) 256
-    <536>   DW_AT_decl_column : (data1) 16
-    <537>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <53b>   DW_AT_data_member_location: (data2) 392
- <2><53d>: Abbrev Number: 20 (DW_TAG_member)
-    <53e>   DW_AT_name        : (strp) (offset: 0x219a): tp_vectorcall
-    <542>   DW_AT_decl_file   : (data1) 11
-    <543>   DW_AT_decl_line   : (data2) 257
-    <545>   DW_AT_decl_column : (data1) 20
-    <546>   DW_AT_type        : (ref4) <0xa18>, vectorcallfunc, PyObject, _object
-    <54a>   DW_AT_data_member_location: (data2) 400
- <2><54c>: Abbrev Number: 20 (DW_TAG_member)
-    <54d>   DW_AT_name        : (strp) (offset: 0x231a): tp_print
-    <551>   DW_AT_decl_file   : (data1) 11
-    <552>   DW_AT_decl_line   : (data2) 260
-    <554>   DW_AT_decl_column : (data1) 30
-    <555>   DW_AT_type        : (ref4) <0xe5e>, int
-    <559>   DW_AT_data_member_location: (data2) 408
- <2><55b>: Abbrev Number: 0
- <1><55c>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <55d>   DW_AT_byte_size   : (data1) 8
-    <55e>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
- <1><562>: Abbrev Number: 5 (DW_TAG_typedef)
-    <563>   DW_AT_name        : (strp) (offset: 0x181a): PyObject
-    <567>   DW_AT_decl_file   : (data1) 2
-    <568>   DW_AT_decl_line   : (data1) 108
-    <569>   DW_AT_decl_column : (data1) 3
-    <56a>   DW_AT_type        : (ref4) <0x284>, _object
- <1><56e>: Abbrev Number: 21 (DW_TAG_structure_type)
-    <56f>   DW_AT_byte_size   : (data1) 24
-    <570>   DW_AT_decl_file   : (data1) 2
-    <571>   DW_AT_decl_line   : (data1) 113
-    <572>   DW_AT_decl_column : (data1) 9
-    <573>   DW_AT_sibling     : (ref4) <0x592>
- <2><577>: Abbrev Number: 17 (DW_TAG_member)
-    <578>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
-    <57c>   DW_AT_decl_file   : (data1) 2
-    <57d>   DW_AT_decl_line   : (data1) 114
-    <57e>   DW_AT_decl_column : (data1) 14
-    <57f>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
-    <583>   DW_AT_data_member_location: (data1) 0
- <2><584>: Abbrev Number: 17 (DW_TAG_member)
-    <585>   DW_AT_name        : (strp) (offset: 0x1812): ob_size
-    <589>   DW_AT_decl_file   : (data1) 2
-    <58a>   DW_AT_decl_line   : (data1) 115
-    <58b>   DW_AT_decl_column : (data1) 16
-    <58c>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <590>   DW_AT_data_member_location: (data1) 16
- <2><591>: Abbrev Number: 0
- <1><592>: Abbrev Number: 5 (DW_TAG_typedef)
-    <593>   DW_AT_name        : (strp) (offset: 0xe8f): PyVarObject
-    <597>   DW_AT_decl_file   : (data1) 2
-    <598>   DW_AT_decl_line   : (data1) 116
-    <599>   DW_AT_decl_column : (data1) 3
-    <59a>   DW_AT_type        : (ref4) <0x56e>
- <1><59e>: Abbrev Number: 5 (DW_TAG_typedef)
-    <59f>   DW_AT_name        : (strp) (offset: 0x10ab): unaryfunc
-    <5a3>   DW_AT_decl_file   : (data1) 2
-    <5a4>   DW_AT_decl_line   : (data1) 140
-    <5a5>   DW_AT_decl_column : (data1) 22
-    <5a6>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
- <1><5aa>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5ab>   DW_AT_byte_size   : (data1) 8
-    <5ac>   DW_AT_type        : (ref4) <0x5b0>, PyObject, _object
- <1><5b0>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <5b1>   DW_AT_prototyped  : (flag_present) 1
-    <5b1>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <5b5>   DW_AT_sibling     : (ref4) <0x5bf>
- <2><5b9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5ba>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5be>: Abbrev Number: 0
- <1><5bf>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5c0>   DW_AT_byte_size   : (data1) 8
-    <5c1>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
- <1><5c5>: Abbrev Number: 3 (DW_TAG_const_type)
-    <5c6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <1><5ca>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5cb>   DW_AT_name        : (strp) (offset: 0x23cb): binaryfunc
-    <5cf>   DW_AT_decl_file   : (data1) 2
-    <5d0>   DW_AT_decl_line   : (data1) 141
-    <5d1>   DW_AT_decl_column : (data1) 22
-    <5d2>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
- <1><5d6>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5d7>   DW_AT_byte_size   : (data1) 8
-    <5d8>   DW_AT_type        : (ref4) <0x5dc>, PyObject, _object
- <1><5dc>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <5dd>   DW_AT_prototyped  : (flag_present) 1
-    <5dd>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <5e1>   DW_AT_sibling     : (ref4) <0x5f0>
- <2><5e5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5e6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5ea>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5eb>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5ef>: Abbrev Number: 0
- <1><5f0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5f1>   DW_AT_name        : (strp) (offset: 0x615): ternaryfunc
-    <5f5>   DW_AT_decl_file   : (data1) 2
-    <5f6>   DW_AT_decl_line   : (data1) 142
-    <5f7>   DW_AT_decl_column : (data1) 22
-    <5f8>   DW_AT_type        : (ref4) <0x5fc>, PyObject, _object
- <1><5fc>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5fd>   DW_AT_byte_size   : (data1) 8
-    <5fe>   DW_AT_type        : (ref4) <0x602>, PyObject, _object
- <1><602>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <603>   DW_AT_prototyped  : (flag_present) 1
-    <603>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <607>   DW_AT_sibling     : (ref4) <0x61b>
- <2><60b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <60c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><610>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <611>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><615>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <616>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><61a>: Abbrev Number: 0
- <1><61b>: Abbrev Number: 5 (DW_TAG_typedef)
-    <61c>   DW_AT_name        : (strp) (offset: 0x18f3): inquiry
-    <620>   DW_AT_decl_file   : (data1) 2
-    <621>   DW_AT_decl_line   : (data1) 143
-    <622>   DW_AT_decl_column : (data1) 15
-    <623>   DW_AT_type        : (ref4) <0x627>, int
- <1><627>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <628>   DW_AT_byte_size   : (data1) 8
-    <629>   DW_AT_type        : (ref4) <0x62d>, int
- <1><62d>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <62e>   DW_AT_prototyped  : (flag_present) 1
-    <62e>   DW_AT_type        : (ref4) <0xe6>, int
-    <632>   DW_AT_sibling     : (ref4) <0x63c>
- <2><636>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <637>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><63b>: Abbrev Number: 0
- <1><63c>: Abbrev Number: 5 (DW_TAG_typedef)
-    <63d>   DW_AT_name        : (strp) (offset: 0xf8c): lenfunc
-    <641>   DW_AT_decl_file   : (data1) 2
-    <642>   DW_AT_decl_line   : (data1) 144
-    <643>   DW_AT_decl_column : (data1) 22
-    <644>   DW_AT_type        : (ref4) <0x648>, Py_ssize_t, ssize_t, long int
- <1><648>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <649>   DW_AT_byte_size   : (data1) 8
-    <64a>   DW_AT_type        : (ref4) <0x64e>, Py_ssize_t, ssize_t, long int
- <1><64e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <64f>   DW_AT_prototyped  : (flag_present) 1
-    <64f>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <653>   DW_AT_sibling     : (ref4) <0x65d>
- <2><657>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <658>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><65c>: Abbrev Number: 0
- <1><65d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <65e>   DW_AT_name        : (strp) (offset: 0x1638): ssizeargfunc
-    <662>   DW_AT_decl_file   : (data1) 2
-    <663>   DW_AT_decl_line   : (data1) 145
-    <664>   DW_AT_decl_column : (data1) 21
-    <665>   DW_AT_type        : (ref4) <0x669>, PyObject, _object
- <1><669>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <66a>   DW_AT_byte_size   : (data1) 8
-    <66b>   DW_AT_type        : (ref4) <0x66f>, PyObject, _object
- <1><66f>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <670>   DW_AT_prototyped  : (flag_present) 1
-    <670>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <674>   DW_AT_sibling     : (ref4) <0x683>
- <2><678>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <679>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><67d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <67e>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <2><682>: Abbrev Number: 0
- <1><683>: Abbrev Number: 5 (DW_TAG_typedef)
-    <684>   DW_AT_name        : (strp) (offset: 0x26b): ssizeobjargproc
-    <688>   DW_AT_decl_file   : (data1) 2
-    <689>   DW_AT_decl_line   : (data1) 147
-    <68a>   DW_AT_decl_column : (data1) 14
-    <68b>   DW_AT_type        : (ref4) <0x68f>, int
- <1><68f>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <690>   DW_AT_byte_size   : (data1) 8
-    <691>   DW_AT_type        : (ref4) <0x695>, int
- <1><695>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <696>   DW_AT_prototyped  : (flag_present) 1
-    <696>   DW_AT_type        : (ref4) <0xe6>, int
-    <69a>   DW_AT_sibling     : (ref4) <0x6ae>
- <2><69e>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <69f>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6a3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6a4>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <2><6a8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6a9>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6ad>: Abbrev Number: 0
- <1><6ae>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6af>   DW_AT_name        : (strp) (offset: 0x21a8): objobjargproc
-    <6b3>   DW_AT_decl_file   : (data1) 2
-    <6b4>   DW_AT_decl_line   : (data1) 149
-    <6b5>   DW_AT_decl_column : (data1) 14
-    <6b6>   DW_AT_type        : (ref4) <0x6ba>, int
- <1><6ba>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <6bb>   DW_AT_byte_size   : (data1) 8
-    <6bc>   DW_AT_type        : (ref4) <0x6c0>, int
- <1><6c0>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <6c1>   DW_AT_prototyped  : (flag_present) 1
-    <6c1>   DW_AT_type        : (ref4) <0xe6>, int
-    <6c5>   DW_AT_sibling     : (ref4) <0x6d9>
- <2><6c9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6ca>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6ce>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6cf>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6d3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6d8>: Abbrev Number: 0
- <1><6d9>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6da>   DW_AT_name        : (strp) (offset: 0x113): objobjproc
-    <6de>   DW_AT_decl_file   : (data1) 2
-    <6df>   DW_AT_decl_line   : (data1) 151
-    <6e0>   DW_AT_decl_column : (data1) 15
-    <6e1>   DW_AT_type        : (ref4) <0x6e5>, int
- <1><6e5>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <6e6>   DW_AT_byte_size   : (data1) 8
-    <6e7>   DW_AT_type        : (ref4) <0x6eb>, int
- <1><6eb>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <6ec>   DW_AT_prototyped  : (flag_present) 1
-    <6ec>   DW_AT_type        : (ref4) <0xe6>, int
-    <6f0>   DW_AT_sibling     : (ref4) <0x6ff>
- <2><6f4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6f5>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6f9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6fa>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6fe>: Abbrev Number: 0
- <1><6ff>: Abbrev Number: 5 (DW_TAG_typedef)
-    <700>   DW_AT_name        : (strp) (offset: 0x1da7): visitproc
-    <704>   DW_AT_decl_file   : (data1) 2
-    <705>   DW_AT_decl_line   : (data1) 152
-    <706>   DW_AT_decl_column : (data1) 15
-    <707>   DW_AT_type        : (ref4) <0x70b>, int
- <1><70b>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <70c>   DW_AT_byte_size   : (data1) 8
+    <4fc>   DW_AT_decl_line   : (data1) 230
+    <4fd>   DW_AT_decl_column : (data1) 18
+    <4fe>   DW_AT_type        : (ref4) <0x941>, iternextfunc, PyObject, _object
+    <502>   DW_AT_data_member_location: (data1) 224
+ <2><503>: Abbrev Number: 9 (DW_TAG_member)
+    <504>   DW_AT_name        : (strp) (offset: 0x1226): tp_methods
+    <508>   DW_AT_decl_file   : (data1) 11
+    <509>   DW_AT_decl_line   : (data1) 233
+    <50a>   DW_AT_decl_column : (data1) 25
+    <50b>   DW_AT_type        : (ref4) <0xea4>, PyMethodDef
+    <50f>   DW_AT_data_member_location: (data1) 232
+ <2><510>: Abbrev Number: 9 (DW_TAG_member)
+    <511>   DW_AT_name        : (strp) (offset: 0x1784): tp_members
+    <515>   DW_AT_decl_file   : (data1) 11
+    <516>   DW_AT_decl_line   : (data1) 234
+    <517>   DW_AT_decl_column : (data1) 25
+    <518>   DW_AT_type        : (ref4) <0xeaf>, PyMemberDef
+    <51c>   DW_AT_data_member_location: (data1) 240
+ <2><51d>: Abbrev Number: 9 (DW_TAG_member)
+    <51e>   DW_AT_name        : (strp) (offset: 0x188a): tp_getset
+    <522>   DW_AT_decl_file   : (data1) 11
+    <523>   DW_AT_decl_line   : (data1) 235
+    <524>   DW_AT_decl_column : (data1) 25
+    <525>   DW_AT_type        : (ref4) <0xf04>, PyGetSetDef
+    <529>   DW_AT_data_member_location: (data1) 248
+ <2><52a>: Abbrev Number: 17 (DW_TAG_member)
+    <52b>   DW_AT_name        : (strp) (offset: 0x193c): tp_base
+    <52f>   DW_AT_decl_file   : (data1) 11
+    <530>   DW_AT_decl_line   : (data1) 236
+    <531>   DW_AT_decl_column : (data1) 25
+    <532>   DW_AT_type        : (ref4) <0x646>, _typeobject
+    <536>   DW_AT_data_member_location: (data2) 256
+ <2><538>: Abbrev Number: 17 (DW_TAG_member)
+    <539>   DW_AT_name        : (strp) (offset: 0xa0c): tp_dict
+    <53d>   DW_AT_decl_file   : (data1) 11
+    <53e>   DW_AT_decl_line   : (data1) 237
+    <53f>   DW_AT_decl_column : (data1) 15
+    <540>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <544>   DW_AT_data_member_location: (data2) 264
+ <2><546>: Abbrev Number: 17 (DW_TAG_member)
+    <547>   DW_AT_name        : (strp) (offset: 0x18c3): tp_descr_get
+    <54b>   DW_AT_decl_file   : (data1) 11
+    <54c>   DW_AT_decl_line   : (data1) 238
+    <54d>   DW_AT_decl_column : (data1) 18
+    <54e>   DW_AT_type        : (ref4) <0x94d>, descrgetfunc, PyObject, _object
+    <552>   DW_AT_data_member_location: (data2) 272
+ <2><554>: Abbrev Number: 17 (DW_TAG_member)
+    <555>   DW_AT_name        : (strp) (offset: 0x1dc5): tp_descr_set
+    <559>   DW_AT_decl_file   : (data1) 11
+    <55a>   DW_AT_decl_line   : (data1) 239
+    <55b>   DW_AT_decl_column : (data1) 18
+    <55c>   DW_AT_type        : (ref4) <0x959>, descrsetfunc, int
+    <560>   DW_AT_data_member_location: (data2) 280
+ <2><562>: Abbrev Number: 17 (DW_TAG_member)
+    <563>   DW_AT_name        : (strp) (offset: 0x843): tp_dictoffset
+    <567>   DW_AT_decl_file   : (data1) 11
+    <568>   DW_AT_decl_line   : (data1) 240
+    <569>   DW_AT_decl_column : (data1) 16
+    <56a>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <56e>   DW_AT_data_member_location: (data2) 288
+ <2><570>: Abbrev Number: 17 (DW_TAG_member)
+    <571>   DW_AT_name        : (strp) (offset: 0x9c5): tp_init
+    <575>   DW_AT_decl_file   : (data1) 11
+    <576>   DW_AT_decl_line   : (data1) 241
+    <577>   DW_AT_decl_column : (data1) 14
+    <578>   DW_AT_type        : (ref4) <0x965>, initproc, int
+    <57c>   DW_AT_data_member_location: (data2) 296
+ <2><57e>: Abbrev Number: 17 (DW_TAG_member)
+    <57f>   DW_AT_name        : (strp) (offset: 0x114a): tp_alloc
+    <583>   DW_AT_decl_file   : (data1) 11
+    <584>   DW_AT_decl_line   : (data1) 242
+    <585>   DW_AT_decl_column : (data1) 15
+    <586>   DW_AT_type        : (ref4) <0x99c>, allocfunc, PyObject, _object
+    <58a>   DW_AT_data_member_location: (data2) 304
+ <2><58c>: Abbrev Number: 17 (DW_TAG_member)
+    <58d>   DW_AT_name        : (strp) (offset: 0xf3d): tp_new
+    <591>   DW_AT_decl_file   : (data1) 11
+    <592>   DW_AT_decl_line   : (data1) 243
+    <593>   DW_AT_decl_column : (data1) 13
+    <594>   DW_AT_type        : (ref4) <0x971>, newfunc, PyObject, _object
+    <598>   DW_AT_data_member_location: (data2) 312
+ <2><59a>: Abbrev Number: 17 (DW_TAG_member)
+    <59b>   DW_AT_name        : (strp) (offset: 0x504): tp_free
+    <59f>   DW_AT_decl_file   : (data1) 11
+    <5a0>   DW_AT_decl_line   : (data1) 244
+    <5a1>   DW_AT_decl_column : (data1) 14
+    <5a2>   DW_AT_type        : (ref4) <0x83a>, freefunc
+    <5a6>   DW_AT_data_member_location: (data2) 320
+ <2><5a8>: Abbrev Number: 17 (DW_TAG_member)
+    <5a9>   DW_AT_name        : (strp) (offset: 0x19f): tp_is_gc
+    <5ad>   DW_AT_decl_file   : (data1) 11
+    <5ae>   DW_AT_decl_line   : (data1) 245
+    <5af>   DW_AT_decl_column : (data1) 13
+    <5b0>   DW_AT_type        : (ref4) <0x705>, inquiry, int
+    <5b4>   DW_AT_data_member_location: (data2) 328
+ <2><5b6>: Abbrev Number: 17 (DW_TAG_member)
+    <5b7>   DW_AT_name        : (strp) (offset: 0x28f): tp_bases
+    <5bb>   DW_AT_decl_file   : (data1) 11
+    <5bc>   DW_AT_decl_line   : (data1) 246
+    <5bd>   DW_AT_decl_column : (data1) 15
+    <5be>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <5c2>   DW_AT_data_member_location: (data2) 336
+ <2><5c4>: Abbrev Number: 17 (DW_TAG_member)
+    <5c5>   DW_AT_name        : (strp) (offset: 0x1240): tp_mro
+    <5c9>   DW_AT_decl_file   : (data1) 11
+    <5ca>   DW_AT_decl_line   : (data1) 247
+    <5cb>   DW_AT_decl_column : (data1) 15
+    <5cc>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <5d0>   DW_AT_data_member_location: (data2) 344
+ <2><5d2>: Abbrev Number: 17 (DW_TAG_member)
+    <5d3>   DW_AT_name        : (strp) (offset: 0x1b8e): tp_cache
+    <5d7>   DW_AT_decl_file   : (data1) 11
+    <5d8>   DW_AT_decl_line   : (data1) 248
+    <5d9>   DW_AT_decl_column : (data1) 15
+    <5da>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <5de>   DW_AT_data_member_location: (data2) 352
+ <2><5e0>: Abbrev Number: 17 (DW_TAG_member)
+    <5e1>   DW_AT_name        : (strp) (offset: 0x1801): tp_subclasses
+    <5e5>   DW_AT_decl_file   : (data1) 11
+    <5e6>   DW_AT_decl_line   : (data1) 249
+    <5e7>   DW_AT_decl_column : (data1) 15
+    <5e8>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <5ec>   DW_AT_data_member_location: (data2) 360
+ <2><5ee>: Abbrev Number: 17 (DW_TAG_member)
+    <5ef>   DW_AT_name        : (strp) (offset: 0x1550): tp_weaklist
+    <5f3>   DW_AT_decl_file   : (data1) 11
+    <5f4>   DW_AT_decl_line   : (data1) 250
+    <5f5>   DW_AT_decl_column : (data1) 15
+    <5f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <5fa>   DW_AT_data_member_location: (data2) 368
+ <2><5fc>: Abbrev Number: 17 (DW_TAG_member)
+    <5fd>   DW_AT_name        : (strp) (offset: 0x1010): tp_del
+    <601>   DW_AT_decl_file   : (data1) 11
+    <602>   DW_AT_decl_line   : (data1) 251
+    <603>   DW_AT_decl_column : (data1) 16
+    <604>   DW_AT_type        : (ref4) <0x857>, destructor
+    <608>   DW_AT_data_member_location: (data2) 376
+ <2><60a>: Abbrev Number: 17 (DW_TAG_member)
+    <60b>   DW_AT_name        : (strp) (offset: 0x16a4): tp_version_tag
+    <60f>   DW_AT_decl_file   : (data1) 11
+    <610>   DW_AT_decl_line   : (data1) 254
+    <611>   DW_AT_decl_column : (data1) 18
+    <612>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+    <616>   DW_AT_data_member_location: (data2) 384
+ <2><618>: Abbrev Number: 18 (DW_TAG_member)
+    <619>   DW_AT_name        : (strp) (offset: 0x877): tp_finalize
+    <61d>   DW_AT_decl_file   : (data1) 11
+    <61e>   DW_AT_decl_line   : (data2) 256
+    <620>   DW_AT_decl_column : (data1) 16
+    <621>   DW_AT_type        : (ref4) <0x857>, destructor
+    <625>   DW_AT_data_member_location: (data2) 392
+ <2><627>: Abbrev Number: 18 (DW_TAG_member)
+    <628>   DW_AT_name        : (strp) (offset: 0x168b): tp_vectorcall
+    <62c>   DW_AT_decl_file   : (data1) 11
+    <62d>   DW_AT_decl_line   : (data2) 257
+    <62f>   DW_AT_decl_column : (data1) 20
+    <630>   DW_AT_type        : (ref4) <0xadd>, vectorcallfunc, PyObject, _object
+    <634>   DW_AT_data_member_location: (data2) 400
+ <2><636>: Abbrev Number: 18 (DW_TAG_member)
+    <637>   DW_AT_name        : (strp) (offset: 0x19be): tp_print
+    <63b>   DW_AT_decl_file   : (data1) 11
+    <63c>   DW_AT_decl_line   : (data2) 260
+    <63e>   DW_AT_decl_column : (data1) 30
+    <63f>   DW_AT_type        : (ref4) <0xf29>, int
+    <643>   DW_AT_data_member_location: (data2) 408
+ <2><645>: Abbrev Number: 0
+ <1><646>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <647>   DW_AT_byte_size   : (data1) 8
+    <648>   DW_AT_type        : (ref4) <0x396>, _typeobject
+ <1><64c>: Abbrev Number: 2 (DW_TAG_typedef)
+    <64d>   DW_AT_name        : (strp) (offset: 0xd81): PyObject
+    <651>   DW_AT_decl_file   : (data1) 2
+    <652>   DW_AT_decl_line   : (data1) 108
+    <653>   DW_AT_decl_column : (data1) 3
+    <654>   DW_AT_type        : (ref4) <0x36e>, _object
+ <1><658>: Abbrev Number: 19 (DW_TAG_structure_type)
+    <659>   DW_AT_byte_size   : (data1) 24
+    <65a>   DW_AT_decl_file   : (data1) 2
+    <65b>   DW_AT_decl_line   : (data1) 113
+    <65c>   DW_AT_decl_column : (data1) 9
+    <65d>   DW_AT_sibling     : (ref4) <0x67c>
+ <2><661>: Abbrev Number: 9 (DW_TAG_member)
+    <662>   DW_AT_name        : (strp) (offset: 0x699): ob_base
+    <666>   DW_AT_decl_file   : (data1) 2
+    <667>   DW_AT_decl_line   : (data1) 114
+    <668>   DW_AT_decl_column : (data1) 14
+    <669>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
+    <66d>   DW_AT_data_member_location: (data1) 0
+ <2><66e>: Abbrev Number: 9 (DW_TAG_member)
+    <66f>   DW_AT_name        : (strp) (offset: 0x9eb): ob_size
+    <673>   DW_AT_decl_file   : (data1) 2
+    <674>   DW_AT_decl_line   : (data1) 115
+    <675>   DW_AT_decl_column : (data1) 16
+    <676>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <67a>   DW_AT_data_member_location: (data1) 16
+ <2><67b>: Abbrev Number: 0
+ <1><67c>: Abbrev Number: 2 (DW_TAG_typedef)
+    <67d>   DW_AT_name        : (strp) (offset: 0x55b): PyVarObject
+    <681>   DW_AT_decl_file   : (data1) 2
+    <682>   DW_AT_decl_line   : (data1) 116
+    <683>   DW_AT_decl_column : (data1) 3
+    <684>   DW_AT_type        : (ref4) <0x658>
+ <1><688>: Abbrev Number: 2 (DW_TAG_typedef)
+    <689>   DW_AT_name        : (strp) (offset: 0x12ab): unaryfunc
+    <68d>   DW_AT_decl_file   : (data1) 2
+    <68e>   DW_AT_decl_line   : (data1) 140
+    <68f>   DW_AT_decl_column : (data1) 22
+    <690>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
+ <1><694>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <695>   DW_AT_byte_size   : (data1) 8
+    <696>   DW_AT_type        : (ref4) <0x69a>, PyObject, _object
+ <1><69a>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <69b>   DW_AT_prototyped  : (flag_present) 1
+    <69b>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <69f>   DW_AT_sibling     : (ref4) <0x6a9>
+ <2><6a3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6a4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><6a8>: Abbrev Number: 0
+ <1><6a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6aa>   DW_AT_byte_size   : (data1) 8
+    <6ab>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
+ <1><6af>: Abbrev Number: 7 (DW_TAG_const_type)
+    <6b0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <1><6b4>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6b5>   DW_AT_name        : (strp) (offset: 0xab6): binaryfunc
+    <6b9>   DW_AT_decl_file   : (data1) 2
+    <6ba>   DW_AT_decl_line   : (data1) 141
+    <6bb>   DW_AT_decl_column : (data1) 22
+    <6bc>   DW_AT_type        : (ref4) <0x6c0>, PyObject, _object
+ <1><6c0>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6c1>   DW_AT_byte_size   : (data1) 8
+    <6c2>   DW_AT_type        : (ref4) <0x6c6>, PyObject, _object
+ <1><6c6>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6c7>   DW_AT_prototyped  : (flag_present) 1
+    <6c7>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <6cb>   DW_AT_sibling     : (ref4) <0x6da>
+ <2><6cf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6d0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><6d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6d5>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><6d9>: Abbrev Number: 0
+ <1><6da>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6db>   DW_AT_name        : (strp) (offset: 0x683): ternaryfunc
+    <6df>   DW_AT_decl_file   : (data1) 2
+    <6e0>   DW_AT_decl_line   : (data1) 142
+    <6e1>   DW_AT_decl_column : (data1) 22
+    <6e2>   DW_AT_type        : (ref4) <0x6e6>, PyObject, _object
+ <1><6e6>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6e7>   DW_AT_byte_size   : (data1) 8
+    <6e8>   DW_AT_type        : (ref4) <0x6ec>, PyObject, _object
+ <1><6ec>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6ed>   DW_AT_prototyped  : (flag_present) 1
+    <6ed>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <6f1>   DW_AT_sibling     : (ref4) <0x705>
+ <2><6f5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><6fa>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6fb>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><6ff>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <700>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><704>: Abbrev Number: 0
+ <1><705>: Abbrev Number: 2 (DW_TAG_typedef)
+    <706>   DW_AT_name        : (strp) (offset: 0x137a): inquiry
+    <70a>   DW_AT_decl_file   : (data1) 2
+    <70b>   DW_AT_decl_line   : (data1) 143
+    <70c>   DW_AT_decl_column : (data1) 15
     <70d>   DW_AT_type        : (ref4) <0x711>, int
- <1><711>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <712>   DW_AT_prototyped  : (flag_present) 1
-    <712>   DW_AT_type        : (ref4) <0xe6>, int
-    <716>   DW_AT_sibling     : (ref4) <0x725>
- <2><71a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <71b>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><71f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <720>   DW_AT_type        : (ref4) <0x5e>
- <2><724>: Abbrev Number: 0
- <1><725>: Abbrev Number: 5 (DW_TAG_typedef)
-    <726>   DW_AT_name        : (strp) (offset: 0x1225): traverseproc
-    <72a>   DW_AT_decl_file   : (data1) 2
-    <72b>   DW_AT_decl_line   : (data1) 153
-    <72c>   DW_AT_decl_column : (data1) 15
-    <72d>   DW_AT_type        : (ref4) <0x731>, int
- <1><731>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <732>   DW_AT_byte_size   : (data1) 8
-    <733>   DW_AT_type        : (ref4) <0x737>, int
- <1><737>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <738>   DW_AT_prototyped  : (flag_present) 1
-    <738>   DW_AT_type        : (ref4) <0xe6>, int
-    <73c>   DW_AT_sibling     : (ref4) <0x750>
- <2><740>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <741>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><745>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <746>   DW_AT_type        : (ref4) <0x6ff>, visitproc, int
- <2><74a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <74b>   DW_AT_type        : (ref4) <0x5e>
- <2><74f>: Abbrev Number: 0
- <1><750>: Abbrev Number: 5 (DW_TAG_typedef)
-    <751>   DW_AT_name        : (strp) (offset: 0x202a): freefunc
-    <755>   DW_AT_decl_file   : (data1) 2
-    <756>   DW_AT_decl_line   : (data1) 156
-    <757>   DW_AT_decl_column : (data1) 16
-    <758>   DW_AT_type        : (ref4) <0x75c>
- <1><75c>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <75d>   DW_AT_byte_size   : (data1) 8
-    <75e>   DW_AT_type        : (ref4) <0x762>
- <1><762>: Abbrev Number: 24 (DW_TAG_subroutine_type)
-    <763>   DW_AT_prototyped  : (flag_present) 1
-    <763>   DW_AT_sibling     : (ref4) <0x76d>
- <2><767>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <768>   DW_AT_type        : (ref4) <0x5e>
+ <1><711>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <712>   DW_AT_byte_size   : (data1) 8
+    <713>   DW_AT_type        : (ref4) <0x717>, int
+ <1><717>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <718>   DW_AT_prototyped  : (flag_present) 1
+    <718>   DW_AT_type        : (ref4) <0x5f>, int
+    <71c>   DW_AT_sibling     : (ref4) <0x726>
+ <2><720>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <721>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><725>: Abbrev Number: 0
+ <1><726>: Abbrev Number: 2 (DW_TAG_typedef)
+    <727>   DW_AT_name        : (strp) (offset: 0x37): lenfunc
+    <72b>   DW_AT_decl_file   : (data1) 2
+    <72c>   DW_AT_decl_line   : (data1) 144
+    <72d>   DW_AT_decl_column : (data1) 22
+    <72e>   DW_AT_type        : (ref4) <0x732>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><732>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <733>   DW_AT_byte_size   : (data1) 8
+    <734>   DW_AT_type        : (ref4) <0x738>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><738>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <739>   DW_AT_prototyped  : (flag_present) 1
+    <739>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <73d>   DW_AT_sibling     : (ref4) <0x747>
+ <2><741>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <742>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><746>: Abbrev Number: 0
+ <1><747>: Abbrev Number: 2 (DW_TAG_typedef)
+    <748>   DW_AT_name        : (strp) (offset: 0xb7d): ssizeargfunc
+    <74c>   DW_AT_decl_file   : (data1) 2
+    <74d>   DW_AT_decl_line   : (data1) 145
+    <74e>   DW_AT_decl_column : (data1) 21
+    <74f>   DW_AT_type        : (ref4) <0x753>, PyObject, _object
+ <1><753>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <754>   DW_AT_byte_size   : (data1) 8
+    <755>   DW_AT_type        : (ref4) <0x759>, PyObject, _object
+ <1><759>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <75a>   DW_AT_prototyped  : (flag_present) 1
+    <75a>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+    <75e>   DW_AT_sibling     : (ref4) <0x76d>
+ <2><762>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <763>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
+ <2><767>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <768>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><76c>: Abbrev Number: 0
- <1><76d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <76e>   DW_AT_name        : (strp) (offset: 0x28a5): destructor
+ <1><76d>: Abbrev Number: 2 (DW_TAG_typedef)
+    <76e>   DW_AT_name        : (strp) (offset: 0x167b): ssizeobjargproc
     <772>   DW_AT_decl_file   : (data1) 2
-    <773>   DW_AT_decl_line   : (data1) 157
-    <774>   DW_AT_decl_column : (data1) 16
-    <775>   DW_AT_type        : (ref4) <0x779>
- <1><779>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <773>   DW_AT_decl_line   : (data1) 147
+    <774>   DW_AT_decl_column : (data1) 14
+    <775>   DW_AT_type        : (ref4) <0x779>, int
+ <1><779>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <77a>   DW_AT_byte_size   : (data1) 8
-    <77b>   DW_AT_type        : (ref4) <0x77f>
- <1><77f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
+    <77b>   DW_AT_type        : (ref4) <0x77f>, int
+ <1><77f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
     <780>   DW_AT_prototyped  : (flag_present) 1
-    <780>   DW_AT_sibling     : (ref4) <0x78a>
- <2><784>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <785>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><789>: Abbrev Number: 0
- <1><78a>: Abbrev Number: 5 (DW_TAG_typedef)
-    <78b>   DW_AT_name        : (strp) (offset: 0x26f2): getattrfunc
-    <78f>   DW_AT_decl_file   : (data1) 2
-    <790>   DW_AT_decl_line   : (data1) 158
-    <791>   DW_AT_decl_column : (data1) 21
-    <792>   DW_AT_type        : (ref4) <0x796>, PyObject, _object
- <1><796>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <797>   DW_AT_byte_size   : (data1) 8
-    <798>   DW_AT_type        : (ref4) <0x79c>, PyObject, _object
- <1><79c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <79d>   DW_AT_prototyped  : (flag_present) 1
-    <79d>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <7a1>   DW_AT_sibling     : (ref4) <0x7b0>
- <2><7a5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7a6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><7aa>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7ab>   DW_AT_type        : (ref4) <0xda>, char
- <2><7af>: Abbrev Number: 0
- <1><7b0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7b1>   DW_AT_name        : (strp) (offset: 0xdf0): getattrofunc
-    <7b5>   DW_AT_decl_file   : (data1) 2
-    <7b6>   DW_AT_decl_line   : (data1) 159
-    <7b7>   DW_AT_decl_column : (data1) 21
-    <7b8>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
- <1><7bc>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7bd>   DW_AT_name        : (strp) (offset: 0x1aad): setattrfunc
-    <7c1>   DW_AT_decl_file   : (data1) 2
-    <7c2>   DW_AT_decl_line   : (data1) 160
-    <7c3>   DW_AT_decl_column : (data1) 15
-    <7c4>   DW_AT_type        : (ref4) <0x7c8>, int
- <1><7c8>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <7c9>   DW_AT_byte_size   : (data1) 8
-    <7ca>   DW_AT_type        : (ref4) <0x7ce>, int
- <1><7ce>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <7cf>   DW_AT_prototyped  : (flag_present) 1
-    <7cf>   DW_AT_type        : (ref4) <0xe6>, int
-    <7d3>   DW_AT_sibling     : (ref4) <0x7e7>
- <2><7d7>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7d8>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><7dc>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7dd>   DW_AT_type        : (ref4) <0xda>, char
- <2><7e1>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7e2>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><7e6>: Abbrev Number: 0
- <1><7e7>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7e8>   DW_AT_name        : (strp) (offset: 0x26cf): setattrofunc
-    <7ec>   DW_AT_decl_file   : (data1) 2
-    <7ed>   DW_AT_decl_line   : (data1) 161
-    <7ee>   DW_AT_decl_column : (data1) 15
-    <7ef>   DW_AT_type        : (ref4) <0x6ba>, int
- <1><7f3>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7f4>   DW_AT_name        : (strp) (offset: 0xef8): reprfunc
-    <7f8>   DW_AT_decl_file   : (data1) 2
-    <7f9>   DW_AT_decl_line   : (data1) 162
-    <7fa>   DW_AT_decl_column : (data1) 21
-    <7fb>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
- <1><7ff>: Abbrev Number: 5 (DW_TAG_typedef)
-    <800>   DW_AT_name        : (strp) (offset: 0x1ad6): hashfunc
-    <804>   DW_AT_decl_file   : (data1) 2
-    <805>   DW_AT_decl_line   : (data1) 163
-    <806>   DW_AT_decl_column : (data1) 21
-    <807>   DW_AT_type        : (ref4) <0x80b>, Py_hash_t, Py_ssize_t, ssize_t, long int
- <1><80b>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <80c>   DW_AT_byte_size   : (data1) 8
-    <80d>   DW_AT_type        : (ref4) <0x811>, Py_hash_t, Py_ssize_t, ssize_t, long int
- <1><811>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <812>   DW_AT_prototyped  : (flag_present) 1
-    <812>   DW_AT_type        : (ref4) <0x1b5>, Py_hash_t, Py_ssize_t, ssize_t, long int
-    <816>   DW_AT_sibling     : (ref4) <0x820>
