# Comparing `tmp/composabl-0.2.9-cp38-cp38-musllinux_1_1_x86_64.whl.zip` & `tmp/composabl-0.3.0-cp38-cp38-musllinux_1_1_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,72 +1,11 @@
-Zip file size: 6868938 bytes, number of entries: 70
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl-0.2.9.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/
--rw-r--r--  2.0 unx       10 b- defN 23-Aug-01 17:35 composabl-0.2.9.dist-info/top_level.txt
--rw-rw-r--  2.0 unx     6385 b- defN 23-Aug-01 17:35 composabl-0.2.9.dist-info/RECORD
--rw-r--r--  2.0 unx      111 b- defN 23-Aug-01 17:35 composabl-0.2.9.dist-info/WHEEL
--rw-r--r--  2.0 unx     2205 b- defN 23-Aug-01 17:35 composabl-0.2.9.dist-info/METADATA
--rw-r--r--  2.0 unx       45 b- defN 23-Aug-01 17:35 composabl-0.2.9.dist-info/entry_points.txt
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/agent/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/grpc/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/decorators/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/utils/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-01 17:35 composabl/proto/
--rwxr-xr-x  2.0 unx  1485216 b- defN 23-Aug-01 17:35 composabl/runtime_base.cpython-38-x86_64-linux-gnu.so
--rwxr-xr-x  2.0 unx    80472 b- defN 23-Aug-01 17:35 composabl/__init__.cpython-38-x86_64-linux-gnu.so

     <19d>   DW_AT_decl_file   : (data1) 3
     <19e>   DW_AT_decl_line   : (data1) 177
     <19f>   DW_AT_decl_column : (data1) 25
     <1a0>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
  <1><1a4>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1a5>   DW_AT_name        : (strp) (offset: 0x1d75): Py_ssize_t
+    <1a5>   DW_AT_name        : (strp) (offset: 0x1f30): Py_ssize_t
     <1a9>   DW_AT_decl_file   : (data1) 7
     <1aa>   DW_AT_decl_line   : (data1) 105
     <1ab>   DW_AT_decl_column : (data1) 25
     <1ac>   DW_AT_type        : (ref4) <0x6c>, ssize_t, long int
  <1><1b0>: Abbrev Number: 3 (DW_TAG_const_type)
     <1b1>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <1><1b5>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1b6>   DW_AT_name        : (strp) (offset: 0x5b4): Py_hash_t
+    <1b6>   DW_AT_name        : (strp) (offset: 0x654): Py_hash_t
     <1ba>   DW_AT_decl_file   : (data1) 7
     <1bb>   DW_AT_decl_line   : (data1) 114
     <1bc>   DW_AT_decl_column : (data1) 20
     <1bd>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <1><1c1>: Abbrev Number: 2 (DW_TAG_base_type)
     <1c2>   DW_AT_byte_size   : (data1) 4
     <1c3>   DW_AT_encoding    : (data1) 4	(float)
-    <1c4>   DW_AT_name        : (strp) (offset: 0xa13): float
+    <1c4>   DW_AT_name        : (strp) (offset: 0xac2): float
  <1><1c8>: Abbrev Number: 11 (DW_TAG_variable)
-    <1c9>   DW_AT_name        : (strp) (offset: 0x1d59): signgam
+    <1c9>   DW_AT_name        : (strp) (offset: 0x1f14): signgam
     <1cd>   DW_AT_decl_file   : (data1) 8
     <1ce>   DW_AT_decl_line   : (data2) 384
     <1d0>   DW_AT_decl_column : (data1) 12
     <1d1>   DW_AT_type        : (ref4) <0xe6>, int
     <1d5>   DW_AT_external    : (flag_present) 1
     <1d5>   DW_AT_declaration : (flag_present) 1
  <1><1d5>: Abbrev Number: 12 (DW_TAG_array_type)
     <1d6>   DW_AT_type        : (ref4) <0xda>, char
     <1da>   DW_AT_sibling     : (ref4) <0x1e5>
  <2><1de>: Abbrev Number: 13 (DW_TAG_subrange_type)
     <1df>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
     <1e3>   DW_AT_upper_bound : (data1) 1
  <2><1e4>: Abbrev Number: 0
  <1><1e5>: Abbrev Number: 8 (DW_TAG_variable)
-    <1e6>   DW_AT_name        : (strp) (offset: 0x1867): tzname
+    <1e6>   DW_AT_name        : (strp) (offset: 0x19ff): tzname
     <1ea>   DW_AT_decl_file   : (data1) 9
     <1eb>   DW_AT_decl_line   : (data1) 114
     <1ec>   DW_AT_decl_column : (data1) 14
     <1ed>   DW_AT_type        : (ref4) <0x1d5>, char
     <1f1>   DW_AT_external    : (flag_present) 1
     <1f1>   DW_AT_declaration : (flag_present) 1
  <1><1f1>: Abbrev Number: 8 (DW_TAG_variable)
-    <1f2>   DW_AT_name        : (strp) (offset: 0x28b8): daylight
+    <1f2>   DW_AT_name        : (strp) (offset: 0x2b23): daylight
     <1f6>   DW_AT_decl_file   : (data1) 9
     <1f7>   DW_AT_decl_line   : (data1) 121
     <1f8>   DW_AT_decl_column : (data1) 12
     <1f9>   DW_AT_type        : (ref4) <0xe6>, int
     <1fd>   DW_AT_external    : (flag_present) 1
     <1fd>   DW_AT_declaration : (flag_present) 1
  <1><1fd>: Abbrev Number: 8 (DW_TAG_variable)
-    <1fe>   DW_AT_name        : (strp) (offset: 0xc23): timezone
+    <1fe>   DW_AT_name        : (strp) (offset: 0xce3): timezone
     <202>   DW_AT_decl_file   : (data1) 9
     <203>   DW_AT_decl_line   : (data1) 122
     <204>   DW_AT_decl_column : (data1) 13
     <205>   DW_AT_type        : (ref4) <0x78>, long int
     <209>   DW_AT_external    : (flag_present) 1
     <209>   DW_AT_declaration : (flag_present) 1
  <1><209>: Abbrev Number: 8 (DW_TAG_variable)
-    <20a>   DW_AT_name        : (strp) (offset: 0x2641): getdate_err
+    <20a>   DW_AT_name        : (strp) (offset: 0x288d): getdate_err
     <20e>   DW_AT_decl_file   : (data1) 9
     <20f>   DW_AT_decl_line   : (data1) 123
     <210>   DW_AT_decl_column : (data1) 12
     <211>   DW_AT_type        : (ref4) <0xe6>, int
     <215>   DW_AT_external    : (flag_present) 1
     <215>   DW_AT_declaration : (flag_present) 1
  <1><215>: Abbrev Number: 14 (DW_TAG_enumeration_type)
@@ -294,485 +294,485 @@
     <217>   DW_AT_byte_size   : (data1) 4
     <218>   DW_AT_type        : (ref4) <0x52>, unsigned int
     <21c>   DW_AT_decl_file   : (data1) 10
     <21d>   DW_AT_decl_line   : (data1) 112
     <21e>   DW_AT_decl_column : (data1) 10
     <21f>   DW_AT_sibling     : (ref4) <0x236>
  <2><223>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <224>   DW_AT_name        : (strp) (offset: 0x1c1b): TRACEMALLOC_NOT_INITIALIZED
+    <224>   DW_AT_name        : (strp) (offset: 0x1dd1): TRACEMALLOC_NOT_INITIALIZED
     <228>   DW_AT_const_value : (data1) 0
  <2><229>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <22a>   DW_AT_name        : (strp) (offset: 0x270): TRACEMALLOC_INITIALIZED
+    <22a>   DW_AT_name        : (strp) (offset: 0x2ab): TRACEMALLOC_INITIALIZED
     <22e>   DW_AT_const_value : (data1) 1
  <2><22f>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <230>   DW_AT_name        : (strp) (offset: 0x1693): TRACEMALLOC_FINALIZED
+    <230>   DW_AT_name        : (strp) (offset: 0x17fc): TRACEMALLOC_FINALIZED
     <234>   DW_AT_const_value : (data1) 2
  <2><235>: Abbrev Number: 0
  <1><236>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <237>   DW_AT_name        : (strp) (offset: 0x22f7): _PyTraceMalloc_Config
+    <237>   DW_AT_name        : (strp) (offset: 0x2527): _PyTraceMalloc_Config
     <23b>   DW_AT_byte_size   : (data1) 16
     <23c>   DW_AT_decl_file   : (data1) 10
     <23d>   DW_AT_decl_line   : (data1) 109
     <23e>   DW_AT_decl_column : (data1) 8
     <23f>   DW_AT_sibling     : (ref4) <0x278>
  <2><243>: Abbrev Number: 17 (DW_TAG_member)
-    <244>   DW_AT_name        : (strp) (offset: 0x1425): initialized
+    <244>   DW_AT_name        : (strp) (offset: 0x1557): initialized
     <248>   DW_AT_decl_file   : (data1) 10
     <249>   DW_AT_decl_line   : (data1) 116
     <24a>   DW_AT_decl_column : (data1) 7
     <24b>   DW_AT_type        : (ref4) <0x215>, unsigned int
     <24f>   DW_AT_data_member_location: (data1) 0
  <2><250>: Abbrev Number: 17 (DW_TAG_member)
-    <251>   DW_AT_name        : (strp) (offset: 0x18a2): tracing
+    <251>   DW_AT_name        : (strp) (offset: 0x1a3a): tracing
     <255>   DW_AT_decl_file   : (data1) 10
     <256>   DW_AT_decl_line   : (data1) 120
     <257>   DW_AT_decl_column : (data1) 9
     <258>   DW_AT_type        : (ref4) <0xe6>, int
     <25c>   DW_AT_data_member_location: (data1) 4
  <2><25d>: Abbrev Number: 17 (DW_TAG_member)
-    <25e>   DW_AT_name        : (strp) (offset: 0x11ed): max_nframe
+    <25e>   DW_AT_name        : (strp) (offset: 0x12e3): max_nframe
     <262>   DW_AT_decl_file   : (data1) 10
     <263>   DW_AT_decl_line   : (data1) 124
     <264>   DW_AT_decl_column : (data1) 9
     <265>   DW_AT_type        : (ref4) <0xe6>, int
     <269>   DW_AT_data_member_location: (data1) 8
  <2><26a>: Abbrev Number: 17 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x1e1d): use_domain
+    <26b>   DW_AT_name        : (strp) (offset: 0x1fea): use_domain
     <26f>   DW_AT_decl_file   : (data1) 10
     <270>   DW_AT_decl_line   : (data1) 128
     <271>   DW_AT_decl_column : (data1) 9
     <272>   DW_AT_type        : (ref4) <0xe6>, int
     <276>   DW_AT_data_member_location: (data1) 12
  <2><277>: Abbrev Number: 0
  <1><278>: Abbrev Number: 8 (DW_TAG_variable)
-    <279>   DW_AT_name        : (strp) (offset: 0x1fdb): _Py_tracemalloc_config
+    <279>   DW_AT_name        : (strp) (offset: 0x220b): _Py_tracemalloc_config
     <27d>   DW_AT_decl_file   : (data1) 10
     <27e>   DW_AT_decl_line   : (data1) 131
     <27f>   DW_AT_decl_column : (data1) 42
     <280>   DW_AT_type        : (ref4) <0x236>, _PyTraceMalloc_Config
     <284>   DW_AT_external    : (flag_present) 1
     <284>   DW_AT_declaration : (flag_present) 1
  <1><284>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <285>   DW_AT_name        : (strp) (offset: 0x29e3): _object
+    <285>   DW_AT_name        : (strp) (offset: 0x2c4e): _object
     <289>   DW_AT_byte_size   : (data1) 16
     <28a>   DW_AT_decl_file   : (data1) 2
     <28b>   DW_AT_decl_line   : (data1) 104
     <28c>   DW_AT_decl_column : (data1) 16
     <28d>   DW_AT_sibling     : (ref4) <0x2ac>
  <2><291>: Abbrev Number: 17 (DW_TAG_member)
-    <292>   DW_AT_name        : (strp) (offset: 0x5aa): ob_refcnt
+    <292>   DW_AT_name        : (strp) (offset: 0x64a): ob_refcnt
     <296>   DW_AT_decl_file   : (data1) 2
     <297>   DW_AT_decl_line   : (data1) 106
     <298>   DW_AT_decl_column : (data1) 16
     <299>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <29d>   DW_AT_data_member_location: (data1) 0
  <2><29e>: Abbrev Number: 17 (DW_TAG_member)
-    <29f>   DW_AT_name        : (strp) (offset: 0x2745): ob_type
+    <29f>   DW_AT_name        : (strp) (offset: 0x2991): ob_type
     <2a3>   DW_AT_decl_file   : (data1) 2
     <2a4>   DW_AT_decl_line   : (data1) 107
     <2a5>   DW_AT_decl_column : (data1) 25
     <2a6>   DW_AT_type        : (ref4) <0x55c>, _typeobject
     <2aa>   DW_AT_data_member_location: (data1) 8
  <2><2ab>: Abbrev Number: 0
  <1><2ac>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <2ad>   DW_AT_name        : (strp) (offset: 0x136a): _typeobject
+    <2ad>   DW_AT_name        : (strp) (offset: 0x149a): _typeobject
     <2b1>   DW_AT_byte_size   : (data2) 416
     <2b3>   DW_AT_decl_file   : (data1) 11
     <2b4>   DW_AT_decl_line   : (data1) 177
     <2b5>   DW_AT_decl_column : (data1) 16
     <2b6>   DW_AT_sibling     : (ref4) <0x55c>
  <2><2ba>: Abbrev Number: 17 (DW_TAG_member)
-    <2bb>   DW_AT_name        : (strp) (offset: 0x3ca): ob_base
+    <2bb>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
     <2bf>   DW_AT_decl_file   : (data1) 11
     <2c0>   DW_AT_decl_line   : (data1) 178
     <2c1>   DW_AT_decl_column : (data1) 5
     <2c2>   DW_AT_type        : (ref4) <0x592>, PyVarObject
     <2c6>   DW_AT_data_member_location: (data1) 0
  <2><2c7>: Abbrev Number: 17 (DW_TAG_member)
-    <2c8>   DW_AT_name        : (strp) (offset: 0x4f8): tp_name
+    <2c8>   DW_AT_name        : (strp) (offset: 0x55d): tp_name
     <2cc>   DW_AT_decl_file   : (data1) 11
     <2cd>   DW_AT_decl_line   : (data1) 179
     <2ce>   DW_AT_decl_column : (data1) 17
     <2cf>   DW_AT_type        : (ref4) <0xe0>, char
     <2d3>   DW_AT_data_member_location: (data1) 24
  <2><2d4>: Abbrev Number: 17 (DW_TAG_member)
-    <2d5>   DW_AT_name        : (strp) (offset: 0x2168): tp_basicsize
+    <2d5>   DW_AT_name        : (strp) (offset: 0x2398): tp_basicsize
     <2d9>   DW_AT_decl_file   : (data1) 11
     <2da>   DW_AT_decl_line   : (data1) 180
     <2db>   DW_AT_decl_column : (data1) 16
     <2dc>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <2e0>   DW_AT_data_member_location: (data1) 32
  <2><2e1>: Abbrev Number: 17 (DW_TAG_member)
-    <2e2>   DW_AT_name        : (strp) (offset: 0x22a1): tp_itemsize
+    <2e2>   DW_AT_name        : (strp) (offset: 0x24d1): tp_itemsize
     <2e6>   DW_AT_decl_file   : (data1) 11
     <2e7>   DW_AT_decl_line   : (data1) 180
     <2e8>   DW_AT_decl_column : (data1) 30
     <2e9>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <2ed>   DW_AT_data_member_location: (data1) 40
  <2><2ee>: Abbrev Number: 17 (DW_TAG_member)
-    <2ef>   DW_AT_name        : (strp) (offset: 0x19e): tp_dealloc
+    <2ef>   DW_AT_name        : (strp) (offset: 0x1c1): tp_dealloc
     <2f3>   DW_AT_decl_file   : (data1) 11
     <2f4>   DW_AT_decl_line   : (data1) 184
     <2f5>   DW_AT_decl_column : (data1) 16
     <2f6>   DW_AT_type        : (ref4) <0x76d>, destructor
     <2fa>   DW_AT_data_member_location: (data1) 48
  <2><2fb>: Abbrev Number: 17 (DW_TAG_member)
-    <2fc>   DW_AT_name        : (strp) (offset: 0xab3): tp_vectorcall_offset
+    <2fc>   DW_AT_name        : (strp) (offset: 0xb62): tp_vectorcall_offset
     <300>   DW_AT_decl_file   : (data1) 11
     <301>   DW_AT_decl_line   : (data1) 185
     <302>   DW_AT_decl_column : (data1) 16
     <303>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <307>   DW_AT_data_member_location: (data1) 56
  <2><308>: Abbrev Number: 17 (DW_TAG_member)
-    <309>   DW_AT_name        : (strp) (offset: 0x2102): tp_getattr
+    <309>   DW_AT_name        : (strp) (offset: 0x2332): tp_getattr
     <30d>   DW_AT_decl_file   : (data1) 11
     <30e>   DW_AT_decl_line   : (data1) 186
     <30f>   DW_AT_decl_column : (data1) 17
     <310>   DW_AT_type        : (ref4) <0x78a>, getattrfunc, PyObject, _object
     <314>   DW_AT_data_member_location: (data1) 64
  <2><315>: Abbrev Number: 17 (DW_TAG_member)
-    <316>   DW_AT_name        : (strp) (offset: 0x10cb): tp_setattr
+    <316>   DW_AT_name        : (strp) (offset: 0x11ae): tp_setattr
     <31a>   DW_AT_decl_file   : (data1) 11
     <31b>   DW_AT_decl_line   : (data1) 187
     <31c>   DW_AT_decl_column : (data1) 17
     <31d>   DW_AT_type        : (ref4) <0x7bc>, setattrfunc, int
     <321>   DW_AT_data_member_location: (data1) 72
  <2><322>: Abbrev Number: 17 (DW_TAG_member)
-    <323>   DW_AT_name        : (strp) (offset: 0x1d9c): tp_as_async
+    <323>   DW_AT_name        : (strp) (offset: 0x1f5f): tp_as_async
     <327>   DW_AT_decl_file   : (data1) 11
     <328>   DW_AT_decl_line   : (data1) 188
     <329>   DW_AT_decl_column : (data1) 21
     <32a>   DW_AT_type        : (ref4) <0xd7f>, PyAsyncMethods
     <32e>   DW_AT_data_member_location: (data1) 80
  <2><32f>: Abbrev Number: 17 (DW_TAG_member)
-    <330>   DW_AT_name        : (strp) (offset: 0x228): tp_repr
+    <330>   DW_AT_name        : (strp) (offset: 0x263): tp_repr
     <334>   DW_AT_decl_file   : (data1) 11
     <335>   DW_AT_decl_line   : (data1) 190
     <336>   DW_AT_decl_column : (data1) 14
     <337>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
     <33b>   DW_AT_data_member_location: (data1) 88
  <2><33c>: Abbrev Number: 17 (DW_TAG_member)
-    <33d>   DW_AT_name        : (strp) (offset: 0x23d4): tp_as_number
+    <33d>   DW_AT_name        : (strp) (offset: 0x2604): tp_as_number
     <341>   DW_AT_decl_file   : (data1) 11
     <342>   DW_AT_decl_line   : (data1) 194
     <343>   DW_AT_decl_column : (data1) 22
     <344>   DW_AT_type        : (ref4) <0xd85>, PyNumberMethods
     <348>   DW_AT_data_member_location: (data1) 96
  <2><349>: Abbrev Number: 17 (DW_TAG_member)
-    <34a>   DW_AT_name        : (strp) (offset: 0x219): tp_as_sequence
+    <34a>   DW_AT_name        : (strp) (offset: 0x254): tp_as_sequence
     <34e>   DW_AT_decl_file   : (data1) 11
     <34f>   DW_AT_decl_line   : (data1) 195
     <350>   DW_AT_decl_column : (data1) 24
     <351>   DW_AT_type        : (ref4) <0xd8b>, PySequenceMethods
     <355>   DW_AT_data_member_location: (data1) 104
  <2><356>: Abbrev Number: 17 (DW_TAG_member)
-    <357>   DW_AT_name        : (strp) (offset: 0x1095): tp_as_mapping
+    <357>   DW_AT_name        : (strp) (offset: 0x1178): tp_as_mapping
     <35b>   DW_AT_decl_file   : (data1) 11
     <35c>   DW_AT_decl_line   : (data1) 196
     <35d>   DW_AT_decl_column : (data1) 23
     <35e>   DW_AT_type        : (ref4) <0xd91>, PyMappingMethods
     <362>   DW_AT_data_member_location: (data1) 112
  <2><363>: Abbrev Number: 17 (DW_TAG_member)
-    <364>   DW_AT_name        : (strp) (offset: 0xc02): tp_hash
+    <364>   DW_AT_name        : (strp) (offset: 0xcc2): tp_hash
     <368>   DW_AT_decl_file   : (data1) 11
     <369>   DW_AT_decl_line   : (data1) 200
     <36a>   DW_AT_decl_column : (data1) 14
     <36b>   DW_AT_type        : (ref4) <0x7ff>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
     <36f>   DW_AT_data_member_location: (data1) 120
  <2><370>: Abbrev Number: 17 (DW_TAG_member)
-    <371>   DW_AT_name        : (strp) (offset: 0x1733): tp_call
+    <371>   DW_AT_name        : (strp) (offset: 0x18aa): tp_call
     <375>   DW_AT_decl_file   : (data1) 11
     <376>   DW_AT_decl_line   : (data1) 201
     <377>   DW_AT_decl_column : (data1) 17
     <378>   DW_AT_type        : (ref4) <0x5f0>, ternaryfunc, PyObject, _object
     <37c>   DW_AT_data_member_location: (data1) 128
  <2><37d>: Abbrev Number: 17 (DW_TAG_member)
-    <37e>   DW_AT_name        : (strp) (offset: 0x11d4): tp_str
+    <37e>   DW_AT_name        : (strp) (offset: 0x12ca): tp_str
     <382>   DW_AT_decl_file   : (data1) 11
     <383>   DW_AT_decl_line   : (data1) 202
     <384>   DW_AT_decl_column : (data1) 14
     <385>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
     <389>   DW_AT_data_member_location: (data1) 136
  <2><38a>: Abbrev Number: 17 (DW_TAG_member)
-    <38b>   DW_AT_name        : (strp) (offset: 0xd7d): tp_getattro
+    <38b>   DW_AT_name        : (strp) (offset: 0xe47): tp_getattro
     <38f>   DW_AT_decl_file   : (data1) 11
     <390>   DW_AT_decl_line   : (data1) 203
     <391>   DW_AT_decl_column : (data1) 18
     <392>   DW_AT_type        : (ref4) <0x7b0>, getattrofunc, PyObject, _object
     <396>   DW_AT_data_member_location: (data1) 144
  <2><397>: Abbrev Number: 17 (DW_TAG_member)
-    <398>   DW_AT_name        : (strp) (offset: 0x1a3a): tp_setattro
+    <398>   DW_AT_name        : (strp) (offset: 0x1bd2): tp_setattro
     <39c>   DW_AT_decl_file   : (data1) 11
     <39d>   DW_AT_decl_line   : (data1) 204
     <39e>   DW_AT_decl_column : (data1) 18
     <39f>   DW_AT_type        : (ref4) <0x7e7>, setattrofunc, int
     <3a3>   DW_AT_data_member_location: (data1) 152
  <2><3a4>: Abbrev Number: 17 (DW_TAG_member)
-    <3a5>   DW_AT_name        : (strp) (offset: 0x1f45): tp_as_buffer
+    <3a5>   DW_AT_name        : (strp) (offset: 0x2175): tp_as_buffer
     <3a9>   DW_AT_decl_file   : (data1) 11
     <3aa>   DW_AT_decl_line   : (data1) 207
     <3ab>   DW_AT_decl_column : (data1) 20
     <3ac>   DW_AT_type        : (ref4) <0xd97>, PyBufferProcs
     <3b0>   DW_AT_data_member_location: (data1) 160
  <2><3b1>: Abbrev Number: 17 (DW_TAG_member)
-    <3b2>   DW_AT_name        : (strp) (offset: 0x13f3): tp_flags
+    <3b2>   DW_AT_name        : (strp) (offset: 0x1523): tp_flags
     <3b6>   DW_AT_decl_file   : (data1) 11
     <3b7>   DW_AT_decl_line   : (data1) 210
     <3b8>   DW_AT_decl_column : (data1) 19
     <3b9>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
     <3bd>   DW_AT_data_member_location: (data1) 168
  <2><3be>: Abbrev Number: 17 (DW_TAG_member)
-    <3bf>   DW_AT_name        : (strp) (offset: 0x8e8): tp_doc
+    <3bf>   DW_AT_name        : (strp) (offset: 0x988): tp_doc
     <3c3>   DW_AT_decl_file   : (data1) 11
     <3c4>   DW_AT_decl_line   : (data1) 212
     <3c5>   DW_AT_decl_column : (data1) 17
     <3c6>   DW_AT_type        : (ref4) <0xe0>, char
     <3ca>   DW_AT_data_member_location: (data1) 176
  <2><3cb>: Abbrev Number: 17 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0xfdf): tp_traverse
+    <3cc>   DW_AT_name        : (strp) (offset: 0x10c2): tp_traverse
     <3d0>   DW_AT_decl_file   : (data1) 11
     <3d1>   DW_AT_decl_line   : (data1) 216
     <3d2>   DW_AT_decl_column : (data1) 18
     <3d3>   DW_AT_type        : (ref4) <0x725>, traverseproc, int
     <3d7>   DW_AT_data_member_location: (data1) 184
  <2><3d8>: Abbrev Number: 17 (DW_TAG_member)
-    <3d9>   DW_AT_name        : (strp) (offset: 0x171c): tp_clear
+    <3d9>   DW_AT_name        : (strp) (offset: 0x1893): tp_clear
     <3dd>   DW_AT_decl_file   : (data1) 11
     <3de>   DW_AT_decl_line   : (data1) 219
     <3df>   DW_AT_decl_column : (data1) 13
     <3e0>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
     <3e4>   DW_AT_data_member_location: (data1) 192
  <2><3e5>: Abbrev Number: 17 (DW_TAG_member)
-    <3e6>   DW_AT_name        : (strp) (offset: 0x164): tp_richcompare
+    <3e6>   DW_AT_name        : (strp) (offset: 0x187): tp_richcompare
     <3ea>   DW_AT_decl_file   : (data1) 11
     <3eb>   DW_AT_decl_line   : (data1) 223
     <3ec>   DW_AT_decl_column : (data1) 17
     <3ed>   DW_AT_type        : (ref4) <0x820>, richcmpfunc, PyObject, _object
     <3f1>   DW_AT_data_member_location: (data1) 200
  <2><3f2>: Abbrev Number: 17 (DW_TAG_member)
-    <3f3>   DW_AT_name        : (strp) (offset: 0x4be): tp_weaklistoffset
+    <3f3>   DW_AT_name        : (strp) (offset: 0x523): tp_weaklistoffset
     <3f7>   DW_AT_decl_file   : (data1) 11
     <3f8>   DW_AT_decl_line   : (data1) 226
     <3f9>   DW_AT_decl_column : (data1) 16
     <3fa>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <3fe>   DW_AT_data_member_location: (data1) 208
  <2><3ff>: Abbrev Number: 17 (DW_TAG_member)
-    <400>   DW_AT_name        : (strp) (offset: 0x6f7): tp_iter
+    <400>   DW_AT_name        : (strp) (offset: 0x797): tp_iter
     <404>   DW_AT_decl_file   : (data1) 11
     <405>   DW_AT_decl_line   : (data1) 229
     <406>   DW_AT_decl_column : (data1) 17
     <407>   DW_AT_type        : (ref4) <0x84b>, getiterfunc, PyObject, _object
     <40b>   DW_AT_data_member_location: (data1) 216
  <2><40c>: Abbrev Number: 17 (DW_TAG_member)
-    <40d>   DW_AT_name        : (strp) (offset: 0x1710): tp_iternext
+    <40d>   DW_AT_name        : (strp) (offset: 0x1887): tp_iternext
     <411>   DW_AT_decl_file   : (data1) 11
     <412>   DW_AT_decl_line   : (data1) 230
     <413>   DW_AT_decl_column : (data1) 18
     <414>   DW_AT_type        : (ref4) <0x857>, iternextfunc, PyObject, _object
     <418>   DW_AT_data_member_location: (data1) 224
  <2><419>: Abbrev Number: 17 (DW_TAG_member)
-    <41a>   DW_AT_name        : (strp) (offset: 0x3af): tp_methods
+    <41a>   DW_AT_name        : (strp) (offset: 0x401): tp_methods
     <41e>   DW_AT_decl_file   : (data1) 11
     <41f>   DW_AT_decl_line   : (data1) 233
     <420>   DW_AT_decl_column : (data1) 25
     <421>   DW_AT_type        : (ref4) <0xddf>, PyMethodDef
     <425>   DW_AT_data_member_location: (data1) 232
  <2><426>: Abbrev Number: 17 (DW_TAG_member)
-    <427>   DW_AT_name        : (strp) (offset: 0x18e2): tp_members
+    <427>   DW_AT_name        : (strp) (offset: 0x1a7a): tp_members
     <42b>   DW_AT_decl_file   : (data1) 11
     <42c>   DW_AT_decl_line   : (data1) 234
     <42d>   DW_AT_decl_column : (data1) 25
     <42e>   DW_AT_type        : (ref4) <0xdea>, PyMemberDef
     <432>   DW_AT_data_member_location: (data1) 240
  <2><433>: Abbrev Number: 17 (DW_TAG_member)
-    <434>   DW_AT_name        : (strp) (offset: 0x1ed2): tp_getset
+    <434>   DW_AT_name        : (strp) (offset: 0x20c9): tp_getset
     <438>   DW_AT_decl_file   : (data1) 11
     <439>   DW_AT_decl_line   : (data1) 235
     <43a>   DW_AT_decl_column : (data1) 25
     <43b>   DW_AT_type        : (ref4) <0xe3f>, PyGetSetDef
     <43f>   DW_AT_data_member_location: (data1) 248
  <2><440>: Abbrev Number: 19 (DW_TAG_member)
-    <441>   DW_AT_name        : (strp) (offset: 0xa83): tp_base
+    <441>   DW_AT_name        : (strp) (offset: 0xb32): tp_base
     <445>   DW_AT_decl_file   : (data1) 11
     <446>   DW_AT_decl_line   : (data1) 236
     <447>   DW_AT_decl_column : (data1) 25
     <448>   DW_AT_type        : (ref4) <0x55c>, _typeobject
     <44c>   DW_AT_data_member_location: (data2) 256
  <2><44e>: Abbrev Number: 19 (DW_TAG_member)
-    <44f>   DW_AT_name        : (strp) (offset: 0xf48): tp_dict
+    <44f>   DW_AT_name        : (strp) (offset: 0x101e): tp_dict
     <453>   DW_AT_decl_file   : (data1) 11
     <454>   DW_AT_decl_line   : (data1) 237
     <455>   DW_AT_decl_column : (data1) 15
     <456>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <45a>   DW_AT_data_member_location: (data2) 264
  <2><45c>: Abbrev Number: 19 (DW_TAG_member)
-    <45d>   DW_AT_name        : (strp) (offset: 0x27be): tp_descr_get
+    <45d>   DW_AT_name        : (strp) (offset: 0x2a0a): tp_descr_get
     <461>   DW_AT_decl_file   : (data1) 11
     <462>   DW_AT_decl_line   : (data1) 238
     <463>   DW_AT_decl_column : (data1) 18
     <464>   DW_AT_type        : (ref4) <0x863>, descrgetfunc, PyObject, _object
     <468>   DW_AT_data_member_location: (data2) 272
  <2><46a>: Abbrev Number: 19 (DW_TAG_member)
-    <46b>   DW_AT_name        : (strp) (offset: 0xea9): tp_descr_set
+    <46b>   DW_AT_name        : (strp) (offset: 0xf7f): tp_descr_set
     <46f>   DW_AT_decl_file   : (data1) 11
     <470>   DW_AT_decl_line   : (data1) 239
     <471>   DW_AT_decl_column : (data1) 18
     <472>   DW_AT_type        : (ref4) <0x86f>, descrsetfunc, int
     <476>   DW_AT_data_member_location: (data2) 280
  <2><478>: Abbrev Number: 19 (DW_TAG_member)
-    <479>   DW_AT_name        : (strp) (offset: 0x2a73): tp_dictoffset
+    <479>   DW_AT_name        : (strp) (offset: 0x2cd9): tp_dictoffset
     <47d>   DW_AT_decl_file   : (data1) 11
     <47e>   DW_AT_decl_line   : (data1) 240
     <47f>   DW_AT_decl_column : (data1) 16
     <480>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <484>   DW_AT_data_member_location: (data2) 288
  <2><486>: Abbrev Number: 19 (DW_TAG_member)
-    <487>   DW_AT_name        : (strp) (offset: 0x3d2): tp_init
+    <487>   DW_AT_name        : (strp) (offset: 0x424): tp_init
     <48b>   DW_AT_decl_file   : (data1) 11
     <48c>   DW_AT_decl_line   : (data1) 241
     <48d>   DW_AT_decl_column : (data1) 14
     <48e>   DW_AT_type        : (ref4) <0x87b>, initproc, int
     <492>   DW_AT_data_member_location: (data2) 296
  <2><494>: Abbrev Number: 19 (DW_TAG_member)
-    <495>   DW_AT_name        : (strp) (offset: 0x1dcf): tp_alloc
+    <495>   DW_AT_name        : (strp) (offset: 0x1f92): tp_alloc
     <499>   DW_AT_decl_file   : (data1) 11
     <49a>   DW_AT_decl_line   : (data1) 242
     <49b>   DW_AT_decl_column : (data1) 15
     <49c>   DW_AT_type        : (ref4) <0x8b2>, allocfunc, PyObject, _object
     <4a0>   DW_AT_data_member_location: (data2) 304
  <2><4a2>: Abbrev Number: 19 (DW_TAG_member)
-    <4a3>   DW_AT_name        : (strp) (offset: 0x26ed): tp_new
+    <4a3>   DW_AT_name        : (strp) (offset: 0x2939): tp_new
     <4a7>   DW_AT_decl_file   : (data1) 11
     <4a8>   DW_AT_decl_line   : (data1) 243
     <4a9>   DW_AT_decl_column : (data1) 13
     <4aa>   DW_AT_type        : (ref4) <0x887>, newfunc, PyObject, _object
     <4ae>   DW_AT_data_member_location: (data2) 312
  <2><4b0>: Abbrev Number: 19 (DW_TAG_member)
-    <4b1>   DW_AT_name        : (strp) (offset: 0xa19): tp_free
+    <4b1>   DW_AT_name        : (strp) (offset: 0xac8): tp_free
     <4b5>   DW_AT_decl_file   : (data1) 11
     <4b6>   DW_AT_decl_line   : (data1) 244
     <4b7>   DW_AT_decl_column : (data1) 14
     <4b8>   DW_AT_type        : (ref4) <0x750>, freefunc
     <4bc>   DW_AT_data_member_location: (data2) 320
  <2><4be>: Abbrev Number: 19 (DW_TAG_member)
-    <4bf>   DW_AT_name        : (strp) (offset: 0x4d0): tp_is_gc
+    <4bf>   DW_AT_name        : (strp) (offset: 0x535): tp_is_gc
     <4c3>   DW_AT_decl_file   : (data1) 11
     <4c4>   DW_AT_decl_line   : (data1) 245
     <4c5>   DW_AT_decl_column : (data1) 13
     <4c6>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
     <4ca>   DW_AT_data_member_location: (data2) 328
  <2><4cc>: Abbrev Number: 19 (DW_TAG_member)
-    <4cd>   DW_AT_name        : (strp) (offset: 0x376): tp_bases
+    <4cd>   DW_AT_name        : (strp) (offset: 0x3c8): tp_bases
     <4d1>   DW_AT_decl_file   : (data1) 11
     <4d2>   DW_AT_decl_line   : (data1) 246
     <4d3>   DW_AT_decl_column : (data1) 15
     <4d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <4d8>   DW_AT_data_member_location: (data2) 336
  <2><4da>: Abbrev Number: 19 (DW_TAG_member)
-    <4db>   DW_AT_name        : (strp) (offset: 0x55f): tp_mro
+    <4db>   DW_AT_name        : (strp) (offset: 0x5fe): tp_mro
     <4df>   DW_AT_decl_file   : (data1) 11
     <4e0>   DW_AT_decl_line   : (data1) 247
     <4e1>   DW_AT_decl_column : (data1) 15
     <4e2>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <4e6>   DW_AT_data_member_location: (data2) 344
  <2><4e8>: Abbrev Number: 19 (DW_TAG_member)
-    <4e9>   DW_AT_name        : (strp) (offset: 0x215f): tp_cache
+    <4e9>   DW_AT_name        : (strp) (offset: 0x238f): tp_cache
     <4ed>   DW_AT_decl_file   : (data1) 11
     <4ee>   DW_AT_decl_line   : (data1) 248
     <4ef>   DW_AT_decl_column : (data1) 15
     <4f0>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <4f4>   DW_AT_data_member_location: (data2) 352
  <2><4f6>: Abbrev Number: 19 (DW_TAG_member)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x29f7): tp_subclasses
+    <4f7>   DW_AT_name        : (strp) (offset: 0x2c62): tp_subclasses
     <4fb>   DW_AT_decl_file   : (data1) 11
     <4fc>   DW_AT_decl_line   : (data1) 249
     <4fd>   DW_AT_decl_column : (data1) 15
     <4fe>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <502>   DW_AT_data_member_location: (data2) 360
  <2><504>: Abbrev Number: 19 (DW_TAG_member)
-    <505>   DW_AT_name        : (strp) (offset: 0x1f04): tp_weaklist
+    <505>   DW_AT_name        : (strp) (offset: 0x2114): tp_weaklist
     <509>   DW_AT_decl_file   : (data1) 11
     <50a>   DW_AT_decl_line   : (data1) 250
     <50b>   DW_AT_decl_column : (data1) 15
     <50c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
     <510>   DW_AT_data_member_location: (data2) 368
  <2><512>: Abbrev Number: 19 (DW_TAG_member)
-    <513>   DW_AT_name        : (strp) (offset: 0x263a): tp_del
+    <513>   DW_AT_name        : (strp) (offset: 0x2886): tp_del
     <517>   DW_AT_decl_file   : (data1) 11
     <518>   DW_AT_decl_line   : (data1) 251
     <519>   DW_AT_decl_column : (data1) 16
     <51a>   DW_AT_type        : (ref4) <0x76d>, destructor
     <51e>   DW_AT_data_member_location: (data2) 376
  <2><520>: Abbrev Number: 19 (DW_TAG_member)
-    <521>   DW_AT_name        : (strp) (offset: 0x20f3): tp_version_tag
+    <521>   DW_AT_name        : (strp) (offset: 0x2323): tp_version_tag
     <525>   DW_AT_decl_file   : (data1) 11
     <526>   DW_AT_decl_line   : (data1) 254
     <527>   DW_AT_decl_column : (data1) 18
     <528>   DW_AT_type        : (ref4) <0x52>, unsigned int
     <52c>   DW_AT_data_member_location: (data2) 384
  <2><52e>: Abbrev Number: 20 (DW_TAG_member)
-    <52f>   DW_AT_name        : (strp) (offset: 0x252c): tp_finalize
+    <52f>   DW_AT_name        : (strp) (offset: 0x2778): tp_finalize
     <533>   DW_AT_decl_file   : (data1) 11
     <534>   DW_AT_decl_line   : (data2) 256
     <536>   DW_AT_decl_column : (data1) 16
     <537>   DW_AT_type        : (ref4) <0x76d>, destructor
     <53b>   DW_AT_data_member_location: (data2) 392
  <2><53d>: Abbrev Number: 20 (DW_TAG_member)
-    <53e>   DW_AT_name        : (strp) (offset: 0x1f6a): tp_vectorcall
+    <53e>   DW_AT_name        : (strp) (offset: 0x219a): tp_vectorcall
     <542>   DW_AT_decl_file   : (data1) 11
     <543>   DW_AT_decl_line   : (data2) 257
     <545>   DW_AT_decl_column : (data1) 20
     <546>   DW_AT_type        : (ref4) <0xa18>, vectorcallfunc, PyObject, _object
     <54a>   DW_AT_data_member_location: (data2) 400
  <2><54c>: Abbrev Number: 20 (DW_TAG_member)
-    <54d>   DW_AT_name        : (strp) (offset: 0x20ea): tp_print
+    <54d>   DW_AT_name        : (strp) (offset: 0x231a): tp_print
     <551>   DW_AT_decl_file   : (data1) 11
     <552>   DW_AT_decl_line   : (data2) 260
     <554>   DW_AT_decl_column : (data1) 30
     <555>   DW_AT_type        : (ref4) <0xe5e>, int
     <559>   DW_AT_data_member_location: (data2) 408
  <2><55b>: Abbrev Number: 0
  <1><55c>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <55d>   DW_AT_byte_size   : (data1) 8
     <55e>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
  <1><562>: Abbrev Number: 5 (DW_TAG_typedef)
-    <563>   DW_AT_name        : (strp) (offset: 0x16b1): PyObject
+    <563>   DW_AT_name        : (strp) (offset: 0x181a): PyObject
     <567>   DW_AT_decl_file   : (data1) 2
     <568>   DW_AT_decl_line   : (data1) 108
     <569>   DW_AT_decl_column : (data1) 3
     <56a>   DW_AT_type        : (ref4) <0x284>, _object
  <1><56e>: Abbrev Number: 21 (DW_TAG_structure_type)
     <56f>   DW_AT_byte_size   : (data1) 24
     <570>   DW_AT_decl_file   : (data1) 2
     <571>   DW_AT_decl_line   : (data1) 113
     <572>   DW_AT_decl_column : (data1) 9
     <573>   DW_AT_sibling     : (ref4) <0x592>
  <2><577>: Abbrev Number: 17 (DW_TAG_member)
-    <578>   DW_AT_name        : (strp) (offset: 0x3ca): ob_base
+    <578>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
     <57c>   DW_AT_decl_file   : (data1) 2
     <57d>   DW_AT_decl_line   : (data1) 114
     <57e>   DW_AT_decl_column : (data1) 14
     <57f>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
     <583>   DW_AT_data_member_location: (data1) 0
  <2><584>: Abbrev Number: 17 (DW_TAG_member)
-    <585>   DW_AT_name        : (strp) (offset: 0x16a9): ob_size
+    <585>   DW_AT_name        : (strp) (offset: 0x1812): ob_size
     <589>   DW_AT_decl_file   : (data1) 2
     <58a>   DW_AT_decl_line   : (data1) 115
     <58b>   DW_AT_decl_column : (data1) 16
     <58c>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <590>   DW_AT_data_member_location: (data1) 16
  <2><591>: Abbrev Number: 0
  <1><592>: Abbrev Number: 5 (DW_TAG_typedef)
-    <593>   DW_AT_name        : (strp) (offset: 0xdc5): PyVarObject
+    <593>   DW_AT_name        : (strp) (offset: 0xe8f): PyVarObject
     <597>   DW_AT_decl_file   : (data1) 2
     <598>   DW_AT_decl_line   : (data1) 116
     <599>   DW_AT_decl_column : (data1) 3
     <59a>   DW_AT_type        : (ref4) <0x56e>
  <1><59e>: Abbrev Number: 5 (DW_TAG_typedef)
-    <59f>   DW_AT_name        : (strp) (offset: 0xfd5): unaryfunc
+    <59f>   DW_AT_name        : (strp) (offset: 0x10ab): unaryfunc
     <5a3>   DW_AT_decl_file   : (data1) 2
     <5a4>   DW_AT_decl_line   : (data1) 140
     <5a5>   DW_AT_decl_column : (data1) 22
     <5a6>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
  <1><5aa>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <5ab>   DW_AT_byte_size   : (data1) 8
     <5ac>   DW_AT_type        : (ref4) <0x5b0>, PyObject, _object
@@ -785,15 +785,15 @@
  <2><5be>: Abbrev Number: 0
  <1><5bf>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <5c0>   DW_AT_byte_size   : (data1) 8
     <5c1>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
  <1><5c5>: Abbrev Number: 3 (DW_TAG_const_type)
     <5c6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <1><5ca>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5cb>   DW_AT_name        : (strp) (offset: 0x219b): binaryfunc
+    <5cb>   DW_AT_name        : (strp) (offset: 0x23cb): binaryfunc
     <5cf>   DW_AT_decl_file   : (data1) 2
     <5d0>   DW_AT_decl_line   : (data1) 141
     <5d1>   DW_AT_decl_column : (data1) 22
     <5d2>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
  <1><5d6>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <5d7>   DW_AT_byte_size   : (data1) 8
     <5d8>   DW_AT_type        : (ref4) <0x5dc>, PyObject, _object
@@ -803,15 +803,15 @@
     <5e1>   DW_AT_sibling     : (ref4) <0x5f0>
  <2><5e5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <5e6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><5ea>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <5eb>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><5ef>: Abbrev Number: 0
  <1><5f0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5f1>   DW_AT_name        : (strp) (offset: 0x576): ternaryfunc
+    <5f1>   DW_AT_name        : (strp) (offset: 0x615): ternaryfunc
     <5f5>   DW_AT_decl_file   : (data1) 2
     <5f6>   DW_AT_decl_line   : (data1) 142
     <5f7>   DW_AT_decl_column : (data1) 22
     <5f8>   DW_AT_type        : (ref4) <0x5fc>, PyObject, _object
  <1><5fc>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <5fd>   DW_AT_byte_size   : (data1) 8
     <5fe>   DW_AT_type        : (ref4) <0x602>, PyObject, _object
@@ -823,15 +823,15 @@
     <60c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><610>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <611>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><615>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <616>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><61a>: Abbrev Number: 0
  <1><61b>: Abbrev Number: 5 (DW_TAG_typedef)
-    <61c>   DW_AT_name        : (strp) (offset: 0x177c): inquiry
+    <61c>   DW_AT_name        : (strp) (offset: 0x18f3): inquiry
     <620>   DW_AT_decl_file   : (data1) 2
     <621>   DW_AT_decl_line   : (data1) 143
     <622>   DW_AT_decl_column : (data1) 15
     <623>   DW_AT_type        : (ref4) <0x627>, int
  <1><627>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <628>   DW_AT_byte_size   : (data1) 8
     <629>   DW_AT_type        : (ref4) <0x62d>, int
@@ -839,15 +839,15 @@
     <62e>   DW_AT_prototyped  : (flag_present) 1
     <62e>   DW_AT_type        : (ref4) <0xe6>, int
     <632>   DW_AT_sibling     : (ref4) <0x63c>
  <2><636>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <637>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><63b>: Abbrev Number: 0
  <1><63c>: Abbrev Number: 5 (DW_TAG_typedef)
-    <63d>   DW_AT_name        : (strp) (offset: 0xeb6): lenfunc
+    <63d>   DW_AT_name        : (strp) (offset: 0xf8c): lenfunc
     <641>   DW_AT_decl_file   : (data1) 2
     <642>   DW_AT_decl_line   : (data1) 144
     <643>   DW_AT_decl_column : (data1) 22
     <644>   DW_AT_type        : (ref4) <0x648>, Py_ssize_t, ssize_t, long int
  <1><648>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <649>   DW_AT_byte_size   : (data1) 8
     <64a>   DW_AT_type        : (ref4) <0x64e>, Py_ssize_t, ssize_t, long int
@@ -855,15 +855,15 @@
     <64f>   DW_AT_prototyped  : (flag_present) 1
     <64f>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <653>   DW_AT_sibling     : (ref4) <0x65d>
  <2><657>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <658>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><65c>: Abbrev Number: 0
  <1><65d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <65e>   DW_AT_name        : (strp) (offset: 0x14e5): ssizeargfunc
+    <65e>   DW_AT_name        : (strp) (offset: 0x1638): ssizeargfunc
     <662>   DW_AT_decl_file   : (data1) 2
     <663>   DW_AT_decl_line   : (data1) 145
     <664>   DW_AT_decl_column : (data1) 21
     <665>   DW_AT_type        : (ref4) <0x669>, PyObject, _object
  <1><669>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <66a>   DW_AT_byte_size   : (data1) 8
     <66b>   DW_AT_type        : (ref4) <0x66f>, PyObject, _object
@@ -873,15 +873,15 @@
     <674>   DW_AT_sibling     : (ref4) <0x683>
  <2><678>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <679>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><67d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <67e>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <2><682>: Abbrev Number: 0
  <1><683>: Abbrev Number: 5 (DW_TAG_typedef)
-    <684>   DW_AT_name        : (strp) (offset: 0x230): ssizeobjargproc
+    <684>   DW_AT_name        : (strp) (offset: 0x26b): ssizeobjargproc
     <688>   DW_AT_decl_file   : (data1) 2
     <689>   DW_AT_decl_line   : (data1) 147
     <68a>   DW_AT_decl_column : (data1) 14
     <68b>   DW_AT_type        : (ref4) <0x68f>, int
  <1><68f>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <690>   DW_AT_byte_size   : (data1) 8
     <691>   DW_AT_type        : (ref4) <0x695>, int
@@ -893,15 +893,15 @@
     <69f>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6a3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6a4>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <2><6a8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6a9>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6ad>: Abbrev Number: 0
  <1><6ae>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6af>   DW_AT_name        : (strp) (offset: 0x1f78): objobjargproc
+    <6af>   DW_AT_name        : (strp) (offset: 0x21a8): objobjargproc
     <6b3>   DW_AT_decl_file   : (data1) 2
     <6b4>   DW_AT_decl_line   : (data1) 149
     <6b5>   DW_AT_decl_column : (data1) 14
     <6b6>   DW_AT_type        : (ref4) <0x6ba>, int
  <1><6ba>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <6bb>   DW_AT_byte_size   : (data1) 8
     <6bc>   DW_AT_type        : (ref4) <0x6c0>, int
@@ -913,15 +913,15 @@
     <6ca>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6ce>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6cf>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6d3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6d8>: Abbrev Number: 0
  <1><6d9>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6da>   DW_AT_name        : (strp) (offset: 0xf0): objobjproc
+    <6da>   DW_AT_name        : (strp) (offset: 0x113): objobjproc
     <6de>   DW_AT_decl_file   : (data1) 2
     <6df>   DW_AT_decl_line   : (data1) 151
     <6e0>   DW_AT_decl_column : (data1) 15
     <6e1>   DW_AT_type        : (ref4) <0x6e5>, int
  <1><6e5>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <6e6>   DW_AT_byte_size   : (data1) 8
     <6e7>   DW_AT_type        : (ref4) <0x6eb>, int
@@ -931,15 +931,15 @@
     <6f0>   DW_AT_sibling     : (ref4) <0x6ff>
  <2><6f4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6f5>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6f9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <6fa>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><6fe>: Abbrev Number: 0
  <1><6ff>: Abbrev Number: 5 (DW_TAG_typedef)
-    <700>   DW_AT_name        : (strp) (offset: 0x1bf1): visitproc
+    <700>   DW_AT_name        : (strp) (offset: 0x1da7): visitproc
     <704>   DW_AT_decl_file   : (data1) 2
     <705>   DW_AT_decl_line   : (data1) 152
     <706>   DW_AT_decl_column : (data1) 15
     <707>   DW_AT_type        : (ref4) <0x70b>, int
  <1><70b>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <70c>   DW_AT_byte_size   : (data1) 8
     <70d>   DW_AT_type        : (ref4) <0x711>, int
@@ -949,15 +949,15 @@
     <716>   DW_AT_sibling     : (ref4) <0x725>
  <2><71a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <71b>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><71f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <720>   DW_AT_type        : (ref4) <0x5e>
  <2><724>: Abbrev Number: 0
  <1><725>: Abbrev Number: 5 (DW_TAG_typedef)
-    <726>   DW_AT_name        : (strp) (offset: 0x1142): traverseproc
+    <726>   DW_AT_name        : (strp) (offset: 0x1225): traverseproc
     <72a>   DW_AT_decl_file   : (data1) 2
     <72b>   DW_AT_decl_line   : (data1) 153
     <72c>   DW_AT_decl_column : (data1) 15
     <72d>   DW_AT_type        : (ref4) <0x731>, int
  <1><731>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <732>   DW_AT_byte_size   : (data1) 8
     <733>   DW_AT_type        : (ref4) <0x737>, int
@@ -969,45 +969,45 @@
     <741>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><745>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <746>   DW_AT_type        : (ref4) <0x6ff>, visitproc, int
  <2><74a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <74b>   DW_AT_type        : (ref4) <0x5e>
  <2><74f>: Abbrev Number: 0
  <1><750>: Abbrev Number: 5 (DW_TAG_typedef)
-    <751>   DW_AT_name        : (strp) (offset: 0x1e4e): freefunc
+    <751>   DW_AT_name        : (strp) (offset: 0x202a): freefunc
     <755>   DW_AT_decl_file   : (data1) 2
     <756>   DW_AT_decl_line   : (data1) 156
     <757>   DW_AT_decl_column : (data1) 16
     <758>   DW_AT_type        : (ref4) <0x75c>
  <1><75c>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <75d>   DW_AT_byte_size   : (data1) 8
     <75e>   DW_AT_type        : (ref4) <0x762>
  <1><762>: Abbrev Number: 24 (DW_TAG_subroutine_type)
     <763>   DW_AT_prototyped  : (flag_present) 1
     <763>   DW_AT_sibling     : (ref4) <0x76d>
  <2><767>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <768>   DW_AT_type        : (ref4) <0x5e>
  <2><76c>: Abbrev Number: 0
  <1><76d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <76e>   DW_AT_name        : (strp) (offset: 0x2659): destructor
+    <76e>   DW_AT_name        : (strp) (offset: 0x28a5): destructor
     <772>   DW_AT_decl_file   : (data1) 2
     <773>   DW_AT_decl_line   : (data1) 157
     <774>   DW_AT_decl_column : (data1) 16
     <775>   DW_AT_type        : (ref4) <0x779>
  <1><779>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <77a>   DW_AT_byte_size   : (data1) 8
     <77b>   DW_AT_type        : (ref4) <0x77f>
  <1><77f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
     <780>   DW_AT_prototyped  : (flag_present) 1
     <780>   DW_AT_sibling     : (ref4) <0x78a>
  <2><784>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <785>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><789>: Abbrev Number: 0
  <1><78a>: Abbrev Number: 5 (DW_TAG_typedef)
-    <78b>   DW_AT_name        : (strp) (offset: 0x24a6): getattrfunc
+    <78b>   DW_AT_name        : (strp) (offset: 0x26f2): getattrfunc
     <78f>   DW_AT_decl_file   : (data1) 2
     <790>   DW_AT_decl_line   : (data1) 158
     <791>   DW_AT_decl_column : (data1) 21
     <792>   DW_AT_type        : (ref4) <0x796>, PyObject, _object
  <1><796>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <797>   DW_AT_byte_size   : (data1) 8
     <798>   DW_AT_type        : (ref4) <0x79c>, PyObject, _object
@@ -1017,21 +1017,21 @@
     <7a1>   DW_AT_sibling     : (ref4) <0x7b0>
  <2><7a5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <7a6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><7aa>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <7ab>   DW_AT_type        : (ref4) <0xda>, char
  <2><7af>: Abbrev Number: 0
  <1><7b0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7b1>   DW_AT_name        : (strp) (offset: 0xd30): getattrofunc
+    <7b1>   DW_AT_name        : (strp) (offset: 0xdf0): getattrofunc
     <7b5>   DW_AT_decl_file   : (data1) 2
     <7b6>   DW_AT_decl_line   : (data1) 159
     <7b7>   DW_AT_decl_column : (data1) 21
     <7b8>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
  <1><7bc>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7bd>   DW_AT_name        : (strp) (offset: 0x1915): setattrfunc
+    <7bd>   DW_AT_name        : (strp) (offset: 0x1aad): setattrfunc
     <7c1>   DW_AT_decl_file   : (data1) 2
     <7c2>   DW_AT_decl_line   : (data1) 160
     <7c3>   DW_AT_decl_column : (data1) 15
     <7c4>   DW_AT_type        : (ref4) <0x7c8>, int
  <1><7c8>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <7c9>   DW_AT_byte_size   : (data1) 8
     <7ca>   DW_AT_type        : (ref4) <0x7ce>, int
@@ -1043,27 +1043,27 @@
     <7d8>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><7dc>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <7dd>   DW_AT_type        : (ref4) <0xda>, char
  <2><7e1>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <7e2>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><7e6>: Abbrev Number: 0
  <1><7e7>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7e8>   DW_AT_name        : (strp) (offset: 0x2483): setattrofunc
+    <7e8>   DW_AT_name        : (strp) (offset: 0x26cf): setattrofunc
     <7ec>   DW_AT_decl_file   : (data1) 2
     <7ed>   DW_AT_decl_line   : (data1) 161
     <7ee>   DW_AT_decl_column : (data1) 15
     <7ef>   DW_AT_type        : (ref4) <0x6ba>, int
  <1><7f3>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7f4>   DW_AT_name        : (strp) (offset: 0xe2e): reprfunc
+    <7f4>   DW_AT_name        : (strp) (offset: 0xef8): reprfunc
     <7f8>   DW_AT_decl_file   : (data1) 2
     <7f9>   DW_AT_decl_line   : (data1) 162
     <7fa>   DW_AT_decl_column : (data1) 21
     <7fb>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
  <1><7ff>: Abbrev Number: 5 (DW_TAG_typedef)
-    <800>   DW_AT_name        : (strp) (offset: 0x193e): hashfunc
+    <800>   DW_AT_name        : (strp) (offset: 0x1ad6): hashfunc
     <804>   DW_AT_decl_file   : (data1) 2
     <805>   DW_AT_decl_line   : (data1) 163
     <806>   DW_AT_decl_column : (data1) 21
     <807>   DW_AT_type        : (ref4) <0x80b>, Py_hash_t, Py_ssize_t, ssize_t, long int
  <1><80b>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <80c>   DW_AT_byte_size   : (data1) 8
     <80d>   DW_AT_type        : (ref4) <0x811>, Py_hash_t, Py_ssize_t, ssize_t, long int
@@ -1071,15 +1071,15 @@
     <812>   DW_AT_prototyped  : (flag_present) 1
     <812>   DW_AT_type        : (ref4) <0x1b5>, Py_hash_t, Py_ssize_t, ssize_t, long int
     <816>   DW_AT_sibling     : (ref4) <0x820>
  <2><81a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <81b>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><81f>: Abbrev Number: 0
  <1><820>: Abbrev Number: 5 (DW_TAG_typedef)
-    <821>   DW_AT_name        : (strp) (offset: 0x1fb1): richcmpfunc
+    <821>   DW_AT_name        : (strp) (offset: 0x21e1): richcmpfunc
     <825>   DW_AT_decl_file   : (data1) 2
     <826>   DW_AT_decl_line   : (data1) 164
     <827>   DW_AT_decl_column : (data1) 21
     <828>   DW_AT_type        : (ref4) <0x82c>, PyObject, _object
  <1><82c>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <82d>   DW_AT_byte_size   : (data1) 8
     <82e>   DW_AT_type        : (ref4) <0x832>, PyObject, _object
@@ -1091,45 +1091,45 @@
     <83c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><840>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <841>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><845>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <846>   DW_AT_type        : (ref4) <0xe6>, int
  <2><84a>: Abbrev Number: 0
  <1><84b>: Abbrev Number: 5 (DW_TAG_typedef)
-    <84c>   DW_AT_name        : (strp) (offset: 0x125a): getiterfunc
+    <84c>   DW_AT_name        : (strp) (offset: 0x1350): getiterfunc
     <850>   DW_AT_decl_file   : (data1) 2
     <851>   DW_AT_decl_line   : (data1) 165
     <852>   DW_AT_decl_column : (data1) 21
     <853>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
  <1><857>: Abbrev Number: 5 (DW_TAG_typedef)
-    <858>   DW_AT_name        : (strp) (offset: 0x1b47): iternextfunc
+    <858>   DW_AT_name        : (strp) (offset: 0x1cfd): iternextfunc
     <85c>   DW_AT_decl_file   : (data1) 2
     <85d>   DW_AT_decl_line   : (data1) 166
     <85e>   DW_AT_decl_column : (data1) 21
     <85f>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
  <1><863>: Abbrev Number: 5 (DW_TAG_typedef)
-    <864>   DW_AT_name        : (strp) (offset: 0x1be4): descrgetfunc
+    <864>   DW_AT_name        : (strp) (offset: 0x1d9a): descrgetfunc
     <868>   DW_AT_decl_file   : (data1) 2
     <869>   DW_AT_decl_line   : (data1) 167
     <86a>   DW_AT_decl_column : (data1) 21
     <86b>   DW_AT_type        : (ref4) <0x5fc>, PyObject, _object
  <1><86f>: Abbrev Number: 5 (DW_TAG_typedef)
-    <870>   DW_AT_name        : (strp) (offset: 0x186e): descrsetfunc
+    <870>   DW_AT_name        : (strp) (offset: 0x1a06): descrsetfunc
     <874>   DW_AT_decl_file   : (data1) 2
     <875>   DW_AT_decl_line   : (data1) 168
     <876>   DW_AT_decl_column : (data1) 15
     <877>   DW_AT_type        : (ref4) <0x6ba>, int
  <1><87b>: Abbrev Number: 5 (DW_TAG_typedef)
-    <87c>   DW_AT_name        : (strp) (offset: 0x1d80): initproc
+    <87c>   DW_AT_name        : (strp) (offset: 0x1f3b): initproc
     <880>   DW_AT_decl_file   : (data1) 2
     <881>   DW_AT_decl_line   : (data1) 169
     <882>   DW_AT_decl_column : (data1) 15
     <883>   DW_AT_type        : (ref4) <0x6ba>, int
  <1><887>: Abbrev Number: 5 (DW_TAG_typedef)
-    <888>   DW_AT_name        : (strp) (offset: 0x1044): newfunc
+    <888>   DW_AT_name        : (strp) (offset: 0x1127): newfunc
     <88c>   DW_AT_decl_file   : (data1) 2
     <88d>   DW_AT_decl_line   : (data1) 170
     <88e>   DW_AT_decl_column : (data1) 21
     <88f>   DW_AT_type        : (ref4) <0x893>, PyObject, _object
  <1><893>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <894>   DW_AT_byte_size   : (data1) 8
     <895>   DW_AT_type        : (ref4) <0x899>, PyObject, _object
@@ -1141,15 +1141,15 @@
     <8a3>   DW_AT_type        : (ref4) <0x55c>, _typeobject
  <2><8a7>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <8a8>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><8ac>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <8ad>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><8b1>: Abbrev Number: 0
  <1><8b2>: Abbrev Number: 5 (DW_TAG_typedef)
-    <8b3>   DW_AT_name        : (strp) (offset: 0x1411): allocfunc
+    <8b3>   DW_AT_name        : (strp) (offset: 0x1543): allocfunc
     <8b7>   DW_AT_decl_file   : (data1) 2
     <8b8>   DW_AT_decl_line   : (data1) 171
     <8b9>   DW_AT_decl_column : (data1) 21
     <8ba>   DW_AT_type        : (ref4) <0x8be>, PyObject, _object
  <1><8be>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <8bf>   DW_AT_byte_size   : (data1) 8
     <8c0>   DW_AT_type        : (ref4) <0x8c4>, PyObject, _object
@@ -1159,55 +1159,55 @@
     <8c9>   DW_AT_sibling     : (ref4) <0x8d8>
  <2><8cd>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <8ce>   DW_AT_type        : (ref4) <0x55c>, _typeobject
  <2><8d2>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <8d3>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <2><8d7>: Abbrev Number: 0
  <1><8d8>: Abbrev Number: 8 (DW_TAG_variable)
-    <8d9>   DW_AT_name        : (strp) (offset: 0x1b95): PyType_Type
+    <8d9>   DW_AT_name        : (strp) (offset: 0x1d4b): PyType_Type
     <8dd>   DW_AT_decl_file   : (data1) 2
     <8de>   DW_AT_decl_line   : (data1) 206
     <8df>   DW_AT_decl_column : (data1) 32
     <8e0>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
     <8e4>   DW_AT_external    : (flag_present) 1
     <8e4>   DW_AT_declaration : (flag_present) 1
  <1><8e4>: Abbrev Number: 8 (DW_TAG_variable)
-    <8e5>   DW_AT_name        : (strp) (offset: 0xa68): PyBaseObject_Type
+    <8e5>   DW_AT_name        : (strp) (offset: 0xb17): PyBaseObject_Type
     <8e9>   DW_AT_decl_file   : (data1) 2
     <8ea>   DW_AT_decl_line   : (data1) 207
     <8eb>   DW_AT_decl_column : (data1) 32
     <8ec>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
     <8f0>   DW_AT_external    : (flag_present) 1
     <8f0>   DW_AT_declaration : (flag_present) 1
  <1><8f0>: Abbrev Number: 8 (DW_TAG_variable)
-    <8f1>   DW_AT_name        : (strp) (offset: 0x16ba): PySuper_Type
+    <8f1>   DW_AT_name        : (strp) (offset: 0x1823): PySuper_Type
     <8f5>   DW_AT_decl_file   : (data1) 2
     <8f6>   DW_AT_decl_line   : (data1) 208
     <8f7>   DW_AT_decl_column : (data1) 32
     <8f8>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
     <8fc>   DW_AT_external    : (flag_present) 1
     <8fc>   DW_AT_declaration : (flag_present) 1
  <1><8fc>: Abbrev Number: 11 (DW_TAG_variable)
-    <8fd>   DW_AT_name        : (strp) (offset: 0x296d): _Py_NoneStruct
+    <8fd>   DW_AT_name        : (strp) (offset: 0x2bd8): _Py_NoneStruct
     <901>   DW_AT_decl_file   : (data1) 2
     <902>   DW_AT_decl_line   : (data2) 560
     <904>   DW_AT_decl_column : (data1) 22
     <905>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
     <909>   DW_AT_external    : (flag_present) 1
     <909>   DW_AT_declaration : (flag_present) 1
  <1><909>: Abbrev Number: 11 (DW_TAG_variable)
-    <90a>   DW_AT_name        : (strp) (offset: 0x70d): _Py_NotImplementedStruct
+    <90a>   DW_AT_name        : (strp) (offset: 0x7ad): _Py_NotImplementedStruct
     <90e>   DW_AT_decl_file   : (data1) 2
     <90f>   DW_AT_decl_line   : (data2) 570
     <911>   DW_AT_decl_column : (data1) 22
     <912>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
     <916>   DW_AT_external    : (flag_present) 1
     <916>   DW_AT_declaration : (flag_present) 1
  <1><916>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <917>   DW_AT_name        : (strp) (offset: 0x2501): bufferinfo
+    <917>   DW_AT_name        : (strp) (offset: 0x274d): bufferinfo
     <91b>   DW_AT_byte_size   : (data1) 80
     <91c>   DW_AT_decl_file   : (data1) 11
     <91d>   DW_AT_decl_line   : (data1) 40
     <91e>   DW_AT_decl_column : (data1) 16
     <91f>   DW_AT_sibling     : (ref4) <0x9b3>
  <2><923>: Abbrev Number: 25 (DW_TAG_member)
     <924>   DW_AT_name        : (string) buf
@@ -1227,81 +1227,81 @@
     <93e>   DW_AT_name        : (string) len
     <942>   DW_AT_decl_file   : (data1) 11
     <943>   DW_AT_decl_line   : (data1) 43
     <944>   DW_AT_decl_column : (data1) 16
     <945>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <949>   DW_AT_data_member_location: (data1) 16
  <2><94a>: Abbrev Number: 17 (DW_TAG_member)
-    <94b>   DW_AT_name        : (strp) (offset: 0x22a4): itemsize
+    <94b>   DW_AT_name        : (strp) (offset: 0x24d4): itemsize
     <94f>   DW_AT_decl_file   : (data1) 11
     <950>   DW_AT_decl_line   : (data1) 44
     <951>   DW_AT_decl_column : (data1) 16
     <952>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
     <956>   DW_AT_data_member_location: (data1) 24
  <2><957>: Abbrev Number: 17 (DW_TAG_member)
-    <958>   DW_AT_name        : (strp) (offset: 0x14dc): readonly
+    <958>   DW_AT_name        : (strp) (offset: 0x162f): readonly
     <95c>   DW_AT_decl_file   : (data1) 11
     <95d>   DW_AT_decl_line   : (data1) 46
     <95e>   DW_AT_decl_column : (data1) 9
     <95f>   DW_AT_type        : (ref4) <0xe6>, int
     <963>   DW_AT_data_member_location: (data1) 32
  <2><964>: Abbrev Number: 17 (DW_TAG_member)
-    <965>   DW_AT_name        : (strp) (offset: 0xb68): ndim
+    <965>   DW_AT_name        : (strp) (offset: 0xc28): ndim
     <969>   DW_AT_decl_file   : (data1) 11
     <96a>   DW_AT_decl_line   : (data1) 47
     <96b>   DW_AT_decl_column : (data1) 9
     <96c>   DW_AT_type        : (ref4) <0xe6>, int
     <970>   DW_AT_data_member_location: (data1) 36
  <2><971>: Abbrev Number: 17 (DW_TAG_member)
-    <972>   DW_AT_name        : (strp) (offset: 0x120e): format
+    <972>   DW_AT_name        : (strp) (offset: 0x1304): format
     <976>   DW_AT_decl_file   : (data1) 11
     <977>   DW_AT_decl_line   : (data1) 48
     <978>   DW_AT_decl_column : (data1) 11
     <979>   DW_AT_type        : (ref4) <0xda>, char
     <97d>   DW_AT_data_member_location: (data1) 40
  <2><97e>: Abbrev Number: 17 (DW_TAG_member)
-    <97f>   DW_AT_name        : (strp) (offset: 0x2571): shape
+    <97f>   DW_AT_name        : (strp) (offset: 0x27bd): shape
     <983>   DW_AT_decl_file   : (data1) 11
     <984>   DW_AT_decl_line   : (data1) 49
     <985>   DW_AT_decl_column : (data1) 17
     <986>   DW_AT_type        : (ref4) <0x9b3>, Py_ssize_t, ssize_t, long int
     <98a>   DW_AT_data_member_location: (data1) 48
  <2><98b>: Abbrev Number: 17 (DW_TAG_member)
-    <98c>   DW_AT_name        : (strp) (offset: 0x268): strides
+    <98c>   DW_AT_name        : (strp) (offset: 0x2a3): strides
     <990>   DW_AT_decl_file   : (data1) 11
     <991>   DW_AT_decl_line   : (data1) 50
     <992>   DW_AT_decl_column : (data1) 17
     <993>   DW_AT_type        : (ref4) <0x9b3>, Py_ssize_t, ssize_t, long int
     <997>   DW_AT_data_member_location: (data1) 56
  <2><998>: Abbrev Number: 17 (DW_TAG_member)
-    <999>   DW_AT_name        : (strp) (offset: 0x17c1): suboffsets
+    <999>   DW_AT_name        : (strp) (offset: 0x194f): suboffsets
     <99d>   DW_AT_decl_file   : (data1) 11
     <99e>   DW_AT_decl_line   : (data1) 51
     <99f>   DW_AT_decl_column : (data1) 17
     <9a0>   DW_AT_type        : (ref4) <0x9b3>, Py_ssize_t, ssize_t, long int
     <9a4>   DW_AT_data_member_location: (data1) 64
  <2><9a5>: Abbrev Number: 17 (DW_TAG_member)
-    <9a6>   DW_AT_name        : (strp) (offset: 0x1627): internal
+    <9a6>   DW_AT_name        : (strp) (offset: 0x1790): internal
     <9aa>   DW_AT_decl_file   : (data1) 11
     <9ab>   DW_AT_decl_line   : (data1) 52
     <9ac>   DW_AT_decl_column : (data1) 11
     <9ad>   DW_AT_type        : (ref4) <0x5e>
     <9b1>   DW_AT_data_member_location: (data1) 72
  <2><9b2>: Abbrev Number: 0
  <1><9b3>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <9b4>   DW_AT_byte_size   : (data1) 8
     <9b5>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
  <1><9b9>: Abbrev Number: 5 (DW_TAG_typedef)
-    <9ba>   DW_AT_name        : (strp) (offset: 0xa3c): Py_buffer
+    <9ba>   DW_AT_name        : (strp) (offset: 0xaeb): Py_buffer
     <9be>   DW_AT_decl_file   : (data1) 11
     <9bf>   DW_AT_decl_line   : (data1) 53
     <9c0>   DW_AT_decl_column : (data1) 3
     <9c1>   DW_AT_type        : (ref4) <0x916>, bufferinfo
  <1><9c5>: Abbrev Number: 5 (DW_TAG_typedef)
-    <9c6>   DW_AT_name        : (strp) (offset: 0x317): getbufferproc
+    <9c6>   DW_AT_name        : (strp) (offset: 0x369): getbufferproc
     <9ca>   DW_AT_decl_file   : (data1) 11
     <9cb>   DW_AT_decl_line   : (data1) 55
     <9cc>   DW_AT_decl_column : (data1) 15
     <9cd>   DW_AT_type        : (ref4) <0x9d1>, int
  <1><9d1>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <9d2>   DW_AT_byte_size   : (data1) 8
     <9d3>   DW_AT_type        : (ref4) <0x9d7>, int
@@ -1316,15 +1316,15 @@
  <2><9ea>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <9eb>   DW_AT_type        : (ref4) <0xe6>, int
  <2><9ef>: Abbrev Number: 0
  <1><9f0>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <9f1>   DW_AT_byte_size   : (data1) 8
     <9f2>   DW_AT_type        : (ref4) <0x9b9>, Py_buffer, bufferinfo
  <1><9f6>: Abbrev Number: 5 (DW_TAG_typedef)
-    <9f7>   DW_AT_name        : (strp) (offset: 0x34f): releasebufferproc
+    <9f7>   DW_AT_name        : (strp) (offset: 0x3a1): releasebufferproc
     <9fb>   DW_AT_decl_file   : (data1) 11
     <9fc>   DW_AT_decl_line   : (data1) 56
     <9fd>   DW_AT_decl_column : (data1) 16
     <9fe>   DW_AT_type        : (ref4) <0xa02>
  <1><a02>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <a03>   DW_AT_byte_size   : (data1) 8
     <a04>   DW_AT_type        : (ref4) <0xa08>
@@ -1333,15 +1333,15 @@
     <a09>   DW_AT_sibling     : (ref4) <0xa18>
  <2><a0d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <a0e>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
  <2><a12>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <a13>   DW_AT_type        : (ref4) <0x9f0>, Py_buffer, bufferinfo
  <2><a17>: Abbrev Number: 0
  <1><a18>: Abbrev Number: 5 (DW_TAG_typedef)
-    <a19>   DW_AT_name        : (strp) (offset: 0x15b1): vectorcallfunc
+    <a19>   DW_AT_name        : (strp) (offset: 0x171a): vectorcallfunc
     <a1d>   DW_AT_decl_file   : (data1) 11
     <a1e>   DW_AT_decl_line   : (data1) 58
     <a1f>   DW_AT_decl_column : (data1) 21
     <a20>   DW_AT_type        : (ref4) <0xa24>, PyObject, _object
  <1><a24>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <a25>   DW_AT_byte_size   : (data1) 8
     <a26>   DW_AT_type        : (ref4) <0xa2a>, PyObject, _object
@@ -1364,446 +1364,446 @@
  <1><a4e>: Abbrev Number: 26 (DW_TAG_structure_type)
     <a4f>   DW_AT_byte_size   : (data2) 288
     <a51>   DW_AT_decl_file   : (data1) 11
     <a52>   DW_AT_decl_line   : (data1) 95
     <a53>   DW_AT_decl_column : (data1) 9
     <a54>   DW_AT_sibling     : (ref4) <0xc31>
  <2><a58>: Abbrev Number: 17 (DW_TAG_member)
-    <a59>   DW_AT_name        : (strp) (offset: 0x32b): nb_add
+    <a59>   DW_AT_name        : (strp) (offset: 0x37d): nb_add
     <a5d>   DW_AT_decl_file   : (data1) 11
     <a5e>   DW_AT_decl_line   : (data1) 100
     <a5f>   DW_AT_decl_column : (data1) 16
     <a60>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <a64>   DW_AT_data_member_location: (data1) 0
  <2><a65>: Abbrev Number: 17 (DW_TAG_member)
-    <a66>   DW_AT_name        : (strp) (offset: 0x332): nb_subtract
+    <a66>   DW_AT_name        : (strp) (offset: 0x384): nb_subtract
     <a6a>   DW_AT_decl_file   : (data1) 11
     <a6b>   DW_AT_decl_line   : (data1) 101
     <a6c>   DW_AT_decl_column : (data1) 16
     <a6d>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <a71>   DW_AT_data_member_location: (data1) 8
  <2><a72>: Abbrev Number: 17 (DW_TAG_member)
-    <a73>   DW_AT_name        : (strp) (offset: 0x23c8): nb_multiply
+    <a73>   DW_AT_name        : (strp) (offset: 0x25f8): nb_multiply
     <a77>   DW_AT_decl_file   : (data1) 11
     <a78>   DW_AT_decl_line   : (data1) 102
     <a79>   DW_AT_decl_column : (data1) 16
     <a7a>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <a7e>   DW_AT_data_member_location: (data1) 16
  <2><a7f>: Abbrev Number: 17 (DW_TAG_member)
-    <a80>   DW_AT_name        : (strp) (offset: 0xad2): nb_remainder
+    <a80>   DW_AT_name        : (strp) (offset: 0xb81): nb_remainder
     <a84>   DW_AT_decl_file   : (data1) 11
     <a85>   DW_AT_decl_line   : (data1) 103
     <a86>   DW_AT_decl_column : (data1) 16
     <a87>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <a8b>   DW_AT_data_member_location: (data1) 24
  <2><a8c>: Abbrev Number: 17 (DW_TAG_member)
-    <a8d>   DW_AT_name        : (strp) (offset: 0x782): nb_divmod
+    <a8d>   DW_AT_name        : (strp) (offset: 0x822): nb_divmod
     <a91>   DW_AT_decl_file   : (data1) 11
     <a92>   DW_AT_decl_line   : (data1) 104
     <a93>   DW_AT_decl_column : (data1) 16
     <a94>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <a98>   DW_AT_data_member_location: (data1) 32
  <2><a99>: Abbrev Number: 17 (DW_TAG_member)
-    <a9a>   DW_AT_name        : (strp) (offset: 0x2895): nb_power
+    <a9a>   DW_AT_name        : (strp) (offset: 0x2b00): nb_power
     <a9e>   DW_AT_decl_file   : (data1) 11
     <a9f>   DW_AT_decl_line   : (data1) 105
     <aa0>   DW_AT_decl_column : (data1) 17
     <aa1>   DW_AT_type        : (ref4) <0x5f0>, ternaryfunc, PyObject, _object
     <aa5>   DW_AT_data_member_location: (data1) 40
  <2><aa6>: Abbrev Number: 17 (DW_TAG_member)
-    <aa7>   DW_AT_name        : (strp) (offset: 0xf5d): nb_negative
+    <aa7>   DW_AT_name        : (strp) (offset: 0x1033): nb_negative
     <aab>   DW_AT_decl_file   : (data1) 11
     <aac>   DW_AT_decl_line   : (data1) 106
     <aad>   DW_AT_decl_column : (data1) 15
     <aae>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <ab2>   DW_AT_data_member_location: (data1) 48
  <2><ab3>: Abbrev Number: 17 (DW_TAG_member)
-    <ab4>   DW_AT_name        : (strp) (offset: 0x1892): nb_positive
+    <ab4>   DW_AT_name        : (strp) (offset: 0x1a2a): nb_positive
     <ab8>   DW_AT_decl_file   : (data1) 11
     <ab9>   DW_AT_decl_line   : (data1) 107
     <aba>   DW_AT_decl_column : (data1) 15
     <abb>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <abf>   DW_AT_data_member_location: (data1) 56
  <2><ac0>: Abbrev Number: 17 (DW_TAG_member)
-    <ac1>   DW_AT_name        : (strp) (offset: 0x4d9): nb_absolute
+    <ac1>   DW_AT_name        : (strp) (offset: 0x53e): nb_absolute
     <ac5>   DW_AT_decl_file   : (data1) 11
     <ac6>   DW_AT_decl_line   : (data1) 108
     <ac7>   DW_AT_decl_column : (data1) 15
     <ac8>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <acc>   DW_AT_data_member_location: (data1) 64
  <2><acd>: Abbrev Number: 17 (DW_TAG_member)
-    <ace>   DW_AT_name        : (strp) (offset: 0x1ea0): nb_bool
+    <ace>   DW_AT_name        : (strp) (offset: 0x2097): nb_bool
     <ad2>   DW_AT_decl_file   : (data1) 11
     <ad3>   DW_AT_decl_line   : (data1) 109
     <ad4>   DW_AT_decl_column : (data1) 13
     <ad5>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
     <ad9>   DW_AT_data_member_location: (data1) 72
  <2><ada>: Abbrev Number: 17 (DW_TAG_member)
-    <adb>   DW_AT_name        : (strp) (offset: 0x1abb): nb_invert
+    <adb>   DW_AT_name        : (strp) (offset: 0x1c71): nb_invert
     <adf>   DW_AT_decl_file   : (data1) 11
     <ae0>   DW_AT_decl_line   : (data1) 110
     <ae1>   DW_AT_decl_column : (data1) 15
     <ae2>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <ae6>   DW_AT_data_member_location: (data1) 80
  <2><ae7>: Abbrev Number: 17 (DW_TAG_member)
-    <ae8>   DW_AT_name        : (strp) (offset: 0xf83): nb_lshift
+    <ae8>   DW_AT_name        : (strp) (offset: 0x1059): nb_lshift
     <aec>   DW_AT_decl_file   : (data1) 11
     <aed>   DW_AT_decl_line   : (data1) 111
     <aee>   DW_AT_decl_column : (data1) 16
     <aef>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <af3>   DW_AT_data_member_location: (data1) 88
  <2><af4>: Abbrev Number: 17 (DW_TAG_member)
-    <af5>   DW_AT_name        : (strp) (offset: 0x1df1): nb_rshift
+    <af5>   DW_AT_name        : (strp) (offset: 0x1fb4): nb_rshift
     <af9>   DW_AT_decl_file   : (data1) 11
     <afa>   DW_AT_decl_line   : (data1) 112
     <afb>   DW_AT_decl_column : (data1) 16
     <afc>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b00>   DW_AT_data_member_location: (data1) 96
  <2><b01>: Abbrev Number: 17 (DW_TAG_member)
-    <b02>   DW_AT_name        : (strp) (offset: 0x11a8): nb_and
+    <b02>   DW_AT_name        : (strp) (offset: 0x1291): nb_and
     <b06>   DW_AT_decl_file   : (data1) 11
     <b07>   DW_AT_decl_line   : (data1) 113
     <b08>   DW_AT_decl_column : (data1) 16
     <b09>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b0d>   DW_AT_data_member_location: (data1) 104
  <2><b0e>: Abbrev Number: 17 (DW_TAG_member)
-    <b0f>   DW_AT_name        : (strp) (offset: 0x361): nb_xor
+    <b0f>   DW_AT_name        : (strp) (offset: 0x3b3): nb_xor
     <b13>   DW_AT_decl_file   : (data1) 11
     <b14>   DW_AT_decl_line   : (data1) 114
     <b15>   DW_AT_decl_column : (data1) 16
     <b16>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b1a>   DW_AT_data_member_location: (data1) 112
  <2><b1b>: Abbrev Number: 17 (DW_TAG_member)
-    <b1c>   DW_AT_name        : (strp) (offset: 0x250c): nb_or
+    <b1c>   DW_AT_name        : (strp) (offset: 0x2758): nb_or
     <b20>   DW_AT_decl_file   : (data1) 11
     <b21>   DW_AT_decl_line   : (data1) 115
     <b22>   DW_AT_decl_column : (data1) 16
     <b23>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b27>   DW_AT_data_member_location: (data1) 120
  <2><b28>: Abbrev Number: 17 (DW_TAG_member)
-    <b29>   DW_AT_name        : (strp) (offset: 0x173): nb_int
+    <b29>   DW_AT_name        : (strp) (offset: 0x196): nb_int
     <b2d>   DW_AT_decl_file   : (data1) 11
     <b2e>   DW_AT_decl_line   : (data1) 116
     <b2f>   DW_AT_decl_column : (data1) 15
     <b30>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <b34>   DW_AT_data_member_location: (data1) 128
  <2><b35>: Abbrev Number: 17 (DW_TAG_member)
-    <b36>   DW_AT_name        : (strp) (offset: 0x12a): nb_reserved
+    <b36>   DW_AT_name        : (strp) (offset: 0x14d): nb_reserved
     <b3a>   DW_AT_decl_file   : (data1) 11
     <b3b>   DW_AT_decl_line   : (data1) 117
     <b3c>   DW_AT_decl_column : (data1) 11
     <b3d>   DW_AT_type        : (ref4) <0x5e>
     <b41>   DW_AT_data_member_location: (data1) 136
  <2><b42>: Abbrev Number: 17 (DW_TAG_member)
-    <b43>   DW_AT_name        : (strp) (offset: 0xa10): nb_float
+    <b43>   DW_AT_name        : (strp) (offset: 0xabf): nb_float
     <b47>   DW_AT_decl_file   : (data1) 11
     <b48>   DW_AT_decl_line   : (data1) 118
     <b49>   DW_AT_decl_column : (data1) 15
     <b4a>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <b4e>   DW_AT_data_member_location: (data1) 144
  <2><b4f>: Abbrev Number: 17 (DW_TAG_member)
-    <b50>   DW_AT_name        : (strp) (offset: 0x1113): nb_inplace_add
+    <b50>   DW_AT_name        : (strp) (offset: 0x11f6): nb_inplace_add
     <b54>   DW_AT_decl_file   : (data1) 11
     <b55>   DW_AT_decl_line   : (data1) 120
     <b56>   DW_AT_decl_column : (data1) 16
     <b57>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b5b>   DW_AT_data_member_location: (data1) 152
  <2><b5c>: Abbrev Number: 17 (DW_TAG_member)
-    <b5d>   DW_AT_name        : (strp) (offset: 0x10a3): nb_inplace_subtract
+    <b5d>   DW_AT_name        : (strp) (offset: 0x1186): nb_inplace_subtract
     <b61>   DW_AT_decl_file   : (data1) 11
     <b62>   DW_AT_decl_line   : (data1) 121
     <b63>   DW_AT_decl_column : (data1) 16
     <b64>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b68>   DW_AT_data_member_location: (data1) 160
  <2><b69>: Abbrev Number: 17 (DW_TAG_member)
-    <b6a>   DW_AT_name        : (strp) (offset: 0x5c9): nb_inplace_multiply
+    <b6a>   DW_AT_name        : (strp) (offset: 0x669): nb_inplace_multiply
     <b6e>   DW_AT_decl_file   : (data1) 11
     <b6f>   DW_AT_decl_line   : (data1) 122
     <b70>   DW_AT_decl_column : (data1) 16
     <b71>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b75>   DW_AT_data_member_location: (data1) 168
  <2><b76>: Abbrev Number: 17 (DW_TAG_member)
-    <b77>   DW_AT_name        : (strp) (offset: 0xfb): nb_inplace_remainder
+    <b77>   DW_AT_name        : (strp) (offset: 0x11e): nb_inplace_remainder
     <b7b>   DW_AT_decl_file   : (data1) 11
     <b7c>   DW_AT_decl_line   : (data1) 123
     <b7d>   DW_AT_decl_column : (data1) 16
     <b7e>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b82>   DW_AT_data_member_location: (data1) 176
  <2><b83>: Abbrev Number: 17 (DW_TAG_member)
-    <b84>   DW_AT_name        : (strp) (offset: 0xa8b): nb_inplace_power
+    <b84>   DW_AT_name        : (strp) (offset: 0xb3a): nb_inplace_power
     <b88>   DW_AT_decl_file   : (data1) 11
     <b89>   DW_AT_decl_line   : (data1) 124
     <b8a>   DW_AT_decl_column : (data1) 17
     <b8b>   DW_AT_type        : (ref4) <0x5f0>, ternaryfunc, PyObject, _object
     <b8f>   DW_AT_data_member_location: (data1) 184
  <2><b90>: Abbrev Number: 17 (DW_TAG_member)
-    <b91>   DW_AT_name        : (strp) (offset: 0x1556): nb_inplace_lshift
+    <b91>   DW_AT_name        : (strp) (offset: 0x16bf): nb_inplace_lshift
     <b95>   DW_AT_decl_file   : (data1) 11
     <b96>   DW_AT_decl_line   : (data1) 125
     <b97>   DW_AT_decl_column : (data1) 16
     <b98>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <b9c>   DW_AT_data_member_location: (data1) 192
  <2><b9d>: Abbrev Number: 17 (DW_TAG_member)
-    <b9e>   DW_AT_name        : (strp) (offset: 0x239f): nb_inplace_rshift
+    <b9e>   DW_AT_name        : (strp) (offset: 0x25cf): nb_inplace_rshift
     <ba2>   DW_AT_decl_file   : (data1) 11
     <ba3>   DW_AT_decl_line   : (data1) 126
     <ba4>   DW_AT_decl_column : (data1) 16
     <ba5>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <ba9>   DW_AT_data_member_location: (data1) 200
  <2><baa>: Abbrev Number: 17 (DW_TAG_member)
-    <bab>   DW_AT_name        : (strp) (offset: 0x1e36): nb_inplace_and
+    <bab>   DW_AT_name        : (strp) (offset: 0x2012): nb_inplace_and
     <baf>   DW_AT_decl_file   : (data1) 11
     <bb0>   DW_AT_decl_line   : (data1) 127
     <bb1>   DW_AT_decl_column : (data1) 16
     <bb2>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bb6>   DW_AT_data_member_location: (data1) 208
  <2><bb7>: Abbrev Number: 17 (DW_TAG_member)
-    <bb8>   DW_AT_name        : (strp) (offset: 0x115c): nb_inplace_xor
+    <bb8>   DW_AT_name        : (strp) (offset: 0x123f): nb_inplace_xor
     <bbc>   DW_AT_decl_file   : (data1) 11
     <bbd>   DW_AT_decl_line   : (data1) 128
     <bbe>   DW_AT_decl_column : (data1) 16
     <bbf>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bc3>   DW_AT_data_member_location: (data1) 216
  <2><bc4>: Abbrev Number: 17 (DW_TAG_member)
-    <bc5>   DW_AT_name        : (strp) (offset: 0x6ff): nb_inplace_or
+    <bc5>   DW_AT_name        : (strp) (offset: 0x79f): nb_inplace_or
     <bc9>   DW_AT_decl_file   : (data1) 11
     <bca>   DW_AT_decl_line   : (data1) 129
     <bcb>   DW_AT_decl_column : (data1) 16
     <bcc>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bd0>   DW_AT_data_member_location: (data1) 224
  <2><bd1>: Abbrev Number: 17 (DW_TAG_member)
-    <bd2>   DW_AT_name        : (strp) (offset: 0x566): nb_floor_divide
+    <bd2>   DW_AT_name        : (strp) (offset: 0x605): nb_floor_divide
     <bd6>   DW_AT_decl_file   : (data1) 11
     <bd7>   DW_AT_decl_line   : (data1) 131
     <bd8>   DW_AT_decl_column : (data1) 16
     <bd9>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bdd>   DW_AT_data_member_location: (data1) 232
  <2><bde>: Abbrev Number: 17 (DW_TAG_member)
-    <bdf>   DW_AT_name        : (strp) (offset: 0x7ed): nb_true_divide
+    <bdf>   DW_AT_name        : (strp) (offset: 0x88d): nb_true_divide
     <be3>   DW_AT_decl_file   : (data1) 11
     <be4>   DW_AT_decl_line   : (data1) 132
     <be5>   DW_AT_decl_column : (data1) 16
     <be6>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bea>   DW_AT_data_member_location: (data1) 240
  <2><beb>: Abbrev Number: 17 (DW_TAG_member)
-    <bec>   DW_AT_name        : (strp) (offset: 0x242e): nb_inplace_floor_divide
+    <bec>   DW_AT_name        : (strp) (offset: 0x266b): nb_inplace_floor_divide
     <bf0>   DW_AT_decl_file   : (data1) 11
     <bf1>   DW_AT_decl_line   : (data1) 133
     <bf2>   DW_AT_decl_column : (data1) 16
     <bf3>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <bf7>   DW_AT_data_member_location: (data1) 248
  <2><bf8>: Abbrev Number: 19 (DW_TAG_member)
-    <bf9>   DW_AT_name        : (strp) (offset: 0x9f9): nb_inplace_true_divide
+    <bf9>   DW_AT_name        : (strp) (offset: 0xaa8): nb_inplace_true_divide
     <bfd>   DW_AT_decl_file   : (data1) 11
     <bfe>   DW_AT_decl_line   : (data1) 134
     <bff>   DW_AT_decl_column : (data1) 16
     <c00>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <c04>   DW_AT_data_member_location: (data2) 256
  <2><c06>: Abbrev Number: 19 (DW_TAG_member)
-    <c07>   DW_AT_name        : (strp) (offset: 0x1dc6): nb_index
+    <c07>   DW_AT_name        : (strp) (offset: 0x1f89): nb_index
     <c0b>   DW_AT_decl_file   : (data1) 11
     <c0c>   DW_AT_decl_line   : (data1) 136
     <c0d>   DW_AT_decl_column : (data1) 15
     <c0e>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <c12>   DW_AT_data_member_location: (data2) 264
  <2><c14>: Abbrev Number: 19 (DW_TAG_member)
-    <c15>   DW_AT_name        : (strp) (offset: 0xb24): nb_matrix_multiply
+    <c15>   DW_AT_name        : (strp) (offset: 0xbd3): nb_matrix_multiply
     <c19>   DW_AT_decl_file   : (data1) 11
     <c1a>   DW_AT_decl_line   : (data1) 138
     <c1b>   DW_AT_decl_column : (data1) 16
     <c1c>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <c20>   DW_AT_data_member_location: (data2) 272
  <2><c22>: Abbrev Number: 19 (DW_TAG_member)
-    <c23>   DW_AT_name        : (strp) (offset: 0xffe): nb_inplace_matrix_multiply
+    <c23>   DW_AT_name        : (strp) (offset: 0x10e1): nb_inplace_matrix_multiply
     <c27>   DW_AT_decl_file   : (data1) 11
     <c28>   DW_AT_decl_line   : (data1) 139
     <c29>   DW_AT_decl_column : (data1) 16
     <c2a>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <c2e>   DW_AT_data_member_location: (data2) 280
  <2><c30>: Abbrev Number: 0
  <1><c31>: Abbrev Number: 5 (DW_TAG_typedef)
-    <c32>   DW_AT_name        : (strp) (offset: 0x132a): PyNumberMethods
+    <c32>   DW_AT_name        : (strp) (offset: 0x1439): PyNumberMethods
     <c36>   DW_AT_decl_file   : (data1) 11
     <c37>   DW_AT_decl_line   : (data1) 140
     <c38>   DW_AT_decl_column : (data1) 3
     <c39>   DW_AT_type        : (ref4) <0xa4e>
  <1><c3d>: Abbrev Number: 21 (DW_TAG_structure_type)
     <c3e>   DW_AT_byte_size   : (data1) 80
     <c3f>   DW_AT_decl_file   : (data1) 11
     <c40>   DW_AT_decl_line   : (data1) 142
     <c41>   DW_AT_decl_column : (data1) 9
     <c42>   DW_AT_sibling     : (ref4) <0xcc9>
  <2><c46>: Abbrev Number: 17 (DW_TAG_member)
-    <c47>   DW_AT_name        : (strp) (offset: 0x270a): sq_length
+    <c47>   DW_AT_name        : (strp) (offset: 0x2956): sq_length
     <c4b>   DW_AT_decl_file   : (data1) 11
     <c4c>   DW_AT_decl_line   : (data1) 143
     <c4d>   DW_AT_decl_column : (data1) 13
     <c4e>   DW_AT_type        : (ref4) <0x63c>, lenfunc, Py_ssize_t, ssize_t, long int
     <c52>   DW_AT_data_member_location: (data1) 0
  <2><c53>: Abbrev Number: 17 (DW_TAG_member)
-    <c54>   DW_AT_name        : (strp) (offset: 0x12a5): sq_concat
+    <c54>   DW_AT_name        : (strp) (offset: 0x139b): sq_concat
     <c58>   DW_AT_decl_file   : (data1) 11
     <c59>   DW_AT_decl_line   : (data1) 144
     <c5a>   DW_AT_decl_column : (data1) 16
     <c5b>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <c5f>   DW_AT_data_member_location: (data1) 8
  <2><c60>: Abbrev Number: 17 (DW_TAG_member)
-    <c61>   DW_AT_name        : (strp) (offset: 0xa21): sq_repeat
+    <c61>   DW_AT_name        : (strp) (offset: 0xad0): sq_repeat
     <c65>   DW_AT_decl_file   : (data1) 11
     <c66>   DW_AT_decl_line   : (data1) 145
     <c67>   DW_AT_decl_column : (data1) 18
     <c68>   DW_AT_type        : (ref4) <0x65d>, ssizeargfunc, PyObject, _object
     <c6c>   DW_AT_data_member_location: (data1) 16
  <2><c6d>: Abbrev Number: 17 (DW_TAG_member)
-    <c6e>   DW_AT_name        : (strp) (offset: 0x1a32): sq_item
+    <c6e>   DW_AT_name        : (strp) (offset: 0x1bca): sq_item
     <c72>   DW_AT_decl_file   : (data1) 11
     <c73>   DW_AT_decl_line   : (data1) 146
     <c74>   DW_AT_decl_column : (data1) 18
     <c75>   DW_AT_type        : (ref4) <0x65d>, ssizeargfunc, PyObject, _object
     <c79>   DW_AT_data_member_location: (data1) 24
  <2><c7a>: Abbrev Number: 17 (DW_TAG_member)
-    <c7b>   DW_AT_name        : (strp) (offset: 0x2987): was_sq_slice
+    <c7b>   DW_AT_name        : (strp) (offset: 0x2bf2): was_sq_slice
     <c7f>   DW_AT_decl_file   : (data1) 11
     <c80>   DW_AT_decl_line   : (data1) 147
     <c81>   DW_AT_decl_column : (data1) 11
     <c82>   DW_AT_type        : (ref4) <0x5e>
     <c86>   DW_AT_data_member_location: (data1) 32
  <2><c87>: Abbrev Number: 17 (DW_TAG_member)
-    <c88>   DW_AT_name        : (strp) (offset: 0x1f86): sq_ass_item
+    <c88>   DW_AT_name        : (strp) (offset: 0x21b6): sq_ass_item
     <c8c>   DW_AT_decl_file   : (data1) 11
     <c8d>   DW_AT_decl_line   : (data1) 148
     <c8e>   DW_AT_decl_column : (data1) 21
     <c8f>   DW_AT_type        : (ref4) <0x683>, ssizeobjargproc, int
     <c93>   DW_AT_data_member_location: (data1) 40
  <2><c94>: Abbrev Number: 17 (DW_TAG_member)
-    <c95>   DW_AT_name        : (strp) (offset: 0x1a03): was_sq_ass_slice
+    <c95>   DW_AT_name        : (strp) (offset: 0x1b9b): was_sq_ass_slice
     <c99>   DW_AT_decl_file   : (data1) 11
     <c9a>   DW_AT_decl_line   : (data1) 149
     <c9b>   DW_AT_decl_column : (data1) 11
     <c9c>   DW_AT_type        : (ref4) <0x5e>
     <ca0>   DW_AT_data_member_location: (data1) 48
  <2><ca1>: Abbrev Number: 17 (DW_TAG_member)
-    <ca2>   DW_AT_name        : (strp) (offset: 0x264d): sq_contains
+    <ca2>   DW_AT_name        : (strp) (offset: 0x2899): sq_contains
     <ca6>   DW_AT_decl_file   : (data1) 11
     <ca7>   DW_AT_decl_line   : (data1) 150
     <ca8>   DW_AT_decl_column : (data1) 16
     <ca9>   DW_AT_type        : (ref4) <0x6d9>, objobjproc, int
     <cad>   DW_AT_data_member_location: (data1) 56
  <2><cae>: Abbrev Number: 17 (DW_TAG_member)
-    <caf>   DW_AT_name        : (strp) (offset: 0x1a9a): sq_inplace_concat
+    <caf>   DW_AT_name        : (strp) (offset: 0x1c49): sq_inplace_concat
     <cb3>   DW_AT_decl_file   : (data1) 11
     <cb4>   DW_AT_decl_line   : (data1) 152
     <cb5>   DW_AT_decl_column : (data1) 16
     <cb6>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <cba>   DW_AT_data_member_location: (data1) 64
  <2><cbb>: Abbrev Number: 17 (DW_TAG_member)
-    <cbc>   DW_AT_name        : (strp) (offset: 0x133a): sq_inplace_repeat
+    <cbc>   DW_AT_name        : (strp) (offset: 0x1449): sq_inplace_repeat
     <cc0>   DW_AT_decl_file   : (data1) 11
     <cc1>   DW_AT_decl_line   : (data1) 153
     <cc2>   DW_AT_decl_column : (data1) 18
     <cc3>   DW_AT_type        : (ref4) <0x65d>, ssizeargfunc, PyObject, _object
     <cc7>   DW_AT_data_member_location: (data1) 72
  <2><cc8>: Abbrev Number: 0
  <1><cc9>: Abbrev Number: 5 (DW_TAG_typedef)
-    <cca>   DW_AT_name        : (strp) (offset: 0x2538): PySequenceMethods
+    <cca>   DW_AT_name        : (strp) (offset: 0x2784): PySequenceMethods
     <cce>   DW_AT_decl_file   : (data1) 11
     <ccf>   DW_AT_decl_line   : (data1) 154
     <cd0>   DW_AT_decl_column : (data1) 3
     <cd1>   DW_AT_type        : (ref4) <0xc3d>
  <1><cd5>: Abbrev Number: 21 (DW_TAG_structure_type)
     <cd6>   DW_AT_byte_size   : (data1) 24
     <cd7>   DW_AT_decl_file   : (data1) 11
     <cd8>   DW_AT_decl_line   : (data1) 156
     <cd9>   DW_AT_decl_column : (data1) 9
     <cda>   DW_AT_sibling     : (ref4) <0xd06>
  <2><cde>: Abbrev Number: 17 (DW_TAG_member)
-    <cdf>   DW_AT_name        : (strp) (offset: 0x1963): mp_length
+    <cdf>   DW_AT_name        : (strp) (offset: 0x1afb): mp_length
     <ce3>   DW_AT_decl_file   : (data1) 11
     <ce4>   DW_AT_decl_line   : (data1) 157
     <ce5>   DW_AT_decl_column : (data1) 13
     <ce6>   DW_AT_type        : (ref4) <0x63c>, lenfunc, Py_ssize_t, ssize_t, long int
     <cea>   DW_AT_data_member_location: (data1) 0
  <2><ceb>: Abbrev Number: 17 (DW_TAG_member)
-    <cec>   DW_AT_name        : (strp) (offset: 0x1d04): mp_subscript
+    <cec>   DW_AT_name        : (strp) (offset: 0x1ea9): mp_subscript
     <cf0>   DW_AT_decl_file   : (data1) 11
     <cf1>   DW_AT_decl_line   : (data1) 158
     <cf2>   DW_AT_decl_column : (data1) 16
     <cf3>   DW_AT_type        : (ref4) <0x5ca>, binaryfunc, PyObject, _object
     <cf7>   DW_AT_data_member_location: (data1) 8
  <2><cf8>: Abbrev Number: 17 (DW_TAG_member)
-    <cf9>   DW_AT_name        : (strp) (offset: 0x599): mp_ass_subscript
+    <cf9>   DW_AT_name        : (strp) (offset: 0x639): mp_ass_subscript
     <cfd>   DW_AT_decl_file   : (data1) 11
     <cfe>   DW_AT_decl_line   : (data1) 159
     <cff>   DW_AT_decl_column : (data1) 19
     <d00>   DW_AT_type        : (ref4) <0x6ae>, objobjargproc, int
     <d04>   DW_AT_data_member_location: (data1) 16
  <2><d05>: Abbrev Number: 0
  <1><d06>: Abbrev Number: 5 (DW_TAG_typedef)
-    <d07>   DW_AT_name        : (strp) (offset: 0xa46): PyMappingMethods
+    <d07>   DW_AT_name        : (strp) (offset: 0xaf5): PyMappingMethods
     <d0b>   DW_AT_decl_file   : (data1) 11
     <d0c>   DW_AT_decl_line   : (data1) 160
     <d0d>   DW_AT_decl_column : (data1) 3
     <d0e>   DW_AT_type        : (ref4) <0xcd5>
  <1><d12>: Abbrev Number: 21 (DW_TAG_structure_type)
     <d13>   DW_AT_byte_size   : (data1) 24
     <d14>   DW_AT_decl_file   : (data1) 11
     <d15>   DW_AT_decl_line   : (data1) 162
     <d16>   DW_AT_decl_column : (data1) 9
     <d17>   DW_AT_sibling     : (ref4) <0xd43>
  <2><d1b>: Abbrev Number: 17 (DW_TAG_member)
-    <d1c>   DW_AT_name        : (strp) (offset: 0x299e): am_await
+    <d1c>   DW_AT_name        : (strp) (offset: 0x2c09): am_await
     <d20>   DW_AT_decl_file   : (data1) 11
     <d21>   DW_AT_decl_line   : (data1) 163
     <d22>   DW_AT_decl_column : (data1) 15
     <d23>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <d27>   DW_AT_data_member_location: (data1) 0
  <2><d28>: Abbrev Number: 17 (DW_TAG_member)
-    <d29>   DW_AT_name        : (strp) (offset: 0x1921): am_aiter
+    <d29>   DW_AT_name        : (strp) (offset: 0x1ab9): am_aiter
     <d2d>   DW_AT_decl_file   : (data1) 11
     <d2e>   DW_AT_decl_line   : (data1) 164
     <d2f>   DW_AT_decl_column : (data1) 15
     <d30>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <d34>   DW_AT_data_member_location: (data1) 8
  <2><d35>: Abbrev Number: 17 (DW_TAG_member)
-    <d36>   DW_AT_name        : (strp) (offset: 0x1e45): am_anext
+    <d36>   DW_AT_name        : (strp) (offset: 0x2021): am_anext
     <d3a>   DW_AT_decl_file   : (data1) 11
     <d3b>   DW_AT_decl_line   : (data1) 165
     <d3c>   DW_AT_decl_column : (data1) 15
     <d3d>   DW_AT_type        : (ref4) <0x59e>, unaryfunc, PyObject, _object
     <d41>   DW_AT_data_member_location: (data1) 16
  <2><d42>: Abbrev Number: 0
  <1><d43>: Abbrev Number: 5 (DW_TAG_typedef)
-    <d44>   DW_AT_name        : (strp) (offset: 0x19f4): PyAsyncMethods
+    <d44>   DW_AT_name        : (strp) (offset: 0x1b8c): PyAsyncMethods
     <d48>   DW_AT_decl_file   : (data1) 11
     <d49>   DW_AT_decl_line   : (data1) 166
     <d4a>   DW_AT_decl_column : (data1) 3
     <d4b>   DW_AT_type        : (ref4) <0xd12>
  <1><d4f>: Abbrev Number: 21 (DW_TAG_structure_type)
     <d50>   DW_AT_byte_size   : (data1) 16
     <d51>   DW_AT_decl_file   : (data1) 11
     <d52>   DW_AT_decl_line   : (data1) 168
     <d53>   DW_AT_decl_column : (data1) 9
     <d54>   DW_AT_sibling     : (ref4) <0xd73>
  <2><d58>: Abbrev Number: 17 (DW_TAG_member)
-    <d59>   DW_AT_name        : (strp) (offset: 0x1b80): bf_getbuffer
+    <d59>   DW_AT_name        : (strp) (offset: 0x1d36): bf_getbuffer
     <d5d>   DW_AT_decl_file   : (data1) 11
     <d5e>   DW_AT_decl_line   : (data1) 169
     <d5f>   DW_AT_decl_column : (data1) 20
     <d60>   DW_AT_type        : (ref4) <0x9c5>, getbufferproc, int
     <d64>   DW_AT_data_member_location: (data1) 0
  <2><d65>: Abbrev Number: 17 (DW_TAG_member)
-    <d66>   DW_AT_name        : (strp) (offset: 0x174b): bf_releasebuffer
+    <d66>   DW_AT_name        : (strp) (offset: 0x18c2): bf_releasebuffer
     <d6a>   DW_AT_decl_file   : (data1) 11
     <d6b>   DW_AT_decl_line   : (data1) 170
     <d6c>   DW_AT_decl_column : (data1) 24
     <d6d>   DW_AT_type        : (ref4) <0x9f6>, releasebufferproc
     <d71>   DW_AT_data_member_location: (data1) 8
  <2><d72>: Abbrev Number: 0
  <1><d73>: Abbrev Number: 5 (DW_TAG_typedef)
-    <d74>   DW_AT_name        : (strp) (offset: 0x87d): PyBufferProcs
+    <d74>   DW_AT_name        : (strp) (offset: 0x91d): PyBufferProcs
     <d78>   DW_AT_decl_file   : (data1) 11
     <d79>   DW_AT_decl_line   : (data1) 171
     <d7a>   DW_AT_decl_column : (data1) 3
     <d7b>   DW_AT_type        : (ref4) <0xd4f>
  <1><d7f>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <d80>   DW_AT_byte_size   : (data1) 8
     <d81>   DW_AT_type        : (ref4) <0xd43>, PyAsyncMethods
@@ -1816,67 +1816,67 @@
  <1><d91>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <d92>   DW_AT_byte_size   : (data1) 8
     <d93>   DW_AT_type        : (ref4) <0xd06>, PyMappingMethods
  <1><d97>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <d98>   DW_AT_byte_size   : (data1) 8
     <d99>   DW_AT_type        : (ref4) <0xd73>, PyBufferProcs
  <1><d9d>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <d9e>   DW_AT_name        : (strp) (offset: 0x14a): PyMethodDef
+    <d9e>   DW_AT_name        : (strp) (offset: 0x16d): PyMethodDef
     <da2>   DW_AT_byte_size   : (data1) 32
     <da3>   DW_AT_decl_file   : (data1) 12
     <da4>   DW_AT_decl_line   : (data1) 51
     <da5>   DW_AT_decl_column : (data1) 8
     <da6>   DW_AT_sibling     : (ref4) <0xddf>
  <2><daa>: Abbrev Number: 17 (DW_TAG_member)
-    <dab>   DW_AT_name        : (strp) (offset: 0x2a57): ml_name
+    <dab>   DW_AT_name        : (strp) (offset: 0x2cbd): ml_name
     <daf>   DW_AT_decl_file   : (data1) 12
     <db0>   DW_AT_decl_line   : (data1) 52
     <db1>   DW_AT_decl_column : (data1) 18
     <db2>   DW_AT_type        : (ref4) <0xe0>, char
     <db6>   DW_AT_data_member_location: (data1) 0
  <2><db7>: Abbrev Number: 17 (DW_TAG_member)
-    <db8>   DW_AT_name        : (strp) (offset: 0x1630): ml_meth
+    <db8>   DW_AT_name        : (strp) (offset: 0x1799): ml_meth
     <dbc>   DW_AT_decl_file   : (data1) 12
     <dbd>   DW_AT_decl_line   : (data1) 53
     <dbe>   DW_AT_decl_column : (data1) 17
     <dbf>   DW_AT_type        : (ref4) <0x1495>, PyCFunction, PyObject, _object
     <dc3>   DW_AT_data_member_location: (data1) 8
  <2><dc4>: Abbrev Number: 17 (DW_TAG_member)
-    <dc5>   DW_AT_name        : (strp) (offset: 0x25f6): ml_flags
+    <dc5>   DW_AT_name        : (strp) (offset: 0x2842): ml_flags
     <dc9>   DW_AT_decl_file   : (data1) 12
     <dca>   DW_AT_decl_line   : (data1) 54
     <dcb>   DW_AT_decl_column : (data1) 17
     <dcc>   DW_AT_type        : (ref4) <0xe6>, int
     <dd0>   DW_AT_data_member_location: (data1) 16
  <2><dd1>: Abbrev Number: 17 (DW_TAG_member)
-    <dd2>   DW_AT_name        : (strp) (offset: 0x2590): ml_doc
+    <dd2>   DW_AT_name        : (strp) (offset: 0x27dc): ml_doc
     <dd6>   DW_AT_decl_file   : (data1) 12
     <dd7>   DW_AT_decl_line   : (data1) 56
     <dd8>   DW_AT_decl_column : (data1) 18
     <dd9>   DW_AT_type        : (ref4) <0xe0>, char
     <ddd>   DW_AT_data_member_location: (data1) 24
  <2><dde>: Abbrev Number: 0
  <1><ddf>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <de0>   DW_AT_byte_size   : (data1) 8
     <de1>   DW_AT_type        : (ref4) <0xd9d>, PyMethodDef
  <1><de5>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <de6>   DW_AT_name        : (strp) (offset: 0xafc): PyMemberDef
+    <de6>   DW_AT_name        : (strp) (offset: 0xbab): PyMemberDef
     <dea>   DW_AT_declaration : (flag_present) 1
  <1><dea>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <deb>   DW_AT_byte_size   : (data1) 8
     <dec>   DW_AT_type        : (ref4) <0xde5>, PyMemberDef
  <1><df0>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <df1>   DW_AT_name        : (strp) (offset: 0x1fbd): PyGetSetDef
+    <df1>   DW_AT_name        : (strp) (offset: 0x21ed): PyGetSetDef
     <df5>   DW_AT_byte_size   : (data1) 40
     <df6>   DW_AT_decl_file   : (data1) 13
     <df7>   DW_AT_decl_line   : (data1) 11
     <df8>   DW_AT_decl_column : (data1) 16
     <df9>   DW_AT_sibling     : (ref4) <0xe3f>
  <2><dfd>: Abbrev Number: 17 (DW_TAG_member)
-    <dfe>   DW_AT_name        : (strp) (offset: 0x1d69): name
+    <dfe>   DW_AT_name        : (strp) (offset: 0x1f24): name
     <e02>   DW_AT_decl_file   : (data1) 13
     <e03>   DW_AT_decl_line   : (data1) 12
     <e04>   DW_AT_decl_column : (data1) 17
     <e05>   DW_AT_type        : (ref4) <0xe0>, char
     <e09>   DW_AT_data_member_location: (data1) 0
  <2><e0a>: Abbrev Number: 25 (DW_TAG_member)
     <e0b>   DW_AT_name        : (string) get
@@ -1896,15 +1896,15 @@
     <e25>   DW_AT_name        : (string) doc
     <e29>   DW_AT_decl_file   : (data1) 13
     <e2a>   DW_AT_decl_line   : (data1) 15
     <e2b>   DW_AT_decl_column : (data1) 17
     <e2c>   DW_AT_type        : (ref4) <0xe0>, char
     <e30>   DW_AT_data_member_location: (data1) 24
  <2><e31>: Abbrev Number: 17 (DW_TAG_member)
-    <e32>   DW_AT_name        : (strp) (offset: 0x119b): closure
+    <e32>   DW_AT_name        : (strp) (offset: 0x127e): closure
     <e36>   DW_AT_decl_file   : (data1) 13
     <e37>   DW_AT_decl_line   : (data1) 16
     <e38>   DW_AT_decl_column : (data1) 11
     <e39>   DW_AT_type        : (ref4) <0x5e>
     <e3d>   DW_AT_data_member_location: (data1) 32
  <2><e3e>: Abbrev Number: 0
  <1><e3f>: Abbrev Number: 9 (DW_TAG_pointer_type)
@@ -1921,66 +1921,66 @@
  <2><e58>: Abbrev Number: 23 (DW_TAG_formal_parameter)
     <e59>   DW_AT_type        : (ref4) <0xe6>, int
  <2><e5d>: Abbrev Number: 0
  <1><e5e>: Abbrev Number: 9 (DW_TAG_pointer_type)
     <e5f>   DW_AT_byte_size   : (data1) 8
     <e60>   DW_AT_type        : (ref4) <0xe45>, int
  <1><e64>: Abbrev Number: 6 (DW_TAG_typedef)
-    <e65>   DW_AT_name        : (strp) (offset: 0xcd4): PyTypeObject
+    <e65>   DW_AT_name        : (strp) (offset: 0xd94): PyTypeObject
     <e69>   DW_AT_decl_file   : (data1) 11
     <e6a>   DW_AT_decl_line   : (data2) 270
     <e6c>   DW_AT_decl_column : (data1) 3
     <e6d>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
  <1><e71>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <e72>   DW_AT_name        : (strp) (offset: 0x127d): _dictkeysobject
+    <e72>   DW_AT_name        : (strp) (offset: 0x1373): _dictkeysobject
     <e76>   DW_AT_declaration : (flag_present) 1
  <1><e76>: Abbrev Number: 11 (DW_TAG_variable)
-    <e77>   DW_AT_name        : (strp) (offset: 0x1e6b): _PyNone_Type
+    <e77>   DW_AT_name        : (strp) (offset: 0x2054): _PyNone_Type
     <e7b>   DW_AT_decl_file   : (data1) 11
     <e7c>   DW_AT_decl_line   : (data2) 386
     <e7e>   DW_AT_decl_column : (data1) 26
     <e7f>   DW_AT_type        : (ref4) <0xe64>, PyTypeObject, _typeobject
     <e83>   DW_AT_external    : (flag_present) 1
     <e83>   DW_AT_declaration : (flag_present) 1
  <1><e83>: Abbrev Number: 11 (DW_TAG_variable)
-    <e84>   DW_AT_name        : (strp) (offset: 0x7bb): _PyNotImplemented_Type
+    <e84>   DW_AT_name        : (strp) (offset: 0x85b): _PyNotImplemented_Type
     <e88>   DW_AT_decl_file   : (data1) 11
     <e89>   DW_AT_decl_line   : (data2) 387
     <e8b>   DW_AT_decl_column : (data1) 26
     <e8c>   DW_AT_type        : (ref4) <0xe64>, PyTypeObject, _typeobject
     <e90>   DW_AT_external    : (flag_present) 1
     <e90>   DW_AT_declaration : (flag_present) 1
  <1><e90>: Abbrev Number: 12 (DW_TAG_array_type)
     <e91>   DW_AT_type        : (ref4) <0xe6>, int
     <e95>   DW_AT_sibling     : (ref4) <0xe9b>
  <2><e99>: Abbrev Number: 27 (DW_TAG_subrange_type)
  <2><e9a>: Abbrev Number: 0
  <1><e9b>: Abbrev Number: 11 (DW_TAG_variable)
-    <e9c>   DW_AT_name        : (strp) (offset: 0x156): _Py_SwappedOp
+    <e9c>   DW_AT_name        : (strp) (offset: 0x179): _Py_SwappedOp
     <ea0>   DW_AT_decl_file   : (data1) 11
     <ea1>   DW_AT_decl_line   : (data2) 392
     <ea3>   DW_AT_decl_column : (data1) 17
     <ea4>   DW_AT_type        : (ref4) <0xe90>, int
     <ea8>   DW_AT_external    : (flag_present) 1
     <ea8>   DW_AT_declaration : (flag_present) 1
  <1><ea8>: Abbrev Number: 21 (DW_TAG_structure_type)
     <ea9>   DW_AT_byte_size   : (data1) 16
     <eaa>   DW_AT_decl_file   : (data1) 14
     <eab>   DW_AT_decl_line   : (data1) 58
     <eac>   DW_AT_decl_column : (data1) 5
     <ead>   DW_AT_sibling     : (ref4) <0xecc>
  <2><eb1>: Abbrev Number: 17 (DW_TAG_member)
-    <eb2>   DW_AT_name        : (strp) (offset: 0xf69): prefix
+    <eb2>   DW_AT_name        : (strp) (offset: 0x103f): prefix
     <eb6>   DW_AT_decl_file   : (data1) 14
